var pokemon=[];
pokemon[0] = 'フシギダネ,くさ,どく,45,49,49,65,65,45,6.9,しんりょく,ようりょくそ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%B7%E3%82%AE%E3%83%80%E3%83%8D';
pokemon[1] = 'フシギソウ,くさ,どく,60,62,63,80,80,60,13.0,しんりょく,ようりょくそ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%B7%E3%82%AE%E3%82%BD%E3%82%A6';
pokemon[2] = 'フシギバナ,くさ,どく,80,82,83,100,100,80,100.0,しんりょく,ようりょくそ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%B7%E3%82%AE%E3%83%90%E3%83%8A';
pokemon[3] = 'ヒトカゲ,ほのお,,39,52,43,60,50,65,8.5,もうか,サンパワー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%88%E3%82%AB%E3%82%B2';
pokemon[4] = 'リザード,ほのお,,58,64,58,80,65,80,19.0,もうか,サンパワー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%82%B6%E3%83%BC%E3%83%89';
pokemon[5] = 'リザードン,ほのお,ひこう,78,84,78,109,85,100,90.5,もうか,サンパワー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%82%B6%E3%83%BC%E3%83%89';
pokemon[6] = 'ゼニガメ,みず,,44,48,65,50,64,43,9.0,げきりゅう,あめうけざら,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BC%E3%83%8B%E3%82%AC%E3%83%A1';
pokemon[7] = 'カメール,みず,,59,63,80,65,80,58,22.5,げきりゅう,あめうけざら,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A1%E3%83%BC%E3%83%AB';
pokemon[8] = 'カメックス,みず,,79,83,100,85,105,78,85.5,げきりゅう,あめうけざら,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A1%E3%83%83%E3%82%AF%E3%82%B9';
pokemon[9] = 'アーボ,どく,,35,60,44,40,54,55,6.9,いかく,だっぴ,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%BC%E3%83%9C';
pokemon[10] = 'アーボック,どく,,60,95,69,65,79,80,65.0,いかく,だっぴ,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%BC%E3%83%9C';
pokemon[11] = 'ピカチュウ,でんき,,35,55,40,50,50,90,6.0,せいでんき,ひらいしん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%82%AB%E3%83%81%E3%83%A5%E3%82%A6';
pokemon[12] = 'ライチュウ,でんき,,60,90,55,90,80,110,30.0,せいでんき,ひらいしん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%82%A4%E3%83%81%E3%83%A5%E3%82%A6';
pokemon[13] = 'アローラライチュウ,でんき,エスパー,60,85,50,95,85,110,21.0,サーフテール,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%82%A4%E3%83%81%E3%83%A5%E3%82%A6';
pokemon[14] = 'サンド,じめん,,50,75,85,20,30,40,12.0,すながくれ,すなかき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%89';
pokemon[15] = 'アローラサンド,こおり,はがね,50,75,90,10,35,40,40.0,ゆきがくれ,ゆきかき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%89';
pokemon[16] = 'サンドパン,じめん,,75,100,110,45,55,65,29.5,すながくれ,すなかき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%89';
pokemon[17] = 'アローラサンドパン,こおり,はがね,75,100,120,25,65,65,55.0,ゆきがくれ,ゆきかき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%89';
pokemon[18] = 'ピッピ,フェアリー,,70,45,48,60,65,35,7.5,メロメロボディ,マジックガード,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%83%83%E3%83%94';
pokemon[19] = 'ピクシー,フェアリー,,95,70,73,95,90,60,40.0,メロメロボディ,マジックガード,てんねん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%82%AF%E3%82%B7%E3%83%BC';
pokemon[20] = 'ロコン,ほのお,,38,41,40,50,65,65,9.9,もらいび,ひでり,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%82%B3%E3%83%B3';
pokemon[21] = 'アローラロコン,こおり,,38,41,40,50,65,65,9.9,ゆきがくれ,ゆきふらし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%82%B3%E3%83%B3';
pokemon[22] = 'キュウコン,ほのお,,73,76,75,81,100,100,19.9,もらいび,ひでり,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%82%A6%E3%82%B3%E3%83%B3';
pokemon[23] = 'アローラキュウコン,こおり,フェアリー,73,67,75,81,100,109,19.9,ゆきがくれ,ゆきふらし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%82%A6%E3%82%B3%E3%83%B3';
pokemon[24] = 'プリン,ノーマル,フェアリー,115,45,20,45,25,20,5.5,メロメロボディ,かちき,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%97%E3%83%AA%E3%83%B3';
pokemon[25] = 'プクリン,ノーマル,フェアリー,140,70,45,85,50,45,12.0,メロメロボディ,かちき,おみとおし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%97%E3%82%AF%E3%83%AA%E3%83%B3';
pokemon[26] = 'ナゾノクサ,くさ,どく,45,50,55,75,65,30,5.4,ようりょくそ,にげあし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%82%BE%E3%83%8E%E3%82%AF%E3%82%B5';
pokemon[27] = 'クサイハナ,くさ,どく,60,65,70,85,75,40,8.6,ようりょくそ,あくしゅう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%82%B5%E3%82%A4%E3%83%8F%E3%83%8A';
pokemon[28] = 'ラフレシア,くさ,どく,75,80,85,110,90,50,18.6,ようりょくそ,ほうし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%95%E3%83%AC%E3%82%B7%E3%82%A2';
pokemon[29] = 'コンパン,むし,どく,60,55,50,40,55,45,30.0,ふくがん,いろめがね,にげあし,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%B3%E3%83%91%E3%83%B3';
pokemon[30] = 'モルフォン,むし,どく,70,65,60,90,75,90,12.5,りんぷん,いろめがね,ミラクルスキン,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%AB%E3%83%95%E3%82%A9%E3%83%B3';
pokemon[31] = 'ディグダ,じめん,,10,55,25,35,45,95,0.8,すながくれ,ありじごく,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%B0%E3%83%80';
pokemon[32] = 'アローラディグダ,じめん,はがね,10,55,30,35,45,90,1.0,すながくれ,カーリーヘアー,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%B0%E3%83%80';
pokemon[33] = 'ダグトリオ,じめん,,35,100,50,50,70,120,33.3,すながくれ,ありじごく,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%B0%E3%83%88%E3%83%AA%E3%82%AA';
pokemon[34] = 'アローラダグトリオ,じめん,はがね,35,100,60,50,70,110,66.6,すながくれ,カーリーヘアー,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%B0%E3%83%88%E3%83%AA%E3%82%AA';
pokemon[35] = 'ニャース,ノーマル,,40,45,35,40,40,90,4.2,ものひろい,テクニシャン,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%BC%E3%82%B9';
pokemon[36] = 'アローラニャース,あく,,40,35,35,50,40,90,4.2,ものひろい,テクニシャン,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%BC%E3%82%B9';
pokemon[37] = 'ガラルニャース,はがね,,50,65,55,40,40,40,7.5,ものひろい,かたいツメ,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%BC%E3%82%B9';
pokemon[38] = 'ペルシアン,ノーマル,,65,70,60,65,65,115,32.0,じゅうなん,テクニシャン,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9A%E3%83%AB%E3%82%B7%E3%82%A2%E3%83%B3';
pokemon[39] = 'アローラペルシアン,あく,,65,60,60,75,65,115,33.0,ファーコート,テクニシャン,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9A%E3%83%AB%E3%82%B7%E3%82%A2%E3%83%B3';
pokemon[40] = 'コダック,みず,,50,52,48,65,50,55,19.6,しめりけ,ノーてんき,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%80%E3%83%83%E3%82%AF';
pokemon[41] = 'ゴルダック,みず,,80,82,78,95,80,85,76.6,しめりけ,ノーてんき,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AB%E3%83%80%E3%83%83%E3%82%AF';
pokemon[42] = 'マンキー,かくとう,,40,80,35,35,45,70,28.0,やるき,いかりのつぼ,まけんき,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%B3%E3%82%AD%E3%83%BC';
pokemon[43] = 'オコリザル,かくとう,,65,105,60,60,70,95,32.0,やるき,いかりのつぼ,まけんき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%82%B3%E3%83%AA%E3%82%B6%E3%83%AB';
pokemon[44] = 'ガーディ,ほのお,,55,70,45,70,50,60,19.0,いかく,もらいび,せいぎのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%BC%E3%83%87%E3%82%A3';
pokemon[45] = 'ヒスイガーディ,ほのお,いわ,60,75,45,65,50,55,22.7,いかく,もらいび,いしあたま,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%BC%E3%83%87%E3%82%A3';
pokemon[46] = 'ウインディ,ほのお,,90,110,80,100,80,95,155.0,いかく,もらいび,せいぎのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A4%E3%83%B3%E3%83%87%E3%82%A3';
pokemon[47] = 'ヒスイウインディ,ほのお,いわ,95,115,80,95,80,90,168.0,いかく,もらいび,いしあたま,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A4%E3%83%B3%E3%83%87%E3%82%A3';
pokemon[48] = 'ニョロモ,みず,,40,50,40,40,40,90,12.4,ちょすい,しめりけ,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A7%E3%83%AD%E3%83%A2';
pokemon[49] = 'ニョロゾ,みず,,65,65,65,50,50,90,20.0,ちょすい,しめりけ,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A7%E3%83%AD%E3%82%BE';
pokemon[50] = 'ニョロボン,みず,かくとう,90,95,95,70,90,70,54.0,ちょすい,しめりけ,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A7%E3%83%AD%E3%83%9C%E3%83%B3';
pokemon[51] = 'マダツボミ,くさ,どく,50,75,35,70,30,40,4.0,ようりょくそ,くいしんぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%80%E3%83%84%E3%83%9C%E3%83%9F';
pokemon[52] = 'ウツドン,くさ,どく,65,90,50,85,45,55,6.4,ようりょくそ,くいしんぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%84%E3%83%89%E3%83%B3';
pokemon[53] = 'ウツボット,くさ,どく,80,105,65,100,70,70,15.5,ようりょくそ,くいしんぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%84%E3%83%9C%E3%83%83%E3%83%88';
pokemon[54] = 'メノクラゲ,みず,どく,40,40,35,50,100,70,45.5,クリアボディ,ヘドロえき,あめうけざら,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%8E%E3%82%AF%E3%83%A9%E3%82%B2';
pokemon[55] = 'ドククラゲ,みず,どく,80,70,65,80,120,100,55.0,クリアボディ,ヘドロえき,あめうけざら,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%82%AF%E3%82%AF%E3%83%A9%E3%82%B2';
pokemon[56] = 'イシツブテ,いわ,じめん,40,80,100,30,30,20,20.0,いしあたま,がんじょう,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%B7%E3%83%84%E3%83%96%E3%83%86';
pokemon[57] = 'アローライシツブテ,いわ,でんき,40,80,100,30,30,20,20.3,じりょく,がんじょう,エレキスキン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%B7%E3%83%84%E3%83%96%E3%83%86';
pokemon[58] = 'ゴローン,いわ,じめん,55,95,115,45,45,35,105.0,いしあたま,がんじょう,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AD%E3%83%BC%E3%83%B3';
pokemon[59] = 'アローラゴローン,いわ,でんき,55,95,115,45,45,35,110.0,じりょく,がんじょう,エレキスキン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AD%E3%83%BC%E3%83%B3';
pokemon[60] = 'ゴローニャ,いわ,じめん,80,120,130,55,65,45,300.0,いしあたま,がんじょう,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AD%E3%83%BC%E3%83%8B%E3%83%A3';
pokemon[61] = 'アローラゴローニャ,いわ,でんき,80,120,130,55,65,45,316.0,じりょく,がんじょう,エレキスキン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AD%E3%83%BC%E3%83%8B%E3%83%A3';
pokemon[62] = 'ヤドン,みず,エスパー,90,65,65,40,40,15,36.0,どんかん,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%83%B3';
pokemon[63] = 'ガラルヤドン,エスパー,,90,65,65,40,40,15,36.0,くいしんぼう,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%83%B3';
pokemon[64] = 'ヤドラン,みず,エスパー,95,75,110,100,80,30,78.5,どんかん,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%83%A9%E3%83%B3';
pokemon[65] = 'ガラルヤドラン,どく,エスパー,95,100,95,100,70,30,70.5,クイックドロウ,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%83%A9%E3%83%B3';
pokemon[66] = 'コイル,でんき,はがね,25,35,70,95,55,45,6.0,じりょく,がんじょう,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%A4%E3%83%AB';
pokemon[67] = 'レアコイル,でんき,はがね,50,60,95,120,70,70,60.0,じりょく,がんじょう,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%A4%E3%83%AB';
pokemon[68] = 'ドードー,ノーマル,ひこう,35,85,45,35,35,75,39.2,にげあし,はやおき,ちどりあし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%BC%E3%83%89%E3%83%BC';
pokemon[69] = 'ドードリオ,ノーマル,ひこう,60,110,70,60,60,110,85.2,にげあし,はやおき,ちどりあし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%BC%E3%83%89%E3%83%AA%E3%82%AA';
pokemon[70] = 'パウワウ,みず,,65,45,55,45,70,45,90.0,あついしぼう,うるおいボディ,アイスボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%82%A6%E3%83%AF%E3%82%A6';
pokemon[71] = 'ジュゴン,みず,こおり,90,70,80,70,95,70,120.0,あついしぼう,うるおいボディ,アイスボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%82%B4%E3%83%B3';
pokemon[72] = 'ベトベター,どく,,80,80,50,40,50,25,30.0,あくしゅう,ねんちゃく,どくしゅ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%88%E3%83%99%E3%82%BF%E3%83%BC';
pokemon[73] = 'アローラベトベター,どく,あく,80,80,50,40,50,25,42.0,どくしゅ,くいしんぼう,かがくのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%88%E3%83%99%E3%82%BF%E3%83%BC';
pokemon[74] = 'ベトベトン,どく,,105,105,75,65,100,50,30.0,あくしゅう,ねんちゃく,どくしゅ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%88%E3%83%99%E3%83%88%E3%83%B3';
pokemon[75] = 'アローラベトベトン,どく,あく,105,105,75,65,100,50,52.0,どくしゅ,くいしんぼう,かがくのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%88%E3%83%99%E3%83%88%E3%83%B3';
pokemon[76] = 'シェルダー,みず,,30,65,100,45,25,40,4.0,シェルアーマー,スキルリンク,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%A7%E3%83%AB%E3%83%80%E3%83%BC';
pokemon[77] = 'パルシェン,みず,こおり,50,95,180,85,45,70,132.5,シェルアーマー,スキルリンク,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%AB%E3%82%B7%E3%82%A7%E3%83%B3';
pokemon[78] = 'ゴース,ゴースト,どく,30,35,30,100,35,80,0.1,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%BC%E3%82%B9';
pokemon[79] = 'ゴースト,ゴースト,どく,45,50,45,115,55,95,0.1,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%BC%E3%82%B9';
pokemon[80] = 'ゲンガー,ゴースト,どく,60,65,60,130,75,110,40.5,のろわれボディ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B2%E3%83%B3%E3%82%AC%E3%83%BC';
pokemon[81] = 'スリープ,エスパー,,60,48,45,43,90,42,32.4,ふみん,よちむ,せいしんりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%AA%E3%83%BC%E3%83%97';
pokemon[82] = 'スリーパー,エスパー,,85,73,70,73,115,67,75.6,ふみん,よちむ,せいしんりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%AA%E3%83%BC%E3%83%91%E3%83%BC';
pokemon[83] = 'ビリリダマ,でんき,,40,30,50,55,55,100,10.4,ぼうおん,せいでんき,ゆうばく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%AA%E3%83%AA%E3%83%80%E3%83%9E';
pokemon[84] = 'ヒスイビリリダマ,でんき,くさ,40,30,50,55,55,100,13.0,ぼうおん,せいでんき,ゆうばく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%AA%E3%83%AA%E3%83%80%E3%83%9E';
pokemon[85] = 'マルマイン,でんき,,60,50,70,80,80,150,66.6,ぼうおん,せいでんき,ゆうばく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%AB%E3%83%9E%E3%82%A4%E3%83%B3';
pokemon[86] = 'ヒスイマルマイン,でんき,くさ,60,50,70,80,80,150,71.0,ぼうおん,せいでんき,ゆうばく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%AB%E3%83%9E%E3%82%A4%E3%83%B3';
pokemon[87] = 'タマタマ,くさ,エスパー,60,40,80,60,45,40,2.5,ようりょくそ,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%9E%E3%82%BF%E3%83%9E';
pokemon[88] = 'ナッシー,くさ,エスパー,95,95,85,125,75,55,120.0,ようりょくそ,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%83%E3%82%B7%E3%83%BC';
pokemon[89] = 'アローラナッシー,くさ,ドラゴン,95,105,85,125,75,45,415.6,おみとおし,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%83%E3%82%B7%E3%83%BC';
pokemon[90] = 'サワムラー,かくとう,,50,120,53,35,110,87,49.8,じゅうなん,すてみ,かるわざ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%AF%E3%83%A0%E3%83%A9%E3%83%BC';
pokemon[91] = 'エビワラー,かくとう,,50,105,79,35,110,76,50.2,するどいめ,てつのこぶし,せいしんりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%93%E3%83%AF%E3%83%A9%E3%83%BC';
pokemon[92] = 'ドガース,どく,,40,65,95,60,45,35,1.0,ふゆう,かがくへんかガス,あくしゅう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%82%AC%E3%83%BC%E3%82%B9';
pokemon[93] = 'マタドガス,どく,,65,90,120,85,70,60,9.5,ふゆう,かがくへんかガス,あくしゅう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%BF%E3%83%89%E3%82%AC%E3%82%B9';
pokemon[94] = 'ガラルマタドガス,どく,フェアリー,65,90,120,85,70,60,16.0,ふゆう,かがくへんかガス,ミストメイカー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%BF%E3%83%89%E3%82%AC%E3%82%B9';
pokemon[95] = 'サイホーン,じめん,いわ,80,85,95,30,30,25,115.0,ひらいしん,いしあたま,すてみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%A4%E3%83%9B%E3%83%BC%E3%83%B3';
pokemon[96] = 'サイドン,じめん,いわ,105,130,120,45,45,40,120.0,ひらいしん,いしあたま,すてみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%A4%E3%83%89%E3%83%B3';
pokemon[97] = 'ラッキー,ノーマル,,250,5,5,35,105,50,34.6,しぜんかいふく,てんのめぐみ,いやしのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%83%E3%82%AD%E3%83%BC';
pokemon[98] = 'タッツー,みず,,30,40,70,70,25,60,8.0,すいすい,スナイパー,しめりけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%83%E3%83%84%E3%83%BC';
pokemon[99] = 'シードラ,みず,,55,65,95,95,45,85,25.0,どくのトゲ,スナイパー,しめりけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%BC%E3%83%89%E3%83%A9';
pokemon[100] = 'ストライク,むし,ひこう,70,110,80,55,80,105,56.0,むしのしらせ,テクニシャン,ふくつのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%88%E3%83%A9%E3%82%A4%E3%82%AF';
pokemon[101] = 'エレブー,でんき,,65,83,57,95,85,105,30.0,せいでんき,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AC%E3%83%96%E3%83%BC';
pokemon[102] = 'ブーバー,ほのお,,65,95,57,100,85,93,44.5,ほのおのからだ,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%BC%E3%83%90%E3%83%BC';
pokemon[103] = 'ケンタロス,ノーマル,,75,100,95,40,70,110,88.4,いかく,いかりのつぼ,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%B3%E3%82%BF%E3%83%AD%E3%82%B9';
pokemon[104] = 'パルデアケンタロス(かくとう),かくとう,,75,110,105,30,70,100,115.0,いかく,いかりのつぼ,はんすう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%B3%E3%82%BF%E3%83%AD%E3%82%B9';
pokemon[105] = 'パルデアケンタロス(ほのお),かくとう,ほのお,75,110,105,30,70,100,85.0,いかく,いかりのつぼ,はんすう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%B3%E3%82%BF%E3%83%AD%E3%82%B9';
pokemon[106] = 'パルデアケンタロス(みず),かくとう,みず,75,110,105,30,70,100,110.0,いかく,いかりのつぼ,はんすう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%B3%E3%82%BF%E3%83%AD%E3%82%B9';
pokemon[107] = 'コイキング,みず,,20,10,55,15,20,80,10.0,すいすい,びびり,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%A4%E3%82%AD%E3%83%B3%E3%82%B0';
pokemon[108] = 'ギャラドス,みず,ひこう,95,125,79,60,100,81,235.0,いかく,じしんかじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AE%E3%83%A3%E3%83%A9%E3%83%89%E3%82%B9';
pokemon[109] = 'ラプラス,みず,こおり,130,85,80,85,95,60,220.0,ちょすい,シェルアーマー,うるおいボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%97%E3%83%A9%E3%82%B9';
pokemon[110] = 'メタモン,ノーマル,,48,48,48,48,48,48,4.0,じゅうなん,かわりもの,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%BF%E3%83%A2%E3%83%B3';
pokemon[111] = 'イーブイ,ノーマル,,55,55,50,45,65,55,6.5,にげあし,てきおうりょく,きけんよち,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%BC%E3%83%96%E3%82%A4';
pokemon[112] = 'シャワーズ,みず,,130,65,60,110,95,65,29.0,ちょすい,うるおいボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%A3%E3%83%AF%E3%83%BC%E3%82%BA';
pokemon[113] = 'サンダース,でんき,,65,65,60,110,95,130,24.5,ちくでん,はやあし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%80%E3%83%BC%E3%82%B9';
pokemon[114] = 'ブースター,ほのお,,65,130,60,95,110,65,25.0,もらいび,こんじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%BC%E3%82%B9%E3%82%BF%E3%83%BC';
pokemon[115] = 'ポリゴン,ノーマル,,65,60,70,85,75,40,36.5,トレース,ダウンロード,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%AA%E3%82%B4%E3%83%B3';
pokemon[116] = 'カビゴン,ノーマル,,160,110,65,65,110,30,460.0,めんえき,あついしぼう,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%93%E3%82%B4%E3%83%B3';
pokemon[117] = 'フリーザー,こおり,ひこう,90,85,100,95,125,85,55.4,プレッシャー,ゆきがくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%82%B6%E3%83%BC';
pokemon[118] = 'ガラルフリーザー,エスパー,ひこう,90,85,85,125,100,95,50.9,かちき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%82%B6%E3%83%BC';
pokemon[119] = 'サンダー,でんき,ひこう,90,90,85,125,90,100,52.6,プレッシャー,せいでんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%80%E3%83%BC';
pokemon[120] = 'ガラルサンダー,かくとう,ひこう,90,125,90,85,90,100,58.2,まけんき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%B3%E3%83%80%E3%83%BC';
pokemon[121] = 'ファイヤー,ほのお,ひこう,90,100,90,125,85,90,60.0,プレッシャー,ほのおのからだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A1%E3%82%A4%E3%83%A4%E3%83%BC';
pokemon[122] = 'ガラルファイヤー,あく,ひこう,90,85,90,100,125,90,66.0,ぎゃくじょう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A1%E3%82%A4%E3%83%A4%E3%83%BC';
pokemon[123] = 'ミニリュウ,ドラゴン,,41,64,45,50,50,50,3.3,だっぴ,ふしぎなうろこ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%8B%E3%83%AA%E3%83%A5%E3%82%A6';
pokemon[124] = 'ハクリュー,ドラゴン,,61,84,65,70,70,70,16.5,だっぴ,ふしぎなうろこ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%82%AF%E3%83%AA%E3%83%A5%E3%83%BC';
pokemon[125] = 'カイリュー,ドラゴン,ひこう,91,134,95,100,100,80,210.0,せいしんりょく,マルチスケイル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A4%E3%83%AA%E3%83%A5%E3%83%BC';
pokemon[126] = 'ミュウツー,エスパー,,106,110,90,154,90,130,122.0,プレッシャー,きんちょうかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%A5%E3%82%A6%E3%83%84%E3%83%BC';
pokemon[127] = 'ミュウ,エスパー,,100,100,100,100,100,100,4.0,シンクロ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%A5%E3%82%A6';
pokemon[128] = 'チコリータ,くさ,,45,49,65,49,65,45,6.4,しんりょく,リーフガード,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%82%B3%E3%83%AA%E3%83%BC%E3%82%BF';
pokemon[129] = 'ベイリーフ,くさ,,60,62,80,63,80,60,15.8,しんりょく,リーフガード,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%82%A4%E3%83%AA%E3%83%BC%E3%83%95';
pokemon[130] = 'メガニウム,くさ,,80,82,100,83,100,80,100.5,しんりょく,リーフガード,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%AC%E3%83%8B%E3%82%A6%E3%83%A0';
pokemon[131] = 'ヒノアラシ,ほのお,,39,52,43,60,50,65,7.9,もうか,もらいび,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%8E%E3%82%A2%E3%83%A9%E3%82%B7';
pokemon[132] = 'マグマラシ,ほのお,,58,64,58,80,65,80,19.0,もうか,もらいび,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B0%E3%83%9E%E3%83%A9%E3%82%B7';
pokemon[133] = 'バクフーン,ほのお,,78,84,78,109,85,100,79.5,もうか,もらいび,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%AF%E3%83%95%E3%83%BC%E3%83%B3';
pokemon[134] = 'ヒスイバクフーン,ほのお,ゴースト,73,84,78,119,85,95,69.8,もうか,おみとおし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%AF%E3%83%95%E3%83%BC%E3%83%B3';
pokemon[135] = 'ワニノコ,みず,,50,65,64,44,48,43,9.5,げきりゅう,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%83%8B%E3%83%8E%E3%82%B3';
pokemon[136] = 'アリゲイツ,みず,,65,80,80,59,63,58,25.0,げきりゅう,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%AA%E3%82%B2%E3%82%A4%E3%83%84';
pokemon[137] = 'オーダイル,みず,,85,105,100,79,83,78,88.8,げきりゅう,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%83%80%E3%82%A4%E3%83%AB';
pokemon[138] = 'オタチ,ノーマル,,35,46,34,35,45,20,6.0,にげあし,するどいめ,おみとおし,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%82%BF%E3%83%81';
pokemon[139] = 'オオタチ,ノーマル,,85,76,64,45,55,90,32.5,にげあし,するどいめ,おみとおし,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%82%BF%E3%83%81';
pokemon[140] = 'ホーホー,ノーマル,ひこう,60,30,30,36,56,50,21.2,ふみん,するどいめ,いろめがね,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9B%E3%83%BC%E3%83%9B%E3%83%BC';
pokemon[141] = 'ヨルノズク,ノーマル,ひこう,100,50,50,86,96,70,40.8,ふみん,するどいめ,いろめがね,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A8%E3%83%AB%E3%83%8E%E3%82%BA%E3%82%AF';
pokemon[142] = 'イトマル,むし,どく,40,60,40,40,40,30,8.5,むしのしらせ,ふみん,スナイパー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%88%E3%83%9E%E3%83%AB';
pokemon[143] = 'アリアドス,むし,どく,70,90,70,60,70,40,33.5,むしのしらせ,ふみん,スナイパー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%AA%E3%82%A2%E3%83%89%E3%82%B9';
pokemon[144] = 'チョンチー,みず,でんき,75,38,38,56,56,67,12.0,ちくでん,はっこう,ちょすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A7%E3%83%B3%E3%83%81%E3%83%BC';
pokemon[145] = 'ランターン,みず,でんき,125,58,58,76,76,67,22.5,ちくでん,はっこう,ちょすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%82%BF%E3%83%BC%E3%83%B3';
pokemon[146] = 'ピチュー,でんき,,20,40,15,35,35,60,2.0,せいでんき,ひらいしん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%83%81%E3%83%A5%E3%83%BC';
pokemon[147] = 'ピィ,フェアリー,,50,25,28,45,55,15,3.0,メロメロボディ,マジックガード,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%82%A3';
pokemon[148] = 'ププリン,ノーマル,フェアリー,90,30,15,40,20,15,1.0,メロメロボディ,かちき,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%97%E3%83%AA%E3%83%B3';
pokemon[149] = 'メリープ,でんき,,55,40,40,65,45,35,7.8,せいでんき,プラス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%AA%E3%83%BC%E3%83%97';
pokemon[150] = 'モココ,でんき,,70,55,55,80,60,45,13.3,せいでんき,プラス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%82%B3%E3%82%B3';
pokemon[151] = 'デンリュウ,でんき,,90,75,85,115,90,55,61.5,せいでんき,プラス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%B3%E3%83%AA%E3%83%A5%E3%82%A6';
pokemon[152] = 'キレイハナ,くさ,,75,80,95,90,100,50,5.8,ようりょくそ,いやしのこころ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%AC%E3%82%A4%E3%83%8F%E3%83%8A';
pokemon[153] = 'マリル,みず,フェアリー,70,20,50,20,50,40,8.5,あついしぼう,ちからもち,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%AA%E3%83%AB';
pokemon[154] = 'マリルリ,みず,フェアリー,100,50,80,60,80,50,28.5,あついしぼう,ちからもち,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%AA%E3%83%AB';
pokemon[155] = 'ウソッキー,いわ,,70,100,115,30,65,30,38.0,がんじょう,いしあたま,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%BD%E3%83%83%E3%82%AD%E3%83%BC';
pokemon[156] = 'ニョロトノ,みず,,90,75,75,90,100,70,33.9,ちょすい,しめりけ,あめふらし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A7%E3%83%AD%E3%83%88%E3%83%8E';
pokemon[157] = 'ハネッコ,くさ,ひこう,35,35,40,35,55,50,0.5,ようりょくそ,リーフガード,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%8D%E3%83%83%E3%82%B3';
pokemon[158] = 'ポポッコ,くさ,ひこう,55,45,50,45,65,80,1.0,ようりょくそ,リーフガード,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%9D%E3%83%83%E3%82%B3';
pokemon[159] = 'ワタッコ,くさ,ひこう,75,55,70,55,95,110,3.0,ようりょくそ,リーフガード,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%82%BF%E3%83%83%E3%82%B3';
pokemon[160] = 'エイパム,ノーマル,,55,70,55,40,55,85,11.5,にげあし,ものひろい,スキルリンク,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%82%A4%E3%83%91%E3%83%A0';
pokemon[161] = 'ヒマナッツ,くさ,,30,30,30,30,30,30,1.8,ようりょくそ,サンパワー,はやおき,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%9E%E3%83%8A%E3%83%83%E3%83%84';
pokemon[162] = 'キマワリ,くさ,,75,75,55,105,85,30,8.5,ようりょくそ,サンパワー,はやおき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%9E%E3%83%AF%E3%83%AA';
pokemon[163] = 'ヤンヤンマ,むし,ひこう,65,65,45,75,45,95,38.0,かそく,ふくがん,おみとおし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%B3%E3%83%A4%E3%83%B3%E3%83%9E';
pokemon[164] = 'ウパー,みず,じめん,55,45,45,25,25,15,8.5,しめりけ,ちょすい,てんねん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%91%E3%83%BC';
pokemon[165] = 'パルデアウパー,どく,じめん,55,45,45,25,25,15,11.0,どくのトゲ,ちょすい,てんねん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%91%E3%83%BC';
pokemon[166] = 'ヌオー,みず,じめん,95,85,85,65,65,35,75.0,しめりけ,ちょすい,てんねん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%82%AA%E3%83%BC';
pokemon[167] = 'エーフィ,エスパー,,65,65,60,130,95,110,26.5,シンクロ,マジックミラー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%BC%E3%83%95%E3%82%A3';
pokemon[168] = 'ブラッキー,あく,,95,65,110,60,130,65,27.0,シンクロ,せいしんりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%83%E3%82%AD%E3%83%BC';
pokemon[169] = 'ヤミカラス,あく,ひこう,60,85,42,85,42,91,2.1,ふみん,きょううん,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%9F%E3%82%AB%E3%83%A9%E3%82%B9';
pokemon[170] = 'ヤドキング,みず,エスパー,95,75,80,100,110,30,79.5,どんかん,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%82%AD%E3%83%B3%E3%82%B0';
pokemon[171] = 'ガラルヤドキング,どく,エスパー,95,65,80,110,110,30,79.5,きみょうなくすり,マイペース,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%89%E3%82%AD%E3%83%B3%E3%82%B0';
pokemon[172] = 'ムウマ,ゴースト,,60,60,60,85,85,85,1.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%82%A6%E3%83%9E';
pokemon[173] = 'キリンリキ,ノーマル,エスパー,70,80,65,90,65,85,41.5,せいしんりょく,はやおき,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%AA%E3%83%B3%E3%83%AA%E3%82%AD';
pokemon[174] = 'クヌギダマ,むし,,50,65,90,35,35,15,7.2,がんじょう,ぼうじん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%8C%E3%82%AE%E3%83%80%E3%83%9E';
pokemon[175] = 'フォレトス,むし,はがね,75,90,140,60,60,40,125.8,がんじょう,ぼうじん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A9%E3%83%AC%E3%83%88%E3%82%B9';
pokemon[176] = 'ノコッチ,ノーマル,,100,70,70,65,65,45,14.0,てんのめぐみ,にげあし,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8E%E3%82%B3%E3%83%83%E3%83%81';
pokemon[177] = 'グライガー,じめん,ひこう,65,75,105,35,65,85,64.8,かいりきバサミ,すながくれ,めんえき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%A9%E3%82%A4%E3%82%AC%E3%83%BC';
pokemon[178] = 'ブルー,フェアリー,,60,80,50,40,40,30,7.8,いかく,にげあし,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AB%E3%83%BC';
pokemon[179] = 'グランブル,フェアリー,,90,120,75,60,60,45,48.7,いかく,はやあし,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%A9%E3%83%B3%E3%83%96%E3%83%AB';
pokemon[180] = 'ハリーセン,みず,どく,65,95,85,55,55,85,3.9,どくのトゲ,すいすい,いかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%BC%E3%82%BB%E3%83%B3';
pokemon[181] = 'ヒスイハリーセン,あく,どく,65,95,85,55,55,85,3.9,どくのトゲ,すいすい,いかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%BC%E3%82%BB%E3%83%B3';
pokemon[182] = 'ハッサム,むし,はがね,70,130,100,55,80,65,118.0,むしのしらせ,テクニシャン,ライトメタル,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%83%E3%82%B5%E3%83%A0';
pokemon[183] = 'ヘラクロス,むし,かくとう,80,125,75,40,95,85,54.0,むしのしらせ,こんじょう,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%98%E3%83%A9%E3%82%AF%E3%83%AD%E3%82%B9';
pokemon[184] = 'ニューラ,あく,こおり,55,95,55,35,75,115,28.0,せいしんりょく,するどいめ,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%A9';
pokemon[185] = 'ヒスイニューラ,かくとう,どく,55,95,55,35,75,115,27.0,せいしんりょく,するどいめ,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%A9';
pokemon[186] = 'ヒメグマ,ノーマル,,60,80,50,50,50,40,8.8,ものひろい,はやあし,みつあつめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%A1%E3%82%B0%E3%83%9E';
pokemon[187] = 'リングマ,ノーマル,,90,130,75,75,75,55,125.8,こんじょう,はやあし,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%83%B3%E3%82%B0%E3%83%9E';
pokemon[188] = 'マグマッグ,ほのお,,40,40,40,70,40,20,35.0,マグマのよろい,ほのおのからだ,くだけるよろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B0%E3%83%9E%E3%83%83%E3%82%B0';
pokemon[189] = 'マグカルゴ,ほのお,いわ,60,50,120,90,80,30,55.0,マグマのよろい,ほのおのからだ,くだけるよろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B0%E3%82%AB%E3%83%AB%E3%82%B4';
pokemon[190] = 'ウリムー,こおり,じめん,50,50,40,30,30,50,6.5,どんかん,ゆきがくれ,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%AA%E3%83%A0%E3%83%BC';
pokemon[191] = 'イノムー,こおり,じめん,100,100,80,60,60,50,55.8,どんかん,ゆきがくれ,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%8E%E3%83%A0%E3%83%BC';
pokemon[192] = 'デリバード,こおり,ひこう,45,55,45,65,45,75,16.0,やるき,はりきり,ふみん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%AA%E3%83%90%E3%83%BC%E3%83%89';
pokemon[193] = 'エアームド,はがね,ひこう,65,80,140,40,70,70,50.5,するどいめ,がんじょう,くだけるよろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%82%A2%E3%83%BC%E3%83%A0%E3%83%89';
pokemon[194] = 'デルビル,あく,ほのお,45,60,30,80,50,65,10.8,はやおき,もらいび,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%AB%E3%83%93%E3%83%AB';
pokemon[195] = 'ヘルガー,あく,ほのお,75,90,50,110,80,95,35.0,はやおき,もらいび,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%98%E3%83%AB%E3%82%AC%E3%83%BC';
pokemon[196] = 'キングドラ,みず,ドラゴン,75,95,95,95,95,85,152.0,すいすい,スナイパー,しめりけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%B3%E3%82%B0%E3%83%89%E3%83%A9';
pokemon[197] = 'ゴマゾウ,じめん,,90,60,60,40,40,40,33.5,ものひろい,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%9E%E3%82%BE%E3%82%A6';
pokemon[198] = 'ドンファン,じめん,,90,120,120,60,60,50,120.0,がんじょう,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%B3%E3%83%95%E3%82%A1%E3%83%B3';
pokemon[199] = 'ポリゴン２,ノーマル,,85,80,90,105,95,60,32.5,トレース,ダウンロード,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%AA%E3%82%B4%E3%83%B3';
pokemon[200] = 'オドシシ,ノーマル,,73,95,62,85,65,85,71.2,いかく,おみとおし,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%89%E3%82%B7%E3%82%B7';
pokemon[201] = 'ドーブル,ノーマル,,55,20,35,20,45,75,58.0,マイペース,テクニシャン,ムラっけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%BC%E3%83%96%E3%83%AB';
pokemon[202] = 'バルキー,かくとう,,35,35,35,35,35,35,21.0,こんじょう,ふくつのこころ,やるき,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%AB%E3%82%AD%E3%83%BC';
pokemon[203] = 'カポエラー,かくとう,,50,95,95,35,110,70,48.0,いかく,テクニシャン,ふくつのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%9D%E3%82%A8%E3%83%A9%E3%83%BC';
pokemon[204] = 'エレキッド,でんき,,45,63,37,65,55,95,23.5,せいでんき,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AC%E3%82%AD%E3%83%83%E3%83%89';
pokemon[205] = 'ブビィ,ほのお,,45,75,37,70,55,83,21.4,ほのおのからだ,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%93%E3%82%A3';
pokemon[206] = 'ハピナス,ノーマル,,255,10,10,75,135,55,46.8,しぜんかいふく,てんのめぐみ,いやしのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%94%E3%83%8A%E3%82%B9';
pokemon[207] = 'ライコウ,でんき,,90,85,75,115,100,115,178.0,プレッシャー,せいしんりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%82%A4%E3%82%B3%E3%82%A6';
pokemon[208] = 'エンテイ,ほのお,,115,115,85,90,75,100,198.0,プレッシャー,せいしんりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A4';
pokemon[209] = 'スイクン,みず,,100,75,115,90,115,85,187.0,プレッシャー,せいしんりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%82%A4%E3%82%AF%E3%83%B3';
pokemon[210] = 'ヨーギラス,いわ,じめん,50,64,50,45,50,41,72.0,こんじょう,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A8%E3%83%BC%E3%82%AE%E3%83%A9%E3%82%B9';
pokemon[211] = 'サナギラス,いわ,じめん,70,84,70,65,70,51,152.0,だっぴ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%8A%E3%82%AE%E3%83%A9%E3%82%B9';
pokemon[212] = 'バンギラス,いわ,あく,100,134,110,95,100,61,202.0,すなおこし,きんちょうかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%B3%E3%82%AE%E3%83%A9%E3%82%B9';
pokemon[213] = 'ルギア,エスパー,ひこう,106,90,130,90,154,110,216.0,プレッシャー,マルチスケイル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AE%E3%82%A2';
pokemon[214] = 'ホウオウ,ほのお,ひこう,106,130,90,110,154,90,199.0,プレッシャー,さいせいりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9B%E3%82%A6%E3%82%AA%E3%82%A6';
pokemon[215] = 'キモリ,くさ,,40,45,35,65,55,70,5.0,しんりょく,かるわざ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A2%E3%83%AA';
pokemon[216] = 'ジュプトル,くさ,,50,65,45,85,65,95,21.6,しんりょく,かるわざ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%83%97%E3%83%88%E3%83%AB';
pokemon[217] = 'ジュカイン,くさ,,70,85,65,105,85,120,52.2,しんりょく,かるわざ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%82%AB%E3%82%A4%E3%83%B3';
pokemon[218] = 'アチャモ,ほのお,,45,60,40,70,50,45,2.5,もうか,かそく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%81%E3%83%A3%E3%83%A2';
pokemon[219] = 'ワカシャモ,ほのお,かくとう,60,85,60,85,60,55,19.5,もうか,かそく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%82%AB%E3%82%B7%E3%83%A3%E3%83%A2';
pokemon[220] = 'バシャーモ,ほのお,かくとう,80,120,70,110,70,80,52.0,もうか,かそく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%B7%E3%83%A3%E3%83%BC%E3%83%A2';
pokemon[221] = 'ミズゴロウ,みず,,50,70,50,50,50,40,7.6,げきりゅう,しめりけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%82%BA%E3%82%B4%E3%83%AD%E3%82%A6';
pokemon[222] = 'ヌマクロー,みず,じめん,70,85,70,60,70,50,28.0,げきりゅう,しめりけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%9E%E3%82%AF%E3%83%AD%E3%83%BC';
pokemon[223] = 'ラグラージ,みず,じめん,100,110,90,85,90,60,81.9,げきりゅう,しめりけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%82%B0%E3%83%A9%E3%83%BC%E3%82%B8';
pokemon[224] = 'ポチエナ,あく,,35,55,35,30,30,35,13.6,にげあし,はやあし,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%81%E3%82%A8%E3%83%8A';
pokemon[225] = 'グラエナ,あく,,70,90,70,60,60,70,37.0,いかく,はやあし,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%A9%E3%82%A8%E3%83%8A';
pokemon[226] = 'ハスボー,みず,くさ,40,30,30,40,50,30,2.6,すいすい,あめうけざら,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%82%B9%E3%83%9C%E3%83%BC';
pokemon[227] = 'ハスブレロ,みず,くさ,60,50,50,60,70,50,32.5,すいすい,あめうけざら,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%82%B9%E3%83%96%E3%83%AC%E3%83%AD';
pokemon[228] = 'ルンパッパ,みず,くさ,80,70,70,90,100,70,55.0,すいすい,あめうけざら,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%83%B3%E3%83%91%E3%83%83%E3%83%91';
pokemon[229] = 'タネボー,くさ,,40,40,50,30,30,30,4.0,ようりょくそ,はやおき,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%8D%E3%83%9C%E3%83%BC';
pokemon[230] = 'コノハナ,くさ,あく,70,70,40,60,40,60,28.0,ようりょくそ,はやおき,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%8E%E3%83%8F%E3%83%8A';
pokemon[231] = 'ダーテング,くさ,あく,90,100,60,90,60,80,59.6,ようりょくそ,かぜのり,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%83%BC%E3%83%86%E3%83%B3%E3%82%B0';
pokemon[232] = 'キャモメ,みず,ひこう,40,30,30,55,30,85,9.5,するどいめ,うるおいボディ,あめうけざら,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A3%E3%83%A2%E3%83%A1';
pokemon[233] = 'ペリッパー,みず,ひこう,60,50,100,95,70,65,28.0,するどいめ,あめふらし,あめうけざら,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9A%E3%83%AA%E3%83%83%E3%83%91%E3%83%BC';
pokemon[234] = 'ラルトス,エスパー,フェアリー,28,25,25,45,35,40,6.6,シンクロ,トレース,テレパシー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%AB%E3%83%88%E3%82%B9';
pokemon[235] = 'キルリア,エスパー,フェアリー,38,35,35,65,55,50,20.2,シンクロ,トレース,テレパシー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%AB%E3%83%AA%E3%82%A2';
pokemon[236] = 'サーナイト,エスパー,フェアリー,68,65,65,125,115,80,48.4,シンクロ,トレース,テレパシー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%BC%E3%83%8A%E3%82%A4%E3%83%88';
pokemon[237] = 'アメタマ,むし,みず,40,30,32,50,52,65,1.7,すいすい,あめうけざら,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%A1%E3%82%BF%E3%83%9E';
pokemon[238] = 'アメモース,むし,ひこう,70,60,62,100,82,80,3.6,いかく,きんちょうかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%A1%E3%83%A2%E3%83%BC%E3%82%B9';
pokemon[239] = 'キノココ,くさ,,60,40,60,40,60,35,4.5,ほうし,ポイズンヒール,はやあし,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%8E%E3%82%B3%E3%82%B3';
pokemon[240] = 'キノガッサ,くさ,かくとう,60,130,80,60,60,70,39.2,ほうし,ポイズンヒール,テクニシャン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%8E%E3%82%AC%E3%83%83%E3%82%B5';
pokemon[241] = 'ナマケロ,ノーマル,,60,60,60,35,35,30,24.0,なまけ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%9E%E3%82%B1%E3%83%AD';
pokemon[242] = 'ヤルキモノ,ノーマル,,80,80,80,55,55,90,46.5,やるき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%AB%E3%82%AD%E3%83%A2%E3%83%8E';
pokemon[243] = 'ケッキング,ノーマル,,150,160,100,95,65,100,130.5,なまけ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%83%E3%82%AD%E3%83%B3%E3%82%B0';
pokemon[244] = 'マクノシタ,かくとう,,72,60,30,20,30,25,86.4,あついしぼう,こんじょう,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%AF%E3%83%8E%E3%82%B7%E3%82%BF';
pokemon[245] = 'ハリテヤマ,かくとう,,144,120,60,40,60,50,253.8,あついしぼう,こんじょう,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%86%E3%83%A4%E3%83%9E';
pokemon[246] = 'ルリリ,ノーマル,フェアリー,50,20,40,20,40,20,2.0,あついしぼう,ちからもち,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%83%AA%E3%83%AA';
pokemon[247] = 'ノズパス,いわ,,30,45,135,45,90,30,97.0,がんじょう,じりょく,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8E%E3%82%BA%E3%83%91%E3%82%B9';
pokemon[248] = 'ヤミラミ,あく,ゴースト,50,75,75,65,65,50,11.0,するどいめ,あとだし,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%9F%E3%83%A9%E3%83%9F';
pokemon[249] = 'アサナン,かくとう,エスパー,30,40,55,40,55,60,11.2,ヨガパワー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%B5%E3%83%8A%E3%83%B3';
pokemon[250] = 'チャーレム,かくとう,エスパー,60,60,75,60,75,80,31.5,ヨガパワー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A3%E3%83%BC%E3%83%AC%E3%83%A0';
pokemon[251] = 'プラスル,でんき,,60,50,40,85,75,95,4.2,プラス,ひらいしん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%97%E3%83%A9%E3%82%B9%E3%83%AB';
pokemon[252] = 'マイナン,でんき,,60,40,50,75,85,95,4.2,マイナス,ちくでん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%A4%E3%83%8A%E3%83%B3';
pokemon[253] = 'バルビート,むし,,65,73,75,47,85,85,17.7,はっこう,むしのしらせ,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%AB%E3%83%93%E3%83%BC%E3%83%88';
pokemon[254] = 'イルミーゼ,むし,,65,47,75,73,85,85,17.7,どんかん,いろめがね,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%AB%E3%83%9F%E3%83%BC%E3%82%BC';
pokemon[255] = 'ゴクリン,どく,,70,43,53,43,53,40,10.3,ヘドロえき,ねんちゃく,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%82%AF%E3%83%AA%E3%83%B3';
pokemon[256] = 'マルノーム,どく,,100,73,83,73,83,55,80.0,ヘドロえき,ねんちゃく,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%AB%E3%83%8E%E3%83%BC%E3%83%A0';
pokemon[257] = 'ドンメル,ほのお,じめん,60,60,40,65,45,35,24.0,どんかん,たんじゅん,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%B3%E3%83%A1%E3%83%AB';
pokemon[258] = 'バクーダ,ほのお,じめん,70,100,70,105,75,40,220.0,マグマのよろい,ハードロック,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%AF%E3%83%BC%E3%83%80';
pokemon[259] = 'コータス,ほのお,,70,85,140,85,70,20,80.4,しろいけむり,ひでり,シェルアーマー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%BC%E3%82%BF%E3%82%B9';
pokemon[260] = 'バネブー,エスパー,,60,25,35,70,80,60,30.6,あついしぼう,マイペース,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%8D%E3%83%96%E3%83%BC';
pokemon[261] = 'ブーピッグ,エスパー,,80,45,65,90,110,80,71.5,あついしぼう,マイペース,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%BC%E3%83%94%E3%83%83%E3%82%B0';
pokemon[262] = 'ナックラー,じめん,,45,100,45,45,45,10,15.0,かいりきバサミ,ありじごく,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%83%E3%82%AF%E3%83%A9%E3%83%BC';
pokemon[263] = 'ビブラーバ,じめん,ドラゴン,50,70,50,50,50,70,15.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%96%E3%83%A9%E3%83%BC%E3%83%90';
pokemon[264] = 'フライゴン,じめん,ドラゴン,80,100,80,80,80,100,82.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%A9%E3%82%A4%E3%82%B4%E3%83%B3';
pokemon[265] = 'サボネア,くさ,,50,85,40,85,40,35,51.3,すながくれ,ちょすい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%9C%E3%83%8D%E3%82%A2';
pokemon[266] = 'ノクタス,くさ,あく,70,115,60,115,60,55,77.4,すながくれ,ちょすい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8E%E3%82%AF%E3%82%BF%E3%82%B9';
pokemon[267] = 'チルット,ノーマル,ひこう,45,40,60,40,75,50,1.2,しぜんかいふく,ノーてんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%AB%E3%83%83%E3%83%88';
pokemon[268] = 'チルタリス,ドラゴン,ひこう,75,70,90,70,105,80,20.6,しぜんかいふく,ノーてんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%AB%E3%82%BF%E3%83%AA%E3%82%B9';
pokemon[269] = 'ザングース,ノーマル,,73,115,60,60,60,90,40.3,めんえき,どくぼうそう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%83%B3%E3%82%B0%E3%83%BC%E3%82%B9';
pokemon[270] = 'ハブネーク,どく,,73,100,60,100,60,65,52.5,だっぴ,すりぬけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%96%E3%83%8D%E3%83%BC%E3%82%AF';
pokemon[271] = 'ドジョッチ,みず,じめん,50,48,43,46,41,60,1.9,どんかん,きけんよち,うるおいボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%82%B8%E3%83%A7%E3%83%83%E3%83%81';
pokemon[272] = 'ナマズン,みず,じめん,110,78,73,76,71,60,23.6,どんかん,きけんよち,うるおいボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%9E%E3%82%BA%E3%83%B3';
pokemon[273] = 'ヘイガニ,みず,,43,80,65,50,35,35,11.5,かいりきバサミ,シェルアーマー,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%98%E3%82%A4%E3%82%AC%E3%83%8B';
pokemon[274] = 'シザリガー,みず,あく,63,120,85,90,55,55,32.8,かいりきバサミ,シェルアーマー,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%B6%E3%83%AA%E3%82%AC%E3%83%BC';
pokemon[275] = 'ヒンバス,みず,,20,15,20,10,55,80,7.4,すいすい,どんかん,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%B3%E3%83%90%E3%82%B9';
pokemon[276] = 'ミロカロス,みず,,95,60,79,100,125,81,162.0,ふしぎなうろこ,かちき,メロメロボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%AD%E3%82%AB%E3%83%AD%E3%82%B9';
pokemon[277] = 'カゲボウズ,ゴースト,,44,75,35,63,33,45,2.3,ふみん,おみとおし,のろわれボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%B2%E3%83%9C%E3%82%A6%E3%82%BA';
pokemon[278] = 'ジュペッタ,ゴースト,,64,115,65,83,63,65,12.5,ふみん,おみとおし,のろわれボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%83%9A%E3%83%83%E3%82%BF';
pokemon[279] = 'ヨマワル,ゴースト,,20,40,90,30,90,25,15.0,ふゆう,おみとおし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A8%E3%83%9E%E3%83%AF%E3%83%AB';
pokemon[280] = 'サマヨール,ゴースト,,40,70,130,60,130,25,30.6,プレッシャー,おみとおし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%9E%E3%83%A8%E3%83%BC%E3%83%AB';
pokemon[281] = 'トロピウス,くさ,ひこう,99,68,83,72,87,51,100.0,ようりょくそ,サンパワー,しゅうかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AD%E3%83%94%E3%82%A6%E3%82%B9';
pokemon[282] = 'チリーン,エスパー,,75,50,80,95,90,65,1.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%AA%E3%83%BC%E3%83%B3';
pokemon[283] = 'ユキワラシ,こおり,,50,50,50,50,50,50,16.8,せいしんりょく,アイスボディ,ムラっけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AD%E3%83%AF%E3%83%A9%E3%82%B7';
pokemon[284] = 'オニゴーリ,こおり,,80,80,80,80,80,80,256.5,せいしんりょく,アイスボディ,ムラっけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%8B%E3%82%B4%E3%83%BC%E3%83%AA';
pokemon[285] = 'ラブカス,みず,,43,30,55,40,65,97,8.7,すいすい,うるおいボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%96%E3%82%AB%E3%82%B9';
pokemon[286] = 'タツベイ,ドラゴン,,45,75,60,40,30,50,42.1,いしあたま,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%84%E3%83%99%E3%82%A4';
pokemon[287] = 'コモルー,ドラゴン,,65,95,100,60,50,50,110.5,いしあたま,ぼうじん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%A2%E3%83%AB%E3%83%BC';
pokemon[288] = 'ボーマンダ,ドラゴン,ひこう,95,135,80,110,80,100,102.6,いかく,じしんかじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%83%BC%E3%83%9E%E3%83%B3%E3%83%80';
pokemon[289] = 'ダンバル,はがね,エスパー,40,55,80,35,60,30,95.2,クリアボディ,ライトメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%83%B3%E3%83%90%E3%83%AB';
pokemon[290] = 'メタング,はがね,エスパー,60,75,100,55,80,50,202.5,クリアボディ,ライトメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%BF%E3%83%B3%E3%82%B0';
pokemon[291] = 'メタグロス,はがね,エスパー,80,135,130,95,90,70,550.0,クリアボディ,ライトメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%BF%E3%82%B0%E3%83%AD%E3%82%B9';
pokemon[292] = 'レジロック,いわ,,80,100,200,50,100,50,230.0,クリアボディ,がんじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%83%AD%E3%83%83%E3%82%AF';
pokemon[293] = 'レジアイス,こおり,,80,50,100,100,200,50,175.0,クリアボディ,アイスボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%82%A2%E3%82%A4%E3%82%B9';
pokemon[294] = 'レジスチル,はがね,,80,75,150,75,150,50,205.0,クリアボディ,ライトメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%82%B9%E3%83%81%E3%83%AB';
pokemon[295] = 'ラティアス,ドラゴン,エスパー,80,80,90,110,130,110,40.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%86%E3%82%A3%E3%82%A2%E3%82%B9';
pokemon[296] = 'ラティオス,ドラゴン,エスパー,80,90,80,130,110,110,60.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%86%E3%82%A3%E3%82%AA%E3%82%B9';
pokemon[297] = 'カイオーガ,みず,,100,100,90,150,140,90,352.0,あめふらし,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A4%E3%82%AA%E3%83%BC%E3%82%AC';
pokemon[298] = 'グラードン,じめん,,100,150,140,100,90,90,950.0,ひでり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%A9%E3%83%BC%E3%83%89%E3%83%B3';
pokemon[299] = 'レックウザ,ドラゴン,ひこう,105,150,90,150,90,95,206.5,エアロック,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%83%83%E3%82%AF%E3%82%A6%E3%82%B6';
pokemon[300] = 'ジラーチ,はがね,エスパー,100,100,100,100,100,100,1.1,てんのめぐみ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A9%E3%83%BC%E3%83%81';
pokemon[301] = 'デオキシス(ノーマルフォルム),エスパー,,50,150,50,150,50,150,60.8,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%AA%E3%82%AD%E3%82%B7%E3%82%B9';
pokemon[302] = 'デオキシス(アタックフォルム),エスパー,,50,180,20,180,20,150,60.8,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%AA%E3%82%AD%E3%82%B7%E3%82%B9';
pokemon[303] = 'デオキシス(ディフェンスフォルム),エスパー,,50,70,160,70,160,90,60.8,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%AA%E3%82%AD%E3%82%B7%E3%82%B9';
pokemon[304] = 'デオキシス(スピードフォルム),エスパー,,50,95,90,95,90,180,60.8,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%AA%E3%82%AD%E3%82%B7%E3%82%B9';
pokemon[305] = 'ナエトル,くさ,,55,68,64,45,55,31,10.2,しんりょく,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%82%A8%E3%83%88%E3%83%AB';
pokemon[306] = 'ハヤシガメ,くさ,,75,89,85,55,65,36,97.0,しんりょく,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%A4%E3%82%B7%E3%82%AC%E3%83%A1';
pokemon[307] = 'ドダイトス,くさ,じめん,95,109,105,75,85,56,310.0,しんりょく,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%80%E3%82%A4%E3%83%88%E3%82%B9';
pokemon[308] = 'ヒコザル,ほのお,,44,58,44,58,44,61,6.2,もうか,てつのこぶし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%82%B3%E3%82%B6%E3%83%AB';
pokemon[309] = 'モウカザル,ほのお,かくとう,64,78,52,78,52,81,22.0,もうか,てつのこぶし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%82%A6%E3%82%AB%E3%82%B6%E3%83%AB';
pokemon[310] = 'ゴウカザル,ほのお,かくとう,76,104,71,104,71,108,55.0,もうか,てつのこぶし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%82%A6%E3%82%AB%E3%82%B6%E3%83%AB';
pokemon[311] = 'ポッチャマ,みず,,53,51,53,61,56,40,5.2,げきりゅう,かちき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%83%E3%83%81%E3%83%A3%E3%83%9E';
pokemon[312] = 'ポッタイシ,みず,,64,66,68,81,76,50,23.0,げきりゅう,かちき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%83%E3%82%BF%E3%82%A4%E3%82%B7';
pokemon[313] = 'エンペルト,みず,はがね,84,86,88,111,101,60,84.5,げきりゅう,かちき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%B3%E3%83%9A%E3%83%AB%E3%83%88';
pokemon[314] = 'ムックル,ノーマル,ひこう,40,55,30,30,30,60,2.0,するどいめ,すてみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%83%83%E3%82%AF%E3%83%AB';
pokemon[315] = 'ムクバード,ノーマル,ひこう,55,75,50,40,40,80,15.5,いかく,すてみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%82%AF%E3%83%90%E3%83%BC%E3%83%89';
pokemon[316] = 'ムクホーク,ノーマル,ひこう,85,120,70,50,60,100,24.9,いかく,すてみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%82%AF%E3%83%9B%E3%83%BC%E3%82%AF';
pokemon[317] = 'コロボーシ,むし,,37,25,41,25,41,25,2.2,だっぴ,にげあし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%AD%E3%83%9C%E3%83%BC%E3%82%B7';
pokemon[318] = 'コロトック,むし,,77,85,51,55,51,65,25.5,むしのしらせ,テクニシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%AD%E3%83%88%E3%83%83%E3%82%AF';
pokemon[319] = 'コリンク,でんき,,45,65,34,40,34,45,9.5,とうそうしん,いかく,こんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%AA%E3%83%B3%E3%82%AF';
pokemon[320] = 'ルクシオ,でんき,,60,85,49,60,49,60,30.5,とうそうしん,いかく,こんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AF%E3%82%B7%E3%82%AA';
pokemon[321] = 'レントラー,でんき,,80,120,79,95,79,70,42.0,とうそうしん,いかく,こんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%83%B3%E3%83%88%E3%83%A9%E3%83%BC';
pokemon[322] = 'ズガイドス,いわ,,67,125,40,30,30,58,31.5,かたやぶり,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BA%E3%82%AC%E3%82%A4%E3%83%89%E3%82%B9';
pokemon[323] = 'ラムパルド,いわ,,97,165,60,65,50,58,102.5,かたやぶり,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%A0%E3%83%91%E3%83%AB%E3%83%89';
pokemon[324] = 'タテトプス,いわ,はがね,30,42,118,42,88,30,57.0,がんじょう,ぼうおん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%86%E3%83%88%E3%83%97%E3%82%B9';
pokemon[325] = 'トリデプス,いわ,はがね,60,52,168,47,138,30,149.5,がんじょう,ぼうおん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AA%E3%83%87%E3%83%97%E3%82%B9';
pokemon[326] = 'ミツハニー,むし,ひこう,30,30,42,30,42,70,5.5,みつあつめ,はりきり,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%84%E3%83%8F%E3%83%8B%E3%83%BC';
pokemon[327] = 'ビークイン,むし,ひこう,70,80,102,80,102,40,38.5,プレッシャー,きんちょうかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%BC%E3%82%AF%E3%82%A4%E3%83%B3';
pokemon[328] = 'パチリス,でんき,,60,45,70,45,90,95,3.9,にげあし,ものひろい,ちくでん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%81%E3%83%AA%E3%82%B9';
pokemon[329] = 'ブイゼル,みず,,55,65,35,60,30,85,29.5,すいすい,みずのベール,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%82%A4%E3%82%BC%E3%83%AB';
pokemon[330] = 'フローゼル,みず,,85,105,55,85,50,115,33.5,すいすい,みずのベール,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AD%E3%83%BC%E3%82%BC%E3%83%AB';
pokemon[331] = 'カラナクシ(にしのうみ),みず,,76,48,48,57,62,34,6.3,ねんちゃく,よびみず,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A9%E3%83%8A%E3%82%AF%E3%82%B7';
pokemon[332] = 'カラナクシ(ひがしのうみ),みず,,76,48,48,57,62,34,6.3,ねんちゃく,よびみず,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A9%E3%83%8A%E3%82%AF%E3%82%B7';
pokemon[333] = 'トリトドン(にしのうみ),みず,じめん,111,83,68,92,82,39,29.9,ねんちゃく,よびみず,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AA%E3%83%88%E3%83%89%E3%83%B3';
pokemon[334] = 'トリトドン(ひがしのうみ),みず,じめん,111,83,68,92,82,39,29.9,ねんちゃく,よびみず,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AA%E3%83%88%E3%83%89%E3%83%B3';
pokemon[335] = 'エテボース,ノーマル,,75,100,66,60,66,115,20.3,テクニシャン,ものひろい,スキルリンク,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%86%E3%83%9C%E3%83%BC%E3%82%B9';
pokemon[336] = 'フワンテ,ゴースト,ひこう,90,50,34,60,44,70,1.2,ゆうばく,かるわざ,ねつぼうそう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AF%E3%83%B3%E3%83%86';
pokemon[337] = 'フワライド,ゴースト,ひこう,150,80,44,90,54,80,15.0,ゆうばく,かるわざ,ねつぼうそう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AF%E3%83%A9%E3%82%A4%E3%83%89';
pokemon[338] = 'ムウマージ,ゴースト,,60,60,60,105,105,105,4.4,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%82%A6%E3%83%9E';
pokemon[339] = 'ドンカラス,あく,ひこう,100,125,52,105,52,71,27.3,ふみん,きょううん,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%B3%E3%82%AB%E3%83%A9%E3%82%B9';
pokemon[340] = 'リーシャン,エスパー,,45,30,50,65,50,45,0.6,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%83%BC%E3%82%B7%E3%83%A3%E3%83%B3';
pokemon[341] = 'スカンプー,どく,あく,63,63,47,41,41,74,19.2,あくしゅう,ゆうばく,するどいめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%82%AB%E3%83%B3%E3%83%97%E3%83%BC';
pokemon[342] = 'スカタンク,どく,あく,103,93,67,71,61,84,38.0,あくしゅう,ゆうばく,するどいめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%82%AB%E3%82%BF%E3%83%B3%E3%82%AF';
pokemon[343] = 'ドーミラー,はがね,エスパー,57,24,86,24,86,23,60.5,ふゆう,たいねつ,ヘヴィメタル,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%BC%E3%83%9F%E3%83%A9%E3%83%BC';
pokemon[344] = 'ドータクン,はがね,エスパー,67,89,116,79,116,33,187.0,ふゆう,たいねつ,ヘヴィメタル,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%BC%E3%82%BF%E3%82%AF%E3%83%B3';
pokemon[345] = 'ウソハチ,いわ,,50,80,95,10,45,10,15.0,がんじょう,いしあたま,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%BD%E3%83%8F%E3%83%81';
pokemon[346] = 'ピンプク,ノーマル,,100,5,5,15,65,30,24.4,しぜんかいふく,てんのめぐみ,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%94%E3%83%B3%E3%83%97%E3%82%AF';
pokemon[347] = 'ミカルゲ,ゴースト,あく,50,92,108,92,108,35,108.0,プレッシャー,すりぬけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%82%AB%E3%83%AB%E3%82%B2';
pokemon[348] = 'フカマル,ドラゴン,じめん,58,70,45,40,45,42,20.5,すながくれ,さめはだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%AB%E3%83%9E%E3%83%AB';
pokemon[349] = 'ガバイト,ドラゴン,じめん,68,90,65,50,55,82,56.0,すながくれ,さめはだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%90%E3%82%A4%E3%83%88';
pokemon[350] = 'ガブリアス,ドラゴン,じめん,108,130,95,80,85,102,95.0,すながくれ,さめはだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%96%E3%83%AA%E3%82%A2%E3%82%B9';
pokemon[351] = 'ゴンベ,ノーマル,,135,85,40,40,85,5,105.0,ものひろい,あついしぼう,くいしんぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%B3%E3%83%99';
pokemon[352] = 'リオル,かくとう,,40,70,40,35,40,60,20.2,ふくつのこころ,せいしんりょく,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%82%AA%E3%83%AB';
pokemon[353] = 'ルカリオ,かくとう,はがね,70,110,70,115,70,90,54.0,ふくつのこころ,せいしんりょく,せいぎのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AB%E3%83%AA%E3%82%AA';
pokemon[354] = 'ヒポポタス,じめん,,68,72,78,38,42,32,49.5,すなおこし,すなのちから,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%9D%E3%83%9D%E3%82%BF%E3%82%B9';
pokemon[355] = 'カバルドン(オス),じめん,,108,112,118,68,72,47,300.0,すなおこし,すなのちから,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%90%E3%83%AB%E3%83%89%E3%83%B3';
pokemon[356] = 'カバルドン(メス),じめん,,108,112,118,68,72,47,300.0,すなおこし,すなのちから,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%90%E3%83%AB%E3%83%89%E3%83%B3';
pokemon[357] = 'グレッグル,どく,かくとう,48,61,40,61,40,50,23.0,きけんよち,かんそうはだ,どくしゅ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%AC%E3%83%83%E3%82%B0%E3%83%AB';
pokemon[358] = 'ドクロッグ,どく,かくとう,83,106,65,86,65,85,44.4,きけんよち,かんそうはだ,どくしゅ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%82%AF%E3%83%AD%E3%83%83%E3%82%B0';
pokemon[359] = 'ケイコウオ,みず,,49,49,56,49,61,66,7.0,すいすい,よびみず,みずのベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%82%A4%E3%82%B3%E3%82%A6%E3%82%AA';
pokemon[360] = 'ネオラント,みず,,69,69,76,69,86,91,24.0,すいすい,よびみず,みずのベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8D%E3%82%AA%E3%83%A9%E3%83%B3%E3%83%88';
pokemon[361] = 'ユキカブリ,くさ,こおり,60,62,50,62,60,40,50.5,ゆきふらし,ぼうおん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AD%E3%82%AB%E3%83%96%E3%83%AA';
pokemon[362] = 'ユキノオー,くさ,こおり,90,92,75,92,85,60,135.5,ゆきふらし,ぼうおん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AD%E3%83%8E%E3%82%AA%E3%83%BC';
pokemon[363] = 'マニューラ,あく,こおり,70,120,65,45,85,125,34.0,プレッシャー,わるいてぐせ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%A9';
pokemon[364] = 'ジバコイル,でんき,はがね,70,70,115,130,90,60,180.0,じりょく,がんじょう,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%A4%E3%83%AB';
pokemon[365] = 'ドサイドン,じめん,いわ,115,140,130,55,55,40,282.8,ひらいしん,ハードロック,すてみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%A4%E3%83%89%E3%83%B3';
pokemon[366] = 'エレキブル,でんき,,75,123,67,95,85,95,138.6,でんきエンジン,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AC%E3%82%AD%E3%83%96%E3%83%AB';
pokemon[367] = 'ブーバーン,ほのお,,75,95,67,125,95,83,68.0,ほのおのからだ,やるき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%BC%E3%83%90%E3%83%BC';
pokemon[368] = 'メガヤンマ,むし,ひこう,86,76,86,116,56,95,51.5,かそく,いろめがね,おみとおし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%AC%E3%83%A4%E3%83%B3%E3%83%9E';
pokemon[369] = 'リーフィア,くさ,,65,110,130,60,65,95,25.5,リーフガード,ようりょくそ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%83%BC%E3%83%95%E3%82%A3%E3%82%A2';
pokemon[370] = 'グレイシア,こおり,,65,60,110,130,95,65,25.9,ゆきがくれ,アイスボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%AC%E3%82%A4%E3%82%B7%E3%82%A2';
pokemon[371] = 'グライオン,じめん,ひこう,75,95,125,45,75,95,42.5,かいりきバサミ,すながくれ,ポイズンヒール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%A9%E3%82%A4%E3%82%AA%E3%83%B3';
pokemon[372] = 'マンムー,こおり,じめん,110,130,80,70,60,80,291.0,どんかん,ゆきがくれ,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%B3%E3%83%A0%E3%83%BC';
pokemon[373] = 'ポリゴンＺ,ノーマル,,85,80,70,135,75,90,34.0,てきおうりょく,ダウンロード,アナライズ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%AA%E3%82%B4%E3%83%B3';
pokemon[374] = 'エルレイド,エスパー,かくとう,68,125,65,65,115,80,52.0,ふくつのこころ,きれあじ,せいぎのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AB%E3%83%AC%E3%82%A4%E3%83%89';
pokemon[375] = 'ダイノーズ,いわ,はがね,60,55,145,75,150,40,340.0,がんじょう,じりょく,すなのちから,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%A4%E3%83%8E%E3%83%BC%E3%82%BA';
pokemon[376] = 'ヨノワール,ゴースト,,45,100,135,65,135,45,106.6,プレッシャー,おみとおし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A8%E3%83%8E%E3%83%AF%E3%83%BC%E3%83%AB';
pokemon[377] = 'ユキメノコ,こおり,ゴースト,70,80,70,80,70,110,26.6,ゆきがくれ,のろわれボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AD%E3%83%A1%E3%83%8E%E3%82%B3';
pokemon[378] = 'ロトム,でんき,ゴースト,50,50,77,95,77,91,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[379] = 'ヒートロトム,でんき,ほのお,50,65,107,105,107,86,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[380] = 'ウォッシュロトム,でんき,みず,50,65,107,105,107,86,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[381] = 'フロストロトム,でんき,こおり,50,65,107,105,107,86,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[382] = 'スピンロトム,でんき,ひこう,50,65,107,105,107,86,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[383] = 'カットロトム,でんき,くさ,50,65,107,105,107,86,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%88%E3%83%A0';
pokemon[384] = 'ユクシー,エスパー,,75,75,130,75,130,95,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AF%E3%82%B7%E3%83%BC';
pokemon[385] = 'エムリット,エスパー,,80,105,105,105,105,80,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%A0%E3%83%AA%E3%83%83%E3%83%88';
pokemon[386] = 'アグノム,エスパー,,75,125,70,125,70,115,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%B0%E3%83%8E%E3%83%A0';
pokemon[387] = 'ディアルガ,はがね,ドラゴン,100,120,120,150,100,90,683.0,プレッシャー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%A2%E3%83%AB%E3%82%AC';
pokemon[388] = 'ディアルガ(オリジンフォルム),はがね,ドラゴン,100,100,120,150,120,90,850.0,プレッシャー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%A2%E3%83%AB%E3%82%AC';
pokemon[389] = 'パルキア,みず,ドラゴン,90,120,100,150,120,100,336.0,プレッシャー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%AB%E3%82%AD%E3%82%A2';
pokemon[390] = 'パルキア(オリジンフォルム),みず,ドラゴン,90,100,100,150,120,120,660.0,プレッシャー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%AB%E3%82%AD%E3%82%A2';
pokemon[391] = 'ヒードラン,ほのお,はがね,91,90,106,130,106,77,430.0,もらいび,ほのおのからだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%BC%E3%83%89%E3%83%A9%E3%83%B3';
pokemon[392] = 'レジギガス,ノーマル,,110,160,110,80,110,100,420.0,スロースタート,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%82%AE%E3%82%AC%E3%82%B9';
pokemon[393] = 'ギラティナ(アナザーフォルム),ゴースト,ドラゴン,150,100,120,100,120,90,750.0,プレッシャー,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AE%E3%83%A9%E3%83%86%E3%82%A3%E3%83%8A';
pokemon[394] = 'ギラティナ(オリジンフォルム),ゴースト,ドラゴン,150,120,100,120,100,90,650.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AE%E3%83%A9%E3%83%86%E3%82%A3%E3%83%8A';
pokemon[395] = 'クレセリア,エスパー,,120,70,110,75,120,85,85.6,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AC%E3%82%BB%E3%83%AA%E3%82%A2';
pokemon[396] = 'フィオネ,みず,,80,80,80,80,80,80,3.1,うるおいボディ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A3%E3%82%AA%E3%83%8D';
pokemon[397] = 'マナフィ,みず,,100,100,100,100,100,100,1.4,うるおいボディ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%8A%E3%83%95%E3%82%A3';
pokemon[398] = 'ダークライ,あく,,70,90,90,135,90,125,50.5,ナイトメア,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%83%BC%E3%82%AF%E3%83%A9%E3%82%A4';
pokemon[399] = 'シェイミ(ランドフォルム),くさ,,100,100,100,100,100,100,2.1,しぜんかいふく,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%A7%E3%82%A4%E3%83%9F';
pokemon[400] = 'シェイミ(スカイフォルム),くさ,ひこう,100,103,75,120,75,127,5.2,てんのめぐみ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%A7%E3%82%A4%E3%83%9F';
pokemon[401] = 'アルセウス,ノーマル,,120,120,120,120,120,120,320.0,マルチタイプ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%AB%E3%82%BB%E3%82%A6%E3%82%B9';
pokemon[402] = 'ツタージャ,くさ,,45,45,55,45,55,63,8.1,しんりょく,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%84%E3%82%BF%E3%83%BC%E3%82%B8%E3%83%A3';
pokemon[403] = 'ジャノビー,くさ,,60,60,75,60,75,83,16.0,しんりょく,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A3%E3%83%8E%E3%83%93%E3%83%BC';
pokemon[404] = 'ジャローダ,くさ,,75,75,95,75,95,113,63.0,しんりょく,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A3%E3%83%AD%E3%83%BC%E3%83%80';
pokemon[405] = 'ポカブ,ほのお,,65,63,45,45,45,45,9.9,もうか,あついしぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%82%AB%E3%83%96';
pokemon[406] = 'チャオブー,ほのお,かくとう,90,93,55,70,55,55,55.5,もうか,あついしぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A3%E3%82%AA%E3%83%96%E3%83%BC';
pokemon[407] = 'エンブオー,ほのお,かくとう,110,123,65,100,65,65,150.0,もうか,すてみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%B3%E3%83%96%E3%82%AA%E3%83%BC';
pokemon[408] = 'ミジュマル,みず,,55,55,45,63,45,45,5.9,げきりゅう,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%82%B8%E3%83%A5%E3%83%9E%E3%83%AB';
pokemon[409] = 'フタチマル,みず,,75,75,60,83,60,60,24.5,げきりゅう,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%BF%E3%83%81%E3%83%9E%E3%83%AB';
pokemon[410] = 'ダイケンキ,みず,,95,100,85,108,70,70,94.6,げきりゅう,シェルアーマー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%A4%E3%82%B1%E3%83%B3%E3%82%AD';
pokemon[411] = 'ヒスイダイケンキ,みず,あく,90,108,80,100,65,85,58.2,げきりゅう,きれあじ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%A4%E3%82%B1%E3%83%B3%E3%82%AD';
pokemon[412] = 'シママ,でんき,,45,60,32,50,32,76,29.8,ひらいしん,でんきエンジン,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%9E%E3%83%9E';
pokemon[413] = 'ゼブライカ,でんき,,75,100,63,80,63,116,79.5,ひらいしん,でんきエンジン,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BC%E3%83%96%E3%83%A9%E3%82%A4%E3%82%AB';
pokemon[414] = 'モグリュー,じめん,,60,85,40,30,45,68,8.5,すなかき,すなのちから,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%82%B0%E3%83%AA%E3%83%A5%E3%83%BC';
pokemon[415] = 'ドリュウズ,じめん,はがね,110,135,60,50,65,88,40.4,すなかき,すなのちから,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%AA%E3%83%A5%E3%82%A6%E3%82%BA';
pokemon[416] = 'ドッコラー,かくとう,,75,80,55,25,35,35,12.5,こんじょう,ちからずく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%83%E3%82%B3%E3%83%A9%E3%83%BC';
pokemon[417] = 'ドテッコツ,かくとう,,85,105,85,40,50,40,40.0,こんじょう,ちからずく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%86%E3%83%83%E3%82%B3%E3%83%84';
pokemon[418] = 'ローブシン,かくとう,,105,140,95,55,65,45,87.0,こんじょう,ちからずく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AD%E3%83%BC%E3%83%96%E3%82%B7%E3%83%B3';
pokemon[419] = 'クルミル,むし,くさ,45,53,70,40,60,42,2.5,むしのしらせ,ようりょくそ,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AB%E3%83%9F%E3%83%AB';
pokemon[420] = 'クルマユ,むし,くさ,55,63,90,50,80,42,7.3,リーフガード,ようりょくそ,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AB%E3%83%9E%E3%83%A6';
pokemon[421] = 'ハハコモリ,むし,くさ,75,103,80,70,80,92,20.5,むしのしらせ,ようりょくそ,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%8F%E3%82%B3%E3%83%A2%E3%83%AA';
pokemon[422] = 'モンメン,くさ,フェアリー,40,27,60,37,50,66,0.6,いたずらごころ,すりぬけ,ようりょくそ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%B3%E3%83%A1%E3%83%B3';
pokemon[423] = 'エルフーン,くさ,フェアリー,60,67,85,77,75,116,6.6,いたずらごころ,すりぬけ,ようりょくそ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AB%E3%83%95%E3%83%BC%E3%83%B3';
pokemon[424] = 'チュリネ,くさ,,45,35,50,70,50,30,6.6,ようりょくそ,マイペース,リーフガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A5%E3%83%AA%E3%83%8D';
pokemon[425] = 'ドレディア,くさ,,70,60,75,110,75,90,16.3,ようりょくそ,マイペース,リーフガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%AC%E3%83%87%E3%82%A3%E3%82%A2';
pokemon[426] = 'ヒスイドレディア,くさ,かくとう,70,105,75,50,75,105,19.2,ようりょくそ,はりきり,リーフガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%AC%E3%83%87%E3%82%A3%E3%82%A2';
pokemon[427] = 'バスラオ(あかすじのすがた),みず,,70,92,65,80,55,98,18.0,すてみ,てきおうりょく,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%B9%E3%83%A9%E3%82%AA';
pokemon[428] = 'バスラオ(あおすじのすがた),みず,,70,92,65,80,55,98,18.0,すてみ,てきおうりょく,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%B9%E3%83%A9%E3%82%AA';
pokemon[429] = 'バスラオ(しろすじ),みず,,70,92,65,80,55,98,18.0,びびり,てきおうりょく,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%B9%E3%83%A9%E3%82%AA';
pokemon[430] = 'メグロコ,じめん,あく,50,72,35,35,35,65,15.2,いかく,じしんかじょう,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%B0%E3%83%AD%E3%82%B3';
pokemon[431] = 'ワルビル,じめん,あく,60,82,45,45,45,74,33.4,いかく,じしんかじょう,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%83%AB%E3%83%93%E3%83%AB';
pokemon[432] = 'ワルビアル,じめん,あく,95,117,80,65,70,92,96.3,いかく,じしんかじょう,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%83%AB%E3%83%93%E3%82%A2%E3%83%AB';
pokemon[433] = 'ズルッグ,あく,かくとう,50,75,70,35,70,48,11.8,だっぴ,じしんかじょう,いかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BA%E3%83%AB%E3%83%83%E3%82%B0';
pokemon[434] = 'ズルズキン,あく,かくとう,65,90,115,45,115,58,30.0,だっぴ,じしんかじょう,いかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BA%E3%83%AB%E3%82%BA%E3%82%AD%E3%83%B3';
pokemon[435] = 'ゾロア,あく,,40,65,40,80,40,65,12.5,イリュージョン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BE%E3%83%AD%E3%82%A2';
pokemon[436] = 'ヒスイゾロア,ノーマル,ゴースト,35,60,40,85,40,70,12.5,イリュージョン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BE%E3%83%AD%E3%82%A2';
pokemon[437] = 'ゾロアーク,あく,,60,105,60,120,60,105,81.1,イリュージョン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BE%E3%83%AD%E3%82%A2';
pokemon[438] = 'ヒスイゾロアーク,ノーマル,ゴースト,55,100,60,125,60,110,73.0,イリュージョン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BE%E3%83%AD%E3%82%A2';
pokemon[439] = 'チラーミィ,ノーマル,,55,50,40,40,40,75,5.8,メロメロボディ,テクニシャン,スキルリンク,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A9%E3%83%BC%E3%83%9F%E3%82%A3';
pokemon[440] = 'チラチーノ,ノーマル,,75,95,60,65,60,115,7.5,メロメロボディ,テクニシャン,スキルリンク,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A9%E3%83%81%E3%83%BC%E3%83%8E';
pokemon[441] = 'ゴチム,エスパー,,45,30,50,55,65,45,5.8,おみとおし,かちき,かげふみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%81%E3%83%A0';
pokemon[442] = 'ゴチミル,エスパー,,60,45,70,75,85,55,18.0,おみとおし,かちき,かげふみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%81%E3%83%9F%E3%83%AB';
pokemon[443] = 'ゴチルゼル,エスパー,,70,55,95,95,110,65,44.0,おみとおし,かちき,かげふみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%81%E3%83%AB%E3%82%BC%E3%83%AB';
pokemon[444] = 'ユニラン,エスパー,,45,30,40,105,50,20,1.0,ぼうじん,マジックガード,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%83%8B%E3%83%A9%E3%83%B3';
pokemon[445] = 'ダブラン,エスパー,,65,40,50,125,60,30,8.0,ぼうじん,マジックガード,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%83%96%E3%83%A9%E3%83%B3';
pokemon[446] = 'ランクルス,エスパー,,110,65,75,125,85,30,20.1,ぼうじん,マジックガード,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%82%AF%E3%83%AB%E3%82%B9';
pokemon[447] = 'コアルヒー,みず,ひこう,62,44,50,44,50,55,5.5,するどいめ,はとむね,うるおいボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%A2%E3%83%AB%E3%83%92%E3%83%BC';
pokemon[448] = 'スワンナ,みず,ひこう,75,87,63,87,63,98,24.2,するどいめ,はとむね,うるおいボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%AF%E3%83%B3%E3%83%8A';
pokemon[449] = 'シキジカ(はるのすがた),ノーマル,くさ,60,60,50,40,50,75,19.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[450] = 'シキジカ(なつのすがた),ノーマル,くさ,60,60,50,40,50,75,19.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[451] = 'シキジカ(あきのすがた),ノーマル,くさ,60,60,50,40,50,75,19.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[452] = 'シキジカ(ふゆのすがた),ノーマル,くさ,60,60,50,40,50,75,19.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[453] = 'メブキジカ(はるのすがた),ノーマル,くさ,80,100,70,60,70,95,92.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%96%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[454] = 'メブキジカ(なつのすがた),ノーマル,くさ,80,100,70,60,70,95,92.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%96%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[455] = 'メブキジカ(あきのすがた),ノーマル,くさ,80,100,70,60,70,95,92.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%96%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[456] = 'メブキジカ(ふゆのすがた),ノーマル,くさ,80,100,70,60,70,95,92.5,ようりょくそ,そうしょく,てんのめぐみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%96%E3%82%AD%E3%82%B8%E3%82%AB';
pokemon[457] = 'タマゲタケ,くさ,どく,69,55,45,55,55,15,1.0,ほうし,さいせいりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%9E%E3%82%B2%E3%82%BF%E3%82%B1';
pokemon[458] = 'モロバレル,くさ,どく,114,85,70,85,80,30,10.5,ほうし,さいせいりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%AD%E3%83%90%E3%83%AC%E3%83%AB';
pokemon[459] = 'ママンボウ,みず,,165,75,80,40,45,65,31.6,いやしのこころ,うるおいボディ,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%9E%E3%83%B3%E3%83%9C%E3%82%A6';
pokemon[460] = 'バチュル,むし,でんき,50,47,50,57,50,65,0.6,ふくがん,きんちょうかん,むしのしらせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%81%E3%83%A5%E3%83%AB';
pokemon[461] = 'デンチュラ,むし,でんき,70,77,60,97,60,108,14.3,ふくがん,きんちょうかん,むしのしらせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%B3%E3%83%81%E3%83%A5%E3%83%A9';
pokemon[462] = 'シビシラス,でんき,,35,55,40,45,40,60,0.3,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%93%E3%82%B7%E3%83%A9%E3%82%B9';
pokemon[463] = 'シビビール,でんき,,65,85,70,75,70,40,22.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%93%E3%83%93%E3%83%BC%E3%83%AB';
pokemon[464] = 'シビルドン,でんき,,85,115,80,105,80,50,80.5,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%93%E3%83%AB%E3%83%89%E3%83%B3';
pokemon[465] = 'ヒトモシ,ゴースト,ほのお,50,30,55,65,55,20,3.1,もらいび,ほのおのからだ,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%88%E3%83%A2%E3%82%B7';
pokemon[466] = 'ランプラー,ゴースト,ほのお,60,40,60,95,60,55,13.0,もらいび,ほのおのからだ,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%83%97%E3%83%A9%E3%83%BC';
pokemon[467] = 'シャンデラ,ゴースト,ほのお,60,55,90,145,90,80,34.3,もらいび,ほのおのからだ,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%A3%E3%83%B3%E3%83%87%E3%83%A9';
pokemon[468] = 'キバゴ,ドラゴン,,46,87,60,30,40,57,18.0,とうそうしん,かたやぶり,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%90%E3%82%B4';
pokemon[469] = 'オノンド,ドラゴン,,66,117,70,40,50,67,36.0,とうそうしん,かたやぶり,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%8E%E3%83%B3%E3%83%89';
pokemon[470] = 'オノノクス,ドラゴン,,76,147,90,60,70,97,105.5,とうそうしん,かたやぶり,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%8E%E3%83%8E%E3%82%AF%E3%82%B9';
pokemon[471] = 'クマシュン,こおり,,55,70,40,60,40,40,8.5,ゆきがくれ,ゆきかき,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%9E%E3%82%B7%E3%83%A5%E3%83%B3';
pokemon[472] = 'ツンベアー,こおり,,95,130,80,70,80,50,260.0,ゆきがくれ,ゆきかき,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%84%E3%83%B3%E3%83%99%E3%82%A2%E3%83%BC';
pokemon[473] = 'フリージオ,こおり,,80,50,50,95,135,105,148.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%82%B8%E3%82%AA';
pokemon[474] = 'コジョフー,かくとう,,45,85,50,55,50,65,20.0,せいしんりょく,さいせいりょく,すてみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B8%E3%83%A7%E3%83%95%E3%83%BC';
pokemon[475] = 'コジョンド,かくとう,,65,125,60,95,60,105,35.5,せいしんりょく,さいせいりょく,すてみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B8%E3%83%A7%E3%83%B3%E3%83%89';
pokemon[476] = 'ゴビット,じめん,ゴースト,59,74,50,35,50,35,92.0,てつのこぶし,ぶきよう,ノーガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%93%E3%83%83%E3%83%88';
pokemon[477] = 'ゴルーグ,じめん,ゴースト,89,124,80,55,80,55,330.0,てつのこぶし,ぶきよう,ノーガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AB%E3%83%BC%E3%82%B0';
pokemon[478] = 'コマタナ,あく,はがね,45,85,70,40,40,60,10.2,まけんき,せいしんりょく,プレッシャー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%9E%E3%82%BF%E3%83%8A';
pokemon[479] = 'キリキザン,あく,はがね,65,125,100,60,70,70,70.0,まけんき,せいしんりょく,プレッシャー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%AA%E3%82%AD%E3%82%B6%E3%83%B3';
pokemon[480] = 'ワシボン,ノーマル,ひこう,70,83,50,37,50,60,10.5,するどいめ,ちからずく,はりきり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%82%B7%E3%83%9C%E3%83%B3';
pokemon[481] = 'ウォーグル,ノーマル,ひこう,100,123,75,57,75,80,41.0,するどいめ,ちからずく,まけんき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A9%E3%83%BC%E3%82%B0%E3%83%AB';
pokemon[482] = 'ヒスイウォーグル,エスパー,ひこう,110,83,70,112,70,65,43.4,するどいめ,ちからずく,いろめがね,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A9%E3%83%BC%E3%82%B0%E3%83%AB';
pokemon[483] = 'バルチャイ,あく,ひこう,70,55,75,45,65,60,9.0,はとむね,ぼうじん,くだけるよろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%AB%E3%83%81%E3%83%A3%E3%82%A4';
pokemon[484] = 'バルジーナ,あく,ひこう,110,65,105,55,95,80,39.5,はとむね,ぼうじん,くだけるよろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%AB%E3%82%B8%E3%83%BC%E3%83%8A';
pokemon[485] = 'モノズ,あく,ドラゴン,52,65,50,45,50,38,17.3,はりきり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%8E%E3%82%BA';
pokemon[486] = 'ジヘッド,あく,ドラゴン,72,85,70,65,70,58,50.0,はりきり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%98%E3%83%83%E3%83%89';
pokemon[487] = 'サザンドラ,あく,ドラゴン,92,105,90,125,90,98,160.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%B6%E3%83%B3%E3%83%89%E3%83%A9';
pokemon[488] = 'メラルバ,むし,ほのお,55,85,55,50,55,60,28.8,ほのおのからだ,むしのしらせ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%A9%E3%83%AB%E3%83%90';
pokemon[489] = 'ウルガモス,むし,ほのお,85,60,65,135,105,100,46.0,ほのおのからだ,むしのしらせ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%AB%E3%82%AC%E3%83%A2%E3%82%B9';
pokemon[490] = 'コバルオン,はがね,かくとう,91,90,129,90,72,108,250.0,せいぎのこころ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%90%E3%83%AB%E3%82%AA%E3%83%B3';
pokemon[491] = 'テラキオン,いわ,かくとう,91,129,90,72,90,108,260.0,せいぎのこころ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%A9%E3%82%AD%E3%82%AA%E3%83%B3';
pokemon[492] = 'ビリジオン,くさ,かくとう,91,90,72,90,129,108,200.0,せいぎのこころ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%AA%E3%82%B8%E3%82%AA%E3%83%B3';
pokemon[493] = 'トルネロス(けしんフォルム),ひこう,,79,115,70,125,80,111,63.0,いたずらごころ,まけんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AB%E3%83%8D%E3%83%AD%E3%82%B9';
pokemon[494] = 'トルネロス(れいじゅうフォルム),ひこう,,79,100,80,110,90,121,63.0,さいせいりょく,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AB%E3%83%8D%E3%83%AD%E3%82%B9';
pokemon[495] = 'ボルトロス(けしんフォルム),でんき,ひこう,79,115,70,125,80,111,61.0,いたずらごころ,まけんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%83%AB%E3%83%88%E3%83%AD%E3%82%B9';
pokemon[496] = 'ボルトロス(れいじゅうフォルム),でんき,ひこう,79,105,70,145,80,101,61.0,ちくでん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%83%AB%E3%83%88%E3%83%AD%E3%82%B9';
pokemon[497] = 'レシラム,ドラゴン,ほのお,100,120,100,150,120,90,330.0,ターボブレイズ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B7%E3%83%A9%E3%83%A0';
pokemon[498] = 'ゼクロム,ドラゴン,でんき,100,150,120,120,100,90,345.0,テラボルテージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BC%E3%82%AF%E3%83%AD%E3%83%A0';
pokemon[499] = 'ランドロス(けしんフォルム),じめん,ひこう,89,125,90,115,80,101,68.0,すなのちから,ちからずく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%83%89%E3%83%AD%E3%82%B9';
pokemon[500] = 'ランドロス(れいじゅうフォルム),じめん,ひこう,89,145,90,105,80,91,68.0,いかく,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%83%89%E3%83%AD%E3%82%B9';
pokemon[501] = 'キュレム,ドラゴン,こおり,125,130,90,130,90,95,325.0,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%83%AC%E3%83%A0';
pokemon[502] = 'ホワイトキュレム,ドラゴン,こおり,125,120,90,170,100,95,325.0,ターボブレイズ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%83%AC%E3%83%A0';
pokemon[503] = 'ブラックキュレム,ドラゴン,こおり,125,170,100,120,90,95,325.0,テラボルテージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%83%AC%E3%83%A0';
pokemon[504] = 'ケルディオ,みず,かくとう,91,72,90,129,90,108,48.5,せいぎのこころ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%AB%E3%83%87%E3%82%A3%E3%82%AA';
pokemon[505] = 'ケルディオ(かくごのすがた),みず,かくとう,91,72,90,129,90,108,48.5,せいぎのこころ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%AB%E3%83%87%E3%82%A3%E3%82%AA';
pokemon[506] = 'メロエッタ(ボイスフォルム),ノーマル,エスパー,100,77,77,128,128,90,6.5,てんのめぐみ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%AD%E3%82%A8%E3%83%83%E3%82%BF';
pokemon[507] = 'メロエッタ(ステップフォルム),ノーマル,エスパー,100,77,77,128,128,90,6.5,てんのめぐみ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%AD%E3%82%A8%E3%83%83%E3%82%BF';
pokemon[508] = 'ハリマロン,くさ,,56,61,65,48,45,38,9.0,しんりょく,ぼうだん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%9E%E3%83%AD%E3%83%B3';
pokemon[509] = 'ハリボーグ,くさ,,61,78,95,56,58,57,29.0,しんりょく,ぼうだん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%9C%E3%83%BC%E3%82%B0';
pokemon[510] = 'ブリガロン,くさ,かくとう,88,107,122,74,75,64,90.0,しんりょく,ぼうだん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AA%E3%82%AC%E3%83%AD%E3%83%B3';
pokemon[511] = 'フォッコ,ほのお,,40,45,40,62,60,60,9.4,もうか,マジシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A9%E3%83%83%E3%82%B3';
pokemon[512] = 'テールナー,ほのお,,59,59,58,90,70,73,14.5,もうか,マジシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%BC%E3%83%AB%E3%83%8A%E3%83%BC';
pokemon[513] = 'マフォクシー,ほのお,エスパー,75,69,72,114,100,104,39.0,もうか,マジシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%95%E3%82%A9%E3%82%AF%E3%82%B7%E3%83%BC';
pokemon[514] = 'ケロマツ,みず,,41,56,40,62,44,71,7.0,げきりゅう,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%AD%E3%83%9E%E3%83%84';
pokemon[515] = 'ゲコガシラ,みず,,54,63,52,83,56,97,10.9,げきりゅう,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B2%E3%82%B3%E3%82%AC%E3%82%B7%E3%83%A9';
pokemon[516] = 'ゲッコウガ,みず,あく,72,95,67,103,71,122,40.0,げきりゅう,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B2%E3%83%83%E3%82%B3%E3%82%A6%E3%82%AC';
pokemon[517] = 'ヤヤコマ,ノーマル,ひこう,45,50,43,40,38,62,1.7,はとむね,はやてのつばさ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%A4%E3%82%B3%E3%83%9E';
pokemon[518] = 'ヒノヤコマ,ほのお,ひこう,62,73,55,56,52,84,16.0,ほのおのからだ,はやてのつばさ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%8E%E3%83%A4%E3%82%B3%E3%83%9E';
pokemon[519] = 'ファイアロー,ほのお,ひこう,78,81,71,74,69,126,24.5,ほのおのからだ,はやてのつばさ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%A1%E3%82%A4%E3%82%A2%E3%83%AD%E3%83%BC';
pokemon[520] = 'コフキムシ,むし,,38,35,40,27,25,35,2.5,りんぷん,ふくがん,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%95%E3%82%AD%E3%83%A0%E3%82%B7';
pokemon[521] = 'コフーライ,むし,,45,22,60,27,30,29,8.4,だっぴ,フレンドガード,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%95%E3%83%BC%E3%83%A9%E3%82%A4';
pokemon[522] = 'ビビヨン,むし,ひこう,80,52,50,90,50,89,17.0,りんぷん,ふくがん,フレンドガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%93%E3%83%93%E3%83%A8%E3%83%B3';
pokemon[523] = 'シシコ,ほのお,ノーマル,62,50,58,73,54,72,13.5,とうそうしん,きんちょうかん,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%B7%E3%82%B3';
pokemon[524] = 'カエンジシ(オスのすがた),ほのお,ノーマル,86,68,72,109,66,106,81.5,とうそうしん,きんちょうかん,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A8%E3%83%B3%E3%82%B8%E3%82%B7';
pokemon[525] = 'カエンジシ(メスのすがた),ほのお,ノーマル,86,68,72,109,66,106,81.5,とうそうしん,きんちょうかん,じしんかじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A8%E3%83%B3%E3%82%B8%E3%82%B7';
pokemon[526] = 'フラベベ,フェアリー,,44,38,39,61,79,42,0.1,フラワーベール,きょうせい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%A9%E3%83%99%E3%83%99';
pokemon[527] = 'フラエッテ,フェアリー,,54,45,47,75,98,52,0.9,フラワーベール,きょうせい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%A9%E3%82%A8%E3%83%83%E3%83%86';
pokemon[528] = 'フラージェス,フェアリー,,78,65,68,112,154,75,10.0,フラワーベール,きょうせい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%A9%E3%83%BC%E3%82%B8%E3%82%A7%E3%82%B9';
pokemon[529] = 'メェークル,くさ,,66,65,48,62,57,52,31.0,そうしょく,くさのけがわ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%82%A7%E3%83%BC%E3%82%AF%E3%83%AB';
pokemon[530] = 'ゴーゴート,くさ,,123,100,62,97,81,68,91.0,そうしょく,くさのけがわ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%BC%E3%82%B4%E3%83%BC%E3%83%88';
pokemon[531] = 'ニャスパー,エスパー,,62,48,54,63,60,68,3.5,するどいめ,すりぬけ,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%82%B9%E3%83%91%E3%83%BC';
pokemon[532] = 'ニャオニクス(オス),エスパー,,74,48,76,83,81,104,8.5,するどいめ,すりぬけ,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%82%AA%E3%83%8B%E3%82%AF%E3%82%B9';
pokemon[533] = 'ニャオニクス(メス),エスパー,,74,48,76,83,81,104,8.5,するどいめ,すりぬけ,かちき,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%82%AA%E3%83%8B%E3%82%AF%E3%82%B9';
pokemon[534] = 'マーイーカ,あく,エスパー,53,54,53,37,46,45,3.5,あまのじゃく,きゅうばん,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%BC%E3%82%A4%E3%83%BC%E3%82%AB';
pokemon[535] = 'カラマネロ,あく,エスパー,86,92,88,68,75,73,47.0,あまのじゃく,きゅうばん,すりぬけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A9%E3%83%9E%E3%83%8D%E3%83%AD';
pokemon[536] = 'クズモー,どく,みず,50,60,60,60,60,30,7.3,どくのトゲ,どくしゅ,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%82%BA%E3%83%A2%E3%83%BC';
pokemon[537] = 'ドラミドロ,どく,ドラゴン,65,75,90,97,123,44,81.5,どくのトゲ,どくしゅ,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%A9%E3%83%9F%E3%83%89%E3%83%AD';
pokemon[538] = 'ウデッポウ,みず,,50,53,62,58,63,44,8.3,メガランチャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%87%E3%83%83%E3%83%9D%E3%82%A6';
pokemon[539] = 'ブロスター,みず,,71,73,88,120,89,59,35.3,メガランチャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AD%E3%82%B9%E3%82%BF%E3%83%BC';
pokemon[540] = 'ニンフィア,フェアリー,,95,65,65,110,130,60,23.5,メロメロボディ,フェアリースキン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%B3%E3%83%95%E3%82%A3%E3%82%A2';
pokemon[541] = 'ルチャブル,かくとう,ひこう,78,92,75,74,63,118,21.5,じゅうなん,かるわざ,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%83%81%E3%83%A3%E3%83%96%E3%83%AB';
pokemon[542] = 'デデンネ,でんき,フェアリー,67,58,57,81,67,101,2.2,ほおぶくろ,ものひろい,プラス,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%87%E3%83%B3%E3%83%8D';
pokemon[543] = 'メレシー,いわ,フェアリー,50,50,150,50,150,50,5.7,クリアボディ,がんじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%AC%E3%82%B7%E3%83%BC';
pokemon[544] = 'ヌメラ,ドラゴン,,45,50,35,55,75,40,2.8,そうしょく,うるおいボディ,ぬめぬめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%A1%E3%83%A9';
pokemon[545] = 'ヌメイル,ドラゴン,,68,75,53,83,113,60,17.5,そうしょく,うるおいボディ,ぬめぬめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%A1%E3%82%A4%E3%83%AB';
pokemon[546] = 'ヒスイヌメイル,はがね,ドラゴン,58,75,83,83,113,40,68.5,そうしょく,シェルアーマー,ぬめぬめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%A1%E3%82%A4%E3%83%AB';
pokemon[547] = 'ヌメルゴン,ドラゴン,,90,100,70,110,150,80,150.5,そうしょく,うるおいボディ,ぬめぬめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%A1%E3%83%AB%E3%82%B4%E3%83%B3';
pokemon[548] = 'ヒスイヌメルゴン,はがね,ドラゴン,80,100,100,110,150,60,334.1,そうしょく,シェルアーマー,ぬめぬめ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8C%E3%83%A1%E3%83%AB%E3%82%B4%E3%83%B3';
pokemon[549] = 'クレッフィ,はがね,フェアリー,57,80,91,80,87,75,3.0,いたずらごころ,マジシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AC%E3%83%83%E3%83%95%E3%82%A3';
pokemon[550] = 'ボクレー,ゴースト,くさ,43,70,48,50,60,38,7.0,しぜんかいふく,おみとおし,しゅうかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%82%AF%E3%83%AC%E3%83%BC';
pokemon[551] = 'オーロット,ゴースト,くさ,85,110,76,65,82,56,71.0,しぜんかいふく,おみとおし,しゅうかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%83%AD%E3%83%83%E3%83%88';
pokemon[552] = 'カチコール,こおり,,55,69,85,32,35,28,99.5,マイペース,アイスボディ,がんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%81%E3%82%B3%E3%83%BC%E3%83%AB';
pokemon[553] = 'クレベース,こおり,,95,117,184,44,46,28,505.0,マイペース,アイスボディ,がんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AC%E3%83%99%E3%83%BC%E3%82%B9';
pokemon[554] = 'ヒスイクレベース,こおり,いわ,95,127,184,34,36,38,262.4,がんじょうあご,アイスボディ,がんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AC%E3%83%99%E3%83%BC%E3%82%B9';
pokemon[555] = 'オンバット,ひこう,ドラゴン,40,30,35,45,40,55,8.0,おみとおし,すりぬけ,テレパシー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%B3%E3%83%90%E3%83%83%E3%83%88';
pokemon[556] = 'オンバーン,ひこう,ドラゴン,85,70,80,97,80,123,85.0,おみとおし,すりぬけ,テレパシー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%B3%E3%83%90%E3%83%BC%E3%83%B3';
pokemon[557] = 'ディアンシー,いわ,フェアリー,50,100,150,100,150,50,8.8,クリアボディ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%A2%E3%83%B3%E3%82%B7%E3%83%BC';
pokemon[558] = 'フーパ(いましめられし),エスパー,ゴースト,80,110,60,150,130,70,9.0,マジシャン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%BC%E3%83%91';
pokemon[559] = 'フーパ(ときはなたれし),エスパー,あく,80,160,60,170,130,80,490.0,マジシャン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%83%BC%E3%83%91';
pokemon[560] = 'ボルケニオン,ほのお,みず,80,110,120,130,90,70,195.0,ちょすい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%83%AB%E3%82%B1%E3%83%8B%E3%82%AA%E3%83%B3';
pokemon[561] = 'モクロー,くさ,ひこう,68,55,55,50,50,42,1.5,しんりょく,えんかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%82%AF%E3%83%AD%E3%83%BC';
pokemon[562] = 'フクスロー,くさ,ひこう,78,75,75,70,70,52,16.0,しんりょく,えんかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%95%E3%82%AF%E3%82%B9%E3%83%AD%E3%83%BC';
pokemon[563] = 'ジュナイパー,くさ,ゴースト,78,107,75,100,100,70,36.6,しんりょく,えんかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%83%8A%E3%82%A4%E3%83%91%E3%83%BC';
pokemon[564] = 'ヒスイジュナイパー,くさ,かくとう,88,112,80,95,95,60,37.0,しんりょく,きもったま,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%83%8A%E3%82%A4%E3%83%91%E3%83%BC';
pokemon[565] = 'ニャビー,ほのお,,45,65,40,60,40,70,4.3,もうか,いかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%93%E3%83%BC';
pokemon[566] = 'ニャヒート,ほのお,,65,85,50,80,50,90,25.0,もうか,いかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%92%E3%83%BC%E3%83%88';
pokemon[567] = 'ガオガエン,ほのお,あく,95,115,90,80,90,60,83.0,もうか,いかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%82%AA%E3%82%AC%E3%82%A8%E3%83%B3';
pokemon[568] = 'アシマリ,みず,,50,54,54,66,56,40,7.5,げきりゅう,うるおいボイス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%B7%E3%83%9E%E3%83%AA';
pokemon[569] = 'オシャマリ,みず,,60,69,69,91,81,50,17.5,げきりゅう,うるおいボイス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%82%B7%E3%83%A3%E3%83%9E%E3%83%AA';
pokemon[570] = 'アシレーヌ,みず,フェアリー,80,74,74,126,116,60,44.0,げきりゅう,うるおいボイス,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%B7%E3%83%AC%E3%83%BC%E3%83%8C';
pokemon[571] = 'ツツケラ,ノーマル,ひこう,35,75,30,30,30,65,1.2,するどいめ,スキルリンク,ものひろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%84%E3%83%84%E3%82%B1%E3%83%A9';
pokemon[572] = 'ケララッパ,ノーマル,ひこう,55,85,50,40,50,75,14.8,するどいめ,スキルリンク,ものひろい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%83%A9%E3%83%A9%E3%83%83%E3%83%91';
pokemon[573] = 'ドデカバシ,ノーマル,ひこう,80,120,75,75,75,60,26.0,するどいめ,スキルリンク,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%87%E3%82%AB%E3%83%90%E3%82%B7';
pokemon[574] = 'ヤングース,ノーマル,,48,70,30,30,30,45,6.0,はりこみ,がんじょうあご,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%B3%E3%82%B0%E3%83%BC%E3%82%B9';
pokemon[575] = 'デカグース,ノーマル,,88,110,60,55,60,45,14.2,はりこみ,がんじょうあご,てきおうりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%AB%E3%82%B0%E3%83%BC%E3%82%B9';
pokemon[576] = 'アゴジムシ,むし,,47,62,45,55,45,46,4.4,むしのしらせ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%B4%E3%82%B8%E3%83%A0%E3%82%B7';
pokemon[577] = 'デンヂムシ,むし,でんき,57,82,95,55,75,36,10.5,バッテリー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%83%B3%E3%83%82%E3%83%A0%E3%82%B7';
pokemon[578] = 'クワガノン,むし,でんき,77,70,90,145,75,43,45.0,ふゆう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AF%E3%82%AC%E3%83%8E%E3%83%B3';
pokemon[579] = 'マケンカニ,かくとう,,47,82,57,42,47,63,7.0,かいりきバサミ,てつのこぶし,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B1%E3%83%B3%E3%82%AB%E3%83%8B';
pokemon[580] = 'ケケンカニ,かくとう,こおり,97,132,77,62,67,43,180.0,かいりきバサミ,てつのこぶし,いかりのつぼ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B1%E3%82%B1%E3%83%B3%E3%82%AB%E3%83%8B';
pokemon[581] = 'オドリドリ(めらめらスタイル),ほのお,ひこう,75,70,70,98,70,93,3.4,おどりこ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%89%E3%83%AA%E3%83%89%E3%83%AA';
pokemon[582] = 'オドリドリ(ぱちぱちスタイル),ほのお,ひこう,75,70,70,98,70,93,3.4,おどりこ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%89%E3%83%AA%E3%83%89%E3%83%AA';
pokemon[583] = 'オドリドリ(ふらふらスタイル),ほのお,ひこう,75,70,70,98,70,93,3.4,おどりこ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%89%E3%83%AA%E3%83%89%E3%83%AA';
pokemon[584] = 'オドリドリ(まいまいスタイル),ほのお,ひこう,75,70,70,98,70,93,3.4,おどりこ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%89%E3%83%AA%E3%83%89%E3%83%AA';
pokemon[585] = 'アブリー,むし,フェアリー,40,45,40,55,40,84,0.2,みつあつめ,りんぷん,スイートベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%96%E3%83%AA%E3%83%BC';
pokemon[586] = 'アブリボン,むし,フェアリー,60,55,60,95,70,124,0.5,みつあつめ,りんぷん,スイートベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%96%E3%83%AA%E3%83%9C%E3%83%B3';
pokemon[587] = 'イワンコ(通常),いわ,,45,65,40,30,40,60,9.2,するどいめ,やるき,ふくつのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%AF%E3%83%B3%E3%82%B3';
pokemon[588] = 'イワンコ(マイペース),いわ,,45,65,40,30,40,60,9.2,するどいめ,やるき,ふくつのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%AF%E3%83%B3%E3%82%B3';
pokemon[589] = 'ルガルガン(まひる),いわ,,75,115,65,55,65,112,25.0,するどいめ,すなかき,ふくつのこころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AC%E3%83%AB%E3%82%AC%E3%83%B3';
pokemon[590] = 'ルガルガン(まよなか),いわ,,85,115,75,55,75,82,25.0,するどいめ,やるき,ノーガード,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AC%E3%83%AB%E3%82%AC%E3%83%B3';
pokemon[591] = 'ルガルガン(たそがれ),いわ,,75,117,65,55,65,110,25.0,かたいツメ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%82%AC%E3%83%AB%E3%82%AC%E3%83%B3';
pokemon[592] = 'ヒドイデ,どく,みず,50,53,62,43,52,45,8.0,ひとでなし,じゅうなん,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%89%E3%82%A4%E3%83%87';
pokemon[593] = 'ドヒドイデ,どく,みず,50,63,152,53,142,35,14.5,ひとでなし,じゅうなん,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%89%E3%82%A4%E3%83%87';
pokemon[594] = 'ドロバンコ,じめん,,70,100,70,45,55,45,110.0,マイペース,じきゅうりょく,せいしんりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%AD%E3%83%90%E3%83%B3%E3%82%B3';
pokemon[595] = 'バンバドロ,じめん,,100,125,100,55,85,35,920.0,マイペース,じきゅうりょく,せいしんりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%B3%E3%83%90%E3%83%89%E3%83%AD';
pokemon[596] = 'シズクモ,みず,むし,38,40,52,40,72,27,4.0,すいほう,ちょすい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%BA%E3%82%AF%E3%83%A2';
pokemon[597] = 'オニシズクモ,みず,むし,68,70,92,50,132,42,82.0,すいほう,ちょすい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%BA%E3%82%AF%E3%83%A2';
pokemon[598] = 'カリキリ,くさ,,40,55,35,50,35,35,1.5,リーフガード,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%AA%E3%82%AD%E3%83%AA';
pokemon[599] = 'ラランテス,くさ,,70,105,90,80,90,45,18.5,リーフガード,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%A9%E3%83%B3%E3%83%86%E3%82%B9';
pokemon[600] = 'ヤトウモリ,どく,ほのお,48,44,40,71,40,77,4.8,ふしょく,どんかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%88%E3%82%A6%E3%83%A2%E3%83%AA';
pokemon[601] = 'エンニュート,どく,ほのお,68,64,60,111,60,117,22.2,ふしょく,どんかん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%B3%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%88';
pokemon[602] = 'アマカジ,くさ,,42,30,38,30,38,32,3.2,リーフガード,どんかん,スイートベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%9E%E3%82%AB%E3%82%B8';
pokemon[603] = 'アママイコ,くさ,,52,40,48,40,48,62,8.2,リーフガード,どんかん,スイートベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%9E%E3%83%9E%E3%82%A4%E3%82%B3';
pokemon[604] = 'アマージョ,くさ,,72,120,98,50,98,72,21.4,リーフガード,じょおうのいげん,スイートベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%9E%E3%83%BC%E3%82%B8%E3%83%A7';
pokemon[605] = 'キュワワー,フェアリー,,51,52,90,82,110,100,0.3,フラワーベール,ヒーリングシフト,しぜんかいふく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A5%E3%83%AF%E3%83%AF%E3%83%BC';
pokemon[606] = 'ヤレユータン,ノーマル,エスパー,90,60,80,90,110,60,76.0,せいしんりょく,テレパシー,きょうせい,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%AC%E3%83%A6%E3%83%BC%E3%82%BF%E3%83%B3';
pokemon[607] = 'ナゲツケサル,かくとう,,100,120,90,40,60,80,82.8,レシーバー,まけんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%82%B2%E3%83%84%E3%82%B1%E3%82%B5%E3%83%AB';
pokemon[608] = 'スナバァ,ゴースト,じめん,55,55,80,70,45,15,70.0,みずがため,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%8A%E3%83%90%E3%82%A1';
pokemon[609] = 'シロデスナ,ゴースト,じめん,85,75,110,100,75,35,250.0,みずがため,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%AD%E3%83%87%E3%82%B9%E3%83%8A';
pokemon[610] = 'メテノ(りゅうせいのすがた),いわ,ひこう,60,60,100,60,100,60,40.0,リミットシールド,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%86%E3%83%8E';
pokemon[611] = 'メテノ(コア),いわ,ひこう,60,60,100,60,100,60,40.0,リミットシールド,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%86%E3%83%8E';
pokemon[612] = 'ネッコアラ,ノーマル,,65,115,65,75,95,65,19.9,ぜったいねむり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8D%E3%83%83%E3%82%B3%E3%82%A2%E3%83%A9';
pokemon[613] = 'ミミッキュ,ゴースト,フェアリー,55,90,80,50,105,96,0.7,ばけのかわ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%9F%E3%83%83%E3%82%AD%E3%83%A5';
pokemon[614] = 'ハギギシリ,みず,エスパー,68,105,70,70,70,92,19.0,ビビッドボディ,がんじょうあご,ミラクルスキン,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%82%AE%E3%82%AE%E3%82%B7%E3%83%AA';
pokemon[615] = 'ジャラコ,ドラゴン,,45,55,65,45,45,45,29.7,ぼうだん,ぼうおん,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A3%E3%83%A9%E3%82%B3';
pokemon[616] = 'ジャランゴ,ドラゴン,かくとう,55,75,90,65,70,65,47.0,ぼうだん,ぼうおん,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A3%E3%83%A9%E3%83%B3%E3%82%B4';
pokemon[617] = 'ジャラランガ,ドラゴン,かくとう,75,110,125,100,105,85,78.2,ぼうだん,ぼうおん,ぼうじん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A3%E3%83%A9%E3%83%A9%E3%83%B3%E3%82%AC';
pokemon[618] = 'コスモッグ,エスパー,,43,29,31,29,31,37,0.1,てんねん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B9%E3%83%A2%E3%83%83%E3%82%B0';
pokemon[619] = 'コスモウム,エスパー,,43,29,131,29,131,37,999.9,がんじょう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B9%E3%83%A2%E3%82%A6%E3%83%A0';
pokemon[620] = 'ソルガレオ,エスパー,はがね,137,137,107,113,89,97,230.0,メタルプロテクト,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BD%E3%83%AB%E3%82%AC%E3%83%AC%E3%82%AA';
pokemon[621] = 'ルナアーラ,エスパー,ゴースト,137,113,89,137,107,97,120.0,ファントムガード,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AB%E3%83%8A%E3%82%A2%E3%83%BC%E3%83%A9';
pokemon[622] = 'ネクロズマ,エスパー,,97,107,101,127,89,79,230.0,プリズムアーマー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8D%E3%82%AF%E3%83%AD%E3%82%BA%E3%83%9E';
pokemon[623] = 'ネクロズマ(たそがれのたてがみ),エスパー,はがね,97,157,127,113,109,77,460.0,プリズムアーマー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8D%E3%82%AF%E3%83%AD%E3%82%BA%E3%83%9E';
pokemon[624] = 'ネクロズマ(あかつきのつばさ),エスパー,ゴースト,97,113,109,157,127,77,350.0,プリズムアーマー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8D%E3%82%AF%E3%83%AD%E3%82%BA%E3%83%9E';
pokemon[625] = 'マギアナ(通常),はがね,フェアリー,80,95,115,130,115,65,80.5,ソウルハート,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%AE%E3%82%A2%E3%83%8A';
pokemon[626] = 'マギアナ(500年前のすがた),はがね,フェアリー,80,95,115,130,115,65,80.5,ソウルハート,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%AE%E3%82%A2%E3%83%8A';
pokemon[627] = 'サルノリ,くさ,,50,65,50,40,40,65,5.0,しんりょく,グラスメイカー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%AB%E3%83%8E%E3%83%AA';
pokemon[628] = 'バチンキー,くさ,,70,85,70,55,60,80,14.0,しんりょく,グラスメイカー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%81%E3%83%B3%E3%82%AD%E3%83%BC';
pokemon[629] = 'ゴリランダー,くさ,,100,125,90,60,70,85,90.0,しんりょく,グラスメイカー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B4%E3%83%AA%E3%83%A9%E3%83%B3%E3%83%80%E3%83%BC';
pokemon[630] = 'ヒバニー,ほのお,,50,71,40,40,40,69,4.5,もうか,リベロ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%90%E3%83%8B%E3%83%BC';
pokemon[631] = 'ラビフット,ほのお,,65,86,60,55,60,94,9.0,もうか,リベロ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%93%E3%83%95%E3%83%83%E3%83%88';
pokemon[632] = 'エースバーン,ほのお,,80,116,75,65,75,119,33.0,もうか,リベロ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%BC%E3%82%B9%E3%83%90%E3%83%BC%E3%83%B3';
pokemon[633] = 'メッソン,みず,,50,40,40,70,40,70,4.0,げきりゅう,スナイパー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A1%E3%83%83%E3%82%BD%E3%83%B3';
pokemon[634] = 'ジメレオン,みず,,65,60,55,95,55,90,11.5,げきりゅう,スナイパー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A1%E3%83%AC%E3%82%AA%E3%83%B3';
pokemon[635] = 'インテレオン,みず,,70,85,65,125,65,120,45.2,げきりゅう,スナイパー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%B3%E3%83%86%E3%83%AC%E3%82%AA%E3%83%B3';
pokemon[636] = 'ホシガリス,ノーマル,,70,55,55,35,35,25,2.5,ほおぶくろ,くいしんぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9B%E3%82%B7%E3%82%AC%E3%83%AA%E3%82%B9';
pokemon[637] = 'ヨクバリス,ノーマル,,120,95,95,55,75,20,6.0,ほおぶくろ,くいしんぼう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A8%E3%82%AF%E3%83%90%E3%83%AA%E3%82%B9';
pokemon[638] = 'ココガラ,ひこう,,38,47,35,33,35,57,1.8,するどいめ,きんちょうかん,はとむね,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B3%E3%82%AC%E3%83%A9';
pokemon[639] = 'アオガラス,ひこう,,68,67,55,43,55,77,16.0,するどいめ,きんちょうかん,はとむね,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%82%AA%E3%82%AC%E3%83%A9%E3%82%B9';
pokemon[640] = 'アーマーガア,ひこう,はがね,98,87,105,53,85,67,75.0,プレッシャー,きんちょうかん,ミラーアーマー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%BC%E3%83%9E%E3%83%BC%E3%82%AC%E3%82%A2';
pokemon[641] = 'カムカメ,みず,,50,64,50,38,38,44,8.5,がんじょうあご,シェルアーマー,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A0%E3%82%AB%E3%83%A1';
pokemon[642] = 'カジリガメ,みず,いわ,90,115,90,48,68,74,115.5,がんじょうあご,シェルアーマー,すいすい,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%B8%E3%83%AA%E3%82%AC%E3%83%A1';
pokemon[643] = 'タンドン,いわ,,30,40,50,40,50,30,12.0,じょうききかん,たいねつ,もらいび,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%B3%E3%83%89%E3%83%B3';
pokemon[644] = 'トロッゴン,いわ,ほのお,80,60,90,60,70,50,78.0,じょうききかん,ほのおのからだ,もらいび,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%AD%E3%83%83%E3%82%B4%E3%83%B3';
pokemon[645] = 'セキタンザン,いわ,ほのお,110,80,120,80,90,30,310.5,じょうききかん,ほのおのからだ,もらいび,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BB%E3%82%AD%E3%82%BF%E3%83%B3%E3%82%B6%E3%83%B3';
pokemon[646] = 'カジッチュ,くさ,ドラゴン,40,40,80,40,40,20,0.5,じゅくせい,くいしんぼう,ぼうだん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%B8%E3%83%83%E3%83%81%E3%83%A5';
pokemon[647] = 'アップリュー,くさ,ドラゴン,70,110,80,95,60,70,1.0,じゅくせい,くいしんぼう,はりきり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%83%E3%83%97%E3%83%AA%E3%83%A5%E3%83%BC';
pokemon[648] = 'タルップル,くさ,ドラゴン,110,85,80,100,80,30,13.0,じゅくせい,くいしんぼう,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%AB%E3%83%83%E3%83%97%E3%83%AB';
pokemon[649] = 'スナヘビ,じめん,,52,57,75,35,50,46,7.6,すなはき,だっぴ,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%8A%E3%83%98%E3%83%93';
pokemon[650] = 'サダイジャ,じめん,,72,107,125,65,70,71,65.5,すなはき,だっぴ,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%80%E3%82%A4%E3%82%B8%E3%83%A3';
pokemon[651] = 'ウッウ,ひこう,みず,70,85,55,85,95,85,18.0,うのミサイル,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%83%E3%82%A6';
pokemon[652] = 'サシカマス,みず,,41,63,40,40,30,66,1.0,すいすい,スクリューおびれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%B7%E3%82%AB%E3%83%9E%E3%82%B9';
pokemon[653] = 'カマスジョー,みず,,61,123,60,60,50,136,30.0,すいすい,スクリューおびれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%9E%E3%82%B9%E3%82%B8%E3%83%A7%E3%83%BC';
pokemon[654] = 'エレズン,でんき,どく,40,38,35,54,35,40,11.0,びびり,せいでんき,ぶきよう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%83%AC%E3%82%BA%E3%83%B3';
pokemon[655] = 'ストリンダー(ハイのすがた),でんき,どく,75,98,70,114,70,75,40.0,パンクロック,プラス,テクニシャン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%88%E3%83%AA%E3%83%B3%E3%83%80%E3%83%BC';
pokemon[656] = 'ストリンダー(ローのすがた),でんき,どく,75,98,70,114,70,75,40.0,パンクロック,プラス,テクニシャン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%88%E3%83%AA%E3%83%B3%E3%83%80%E3%83%BC';
pokemon[657] = 'ヤバチャ(がんさくフォルム),ゴースト,,40,45,45,74,54,50,0.2,くだけるよろい,のろわれボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%90%E3%83%81%E3%83%A3';
pokemon[658] = 'ヤバチャ(しんさくフォルム),ゴースト,,40,45,45,74,54,50,0.2,くだけるよろい,のろわれボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%90%E3%83%81%E3%83%A3';
pokemon[659] = 'ポットデス(がんさくフォルム),ゴースト,,60,65,65,134,114,70,0.4,くだけるよろい,のろわれボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%83%E3%83%88%E3%83%87%E3%82%B9';
pokemon[660] = 'ポットデス(しんさくフォルム),ゴースト,,60,65,65,134,114,70,0.4,くだけるよろい,のろわれボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9D%E3%83%83%E3%83%88%E3%83%87%E3%82%B9';
pokemon[661] = 'ミブリム,エスパー,,42,30,45,56,53,39,3.4,いやしのこころ,きけんよち,マジックミラー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%96%E3%83%AA%E3%83%A0';
pokemon[662] = 'テブリム,エスパー,,57,40,65,86,73,49,4.8,いやしのこころ,きけんよち,マジックミラー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%96%E3%83%AA%E3%83%A0';
pokemon[663] = 'ブリムオン,エスパー,フェアリー,57,90,95,136,103,29,5.1,いやしのこころ,きけんよち,マジックミラー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AA%E3%83%A0%E3%82%AA%E3%83%B3';
pokemon[664] = 'ベロバー,あく,フェアリー,45,45,30,55,40,50,5.5,いたずらごころ,おみとおし,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%AD%E3%83%90%E3%83%BC';
pokemon[665] = 'ギモー,あく,フェアリー,65,60,45,75,55,70,12.5,いたずらごころ,おみとおし,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AE%E3%83%A2%E3%83%BC';
pokemon[666] = 'オーロンゲ,あく,フェアリー,95,120,65,95,75,60,61.0,いたずらごころ,おみとおし,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%83%AD%E3%83%B3%E3%82%B2';
pokemon[667] = 'ニャイキング,はがね,,70,110,100,50,60,50,28.0,カブトアーマー,かたいツメ,はがねのせいしん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%82%A4%E3%82%AD%E3%83%B3%E3%82%B0';
pokemon[668] = 'マホミル,フェアリー,,45,40,40,50,61,34,0.3,スイートベール,アロマベール,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%9B%E3%83%9F%E3%83%AB';
pokemon[669] = 'マホイップ,フェアリー,,65,60,75,110,121,64,0.5,スイートベール,アロマベール,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%9B%E3%82%A4%E3%83%83%E3%83%97';
pokemon[670] = 'タイレーツ,かくとう,,65,100,100,70,60,75,62.0,カブトアーマー,まけんき,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%82%A4%E3%83%AC%E3%83%BC%E3%83%84';
pokemon[671] = 'バチンウニ,でんき,,48,101,95,91,85,15,1.0,ひらいしん,エレキメイカー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%81%E3%83%B3%E3%82%A6%E3%83%8B';
pokemon[672] = 'ユキハミ,こおり,むし,30,25,35,45,30,20,3.8,りんぷん,こおりのりんぷん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A6%E3%82%AD%E3%83%8F%E3%83%9F';
pokemon[673] = 'モスノウ,こおり,むし,70,65,60,125,90,65,42.0,りんぷん,こおりのりんぷん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%82%B9%E3%83%8E%E3%82%A6';
pokemon[674] = 'イシヘンジン,いわ,,100,125,135,20,20,70,520.0,パワースポット,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%B7%E3%83%98%E3%83%B3%E3%82%B8%E3%83%B3';
pokemon[675] = 'コオリッポ(アイスフェイス),こおり,,75,80,110,65,90,50,89.0,アイスフェイス,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%AA%E3%83%AA%E3%83%83%E3%83%9D';
pokemon[676] = 'コオリッポ(ナイスフェイス),こおり,,75,80,110,65,90,50,89.0,アイスフェイス,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%AA%E3%83%AA%E3%83%83%E3%83%9D';
pokemon[677] = 'イエッサン(オス),エスパー,ノーマル,60,65,55,105,95,95,28.0,せいしんりょく,シンクロ,サイコメイカー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%A8%E3%83%83%E3%82%B5%E3%83%B3';
pokemon[678] = 'イエッサン(メス),エスパー,ノーマル,70,55,65,95,105,85,28.0,マイペース,シンクロ,サイコメイカー,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%A8%E3%83%83%E3%82%B5%E3%83%B3';
pokemon[679] = 'モルペコ(まんぷくもよう),でんき,あく,58,95,58,70,58,97,3.0,はらぺこスイッチ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%AB%E3%83%9A%E3%82%B3';
pokemon[680] = 'モルペコ(はらぺこもよう),でんき,あく,58,95,58,70,58,97,3.0,はらぺこスイッチ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%AB%E3%83%9A%E3%82%B3';
pokemon[681] = 'ゾウドウ,はがね,,72,80,49,40,49,40,100.0,ちからずく,ヘヴィメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BE%E3%82%A6%E3%83%89%E3%82%A6';
pokemon[682] = 'ダイオウドウ,はがね,,122,130,69,80,69,30,650.0,ちからずく,ヘヴィメタル,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%A4%E3%82%AA%E3%82%A6%E3%83%89%E3%82%A6';
pokemon[683] = 'ジュラルドン,はがね,ドラゴン,70,95,115,120,50,85,40.0,ライトメタル,ヘヴィメタル,すじがねいり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%83%A5%E3%83%A9%E3%83%AB%E3%83%89%E3%83%B3';
pokemon[684] = 'ドラメシヤ,ドラゴン,ゴースト,28,60,30,40,30,82,2.0,クリアボディ,すりぬけ,のろわれボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%A9%E3%83%A1%E3%82%B7%E3%83%A4';
pokemon[685] = 'ドロンチ,ドラゴン,ゴースト,68,80,50,60,50,102,11.0,クリアボディ,すりぬけ,のろわれボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%AD%E3%83%B3%E3%83%81';
pokemon[686] = 'ドラパルト,ドラゴン,ゴースト,88,120,75,100,75,142,50.0,クリアボディ,すりぬけ,のろわれボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%A9%E3%83%91%E3%83%AB%E3%83%88';
pokemon[687] = 'ザシアン(れきせんのゆうしゃ),フェアリー,,92,120,115,80,115,138,110.0,ふとうのけん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%82%B7%E3%82%A2%E3%83%B3';
pokemon[688] = 'ザシアン(けんのおう),フェアリー,,92,120,115,80,115,138,110.0,ふとうのけん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%82%B7%E3%82%A2%E3%83%B3';
pokemon[689] = 'ザマゼンタ(れきせんのゆうしゃ),かくとう,,92,120,115,80,115,138,210.0,ふくつのたて,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%83%9E%E3%82%BC%E3%83%B3%E3%82%BF';
pokemon[690] = 'ザマゼンタ(たてのおう),かくとう,,92,120,115,80,115,138,210.0,ふくつのたて,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%83%9E%E3%82%BC%E3%83%B3%E3%82%BF';
pokemon[691] = 'ムゲンダイナ,どく,ドラゴン,140,85,95,145,95,130,950.0,プレッシャー,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A0%E3%82%B2%E3%83%B3%E3%83%80%E3%82%A4%E3%83%8A';
pokemon[692] = 'ダクマ,かくとう,,60,90,60,53,50,72,12.0,せいしんりょく,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%80%E3%82%AF%E3%83%9E';
pokemon[693] = 'ウーラオス(れんげき),かくとう,みず,100,130,100,63,60,97,105.0,ふかしのこぶし,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%BC%E3%83%A9%E3%82%AA%E3%82%B9';
pokemon[694] = 'ウーラオス(いちげき),かくとう,あく,100,130,100,63,60,97,105.0,ふかしのこぶし,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%BC%E3%83%A9%E3%82%AA%E3%82%B9';
pokemon[695] = 'ザルード(通常),あく,くさ,105,120,105,70,95,105,70.0,リーフガード,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%83%AB%E3%83%BC%E3%83%89';
pokemon[696] = 'ザルード(オコヤのもり),あく,くさ,105,120,105,70,95,105,70.0,リーフガード,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B6%E3%83%AB%E3%83%BC%E3%83%89';
pokemon[697] = 'レジエレキ,でんき,,80,100,50,100,50,200,145.0,トランジスタ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%82%A8%E3%83%AC%E3%82%AD';
pokemon[698] = 'レジドラゴ,ドラゴン,,200,100,50,100,50,80,200.0,りゅうのあぎと,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%B8%E3%83%89%E3%83%A9%E3%82%B4';
pokemon[699] = 'ブリザポス,こおり,,100,145,130,65,110,30,800.0,しろのいななき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AA%E3%82%B6%E3%83%9D%E3%82%B9';
pokemon[700] = 'レイスポス,ゴースト,,100,65,60,145,80,130,44.5,くろのいななき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AC%E3%82%A4%E3%82%B9%E3%83%9D%E3%82%B9';
pokemon[701] = 'バドレックス,エスパー,くさ,100,80,80,80,80,80,7.7,きんちょうかん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%89%E3%83%AC%E3%83%83%E3%82%AF%E3%82%B9';
pokemon[702] = 'バドレックス(こくば),エスパー,ゴースト,100,85,80,165,100,150,53.6,じんばいったい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%89%E3%83%AC%E3%83%83%E3%82%AF%E3%82%B9';
pokemon[703] = 'バドレックス(はくば),エスパー,こおり,100,165,150,85,130,50,809.1,じんばいったい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%83%89%E3%83%AC%E3%83%83%E3%82%AF%E3%82%B9';
pokemon[704] = 'アヤシシ,ノーマル,エスパー,103,105,72,105,75,65,95.1,いかく,おみとおし,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%A4%E3%82%B7%E3%82%B7';
pokemon[705] = 'バサギリ,むし,いわ,70,135,95,45,70,85,89.0,むしのしらせ,ちからずく,きれあじ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%B5%E3%82%AE%E3%83%AA';
pokemon[706] = 'ガチグマ,じめん,ノーマル,130,140,105,45,80,50,290.0,こんじょう,ぼうだん,きんちょうかん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%81%E3%82%B0%E3%83%9E';
pokemon[707] = 'イダイトウ(オス),みず,ゴースト,120,112,65,80,75,78,110.0,すいすい,てきおうりょく,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%80%E3%82%A4%E3%83%88%E3%82%A6';
pokemon[708] = 'イダイトウ(メス),みず,ゴースト,120,92,65,100,75,78,110.0,すいすい,てきおうりょく,かたやぶり,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%80%E3%82%A4%E3%83%88%E3%82%A6';
pokemon[709] = 'オオニューラ,かくとう,どく,80,130,60,40,80,120,43.0,プレッシャー,かるわざ,どくしゅ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%A9';
pokemon[710] = 'ハリーマン,あく,どく,85,115,95,65,65,85,60.5,どくのトゲ,すいすい,いかく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AA%E3%83%BC%E3%83%9E%E3%83%B3';
pokemon[711] = 'ラブトロス(けしんフォルム),フェアリー,ひこう,74,115,70,135,80,106,48.0,メロメロボディ,あまのじゃく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%96%E3%83%88%E3%83%AD%E3%82%B9';
pokemon[712] = 'ラブトロス(れいじゅうフォルム),フェアリー,ひこう,74,115,110,135,100,46,48.0,ぼうじん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%96%E3%83%88%E3%83%AD%E3%82%B9';
pokemon[713] = 'ニャオハ,くさ,,40,61,54,45,45,65,4.1,しんりょく,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%82%AA%E3%83%8F';
pokemon[714] = 'ニャローテ,くさ,,61,80,63,60,63,83,12.2,しんりょく,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8B%E3%83%A3%E3%83%AD%E3%83%BC%E3%83%86';
pokemon[715] = 'マスカーニャ,くさ,あく,76,110,70,81,70,123,31.2,しんりょく,へんげんじざい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B9%E3%82%AB%E3%83%BC%E3%83%8B%E3%83%A3';
pokemon[716] = 'ホゲータ,ほのお,,67,45,59,63,40,36,9.8,もうか,てんねん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9B%E3%82%B2%E3%83%BC%E3%82%BF';
pokemon[717] = 'アチゲータ,ほのお,,81,55,78,90,58,49,30.7,もうか,てんねん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%81%E3%82%B2%E3%83%BC%E3%82%BF';
pokemon[718] = 'ラウドボーン,ほのお,ゴースト,104,75,100,110,75,66,326.5,もうか,てんねん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%82%A6%E3%83%89%E3%83%9C%E3%83%BC%E3%83%B3';
pokemon[719] = 'クワッス,みず,,55,65,45,50,45,50,6.1,げきりゅう,じしんかじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%83%AF%E3%83%83%E3%82%B9';
pokemon[720] = 'ウェルカモ,みず,,70,85,65,65,60,65,21.5,げきりゅう,じしんかじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A7%E3%83%AB%E3%82%AB%E3%83%A2';
pokemon[721] = 'ウェーニバル,みず,かくとう,85,120,80,85,75,85,61.9,げきりゅう,じしんかじょう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%A7%E3%83%BC%E3%83%8B%E3%83%90%E3%83%AB';
pokemon[722] = 'グルトン,ノーマル,,54,45,40,35,45,35,10.2,アロマベール,くいしんぼう,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%AB%E3%83%88%E3%83%B3';
pokemon[723] = 'パフュートン(オスのすがた),ノーマル,,110,100,75,59,80,65,120.0,とれないにおい,くいしんぼう,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%95%E3%83%A5%E3%83%BC%E3%83%88%E3%83%B3';
pokemon[724] = 'パフュートン(メスのすがた),ノーマル,,110,100,75,59,80,65,120.0,とれないにおい,くいしんぼう,あついしぼう,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%95%E3%83%A5%E3%83%BC%E3%83%88%E3%83%B3';
pokemon[725] = 'タマンチュラ,むし,,35,41,45,29,40,20,4.0,ふみん,はりこみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%83%9E%E3%83%B3%E3%83%81%E3%83%A5%E3%83%A9';
pokemon[726] = 'ワナイダー,むし,,60,79,92,52,86,35,16.5,ふみん,はりこみ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%83%8A%E3%82%A4%E3%83%80%E3%83%BC';
pokemon[727] = 'マメバッタ,むし,,33,46,40,21,25,45,1.0,むしのしらせ,いろめがね,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%A1%E3%83%90%E3%83%83%E3%82%BF';
pokemon[728] = 'エクスレッグ,むし,あく,71,102,78,52,55,92,17.5,むしのしらせ,いろめがね,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A8%E3%82%AF%E3%82%B9%E3%83%AC%E3%83%83%E3%82%B0';
pokemon[729] = 'パモ,でんき,,45,50,20,40,25,60,2.5,せいでんき,しぜんかいふく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%A2';
pokemon[730] = 'パモット,でんき,かくとう,60,75,40,50,40,85,6.5,ちくでん,しぜんかいふく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%A2';
pokemon[731] = 'パーモット,でんき,かくとう,70,115,70,70,60,105,41.0,ちくでん,しぜんかいふく,てつのこぶし,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%BC%E3%83%A2%E3%83%83%E3%83%88';
pokemon[732] = 'ワッカネズミ,ノーマル,,50,50,45,40,45,75,1.8,にげあし,ものひろい,マイペース,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AF%E3%83%83%E3%82%AB%E3%83%8D%E3%82%BA%E3%83%9F';
pokemon[733] = 'イッカネズミ,ノーマル,,74,75,70,65,75,111,2.3,フレンドガード,ほおぶくろ,テクニシャン,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%83%E3%82%AB%E3%83%8D%E3%82%BA%E3%83%9F';
pokemon[734] = 'パピモッチ,フェアリー,,37,55,70,30,55,65,10.9,マイペース,ぶきよう,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%83%94%E3%83%A2%E3%83%83%E3%83%81';
pokemon[735] = 'バウッツェル,フェアリー,,57,80,115,50,80,95,14.9,こんがりボディ,アロマベール,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%90%E3%82%A6%E3%83%83%E3%83%84%E3%82%A7%E3%83%AB';
pokemon[736] = 'ミニーブ,くさ,ノーマル,41,35,45,58,51,30,6.5,はやおき,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%8B%E3%83%BC%E3%83%96';
pokemon[737] = 'オリーニョ,くさ,ノーマル,52,53,60,78,78,33,11.9,はやおき,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%AA%E3%83%BC%E3%83%8B%E3%83%A7';
pokemon[738] = 'オリーヴァ,くさ,ノーマル,78,69,90,125,109,39,48.2,こぼれダネ,しゅうかく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%AA%E3%83%BC%E3%83%B4%E3%82%A1';
pokemon[739] = 'イキリンコ,ノーマル,ひこう,82,96,51,45,51,92,2.4,いかく,はりきり,こんじょう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%AD%E3%83%AA%E3%83%B3%E3%82%B3';
pokemon[740] = 'コジオ,いわ,,55,55,75,35,35,25,16.0,きよめのしお,がんじょう,クリアボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%82%B8%E3%82%AA';
pokemon[741] = 'ジオヅム,いわ,,60,60,100,35,65,35,105.0,きよめのしお,がんじょう,クリアボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B8%E3%82%AA%E3%83%85%E3%83%A0';
pokemon[742] = 'キョジオーン,いわ,,100,100,130,45,90,35,240.0,きよめのしお,がんじょう,クリアボディ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A7%E3%82%B8%E3%82%AA%E3%83%BC%E3%83%B3';
pokemon[743] = 'カルボウ,ほのお,,40,50,40,50,40,35,10.5,もらいび,ほのおのからだ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%AB%E3%83%9C%E3%82%A6';
pokemon[744] = 'グレンアルマ,ほのお,エスパー,85,60,100,125,80,75,85.0,もらいび,くだけるよろい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B0%E3%83%AC%E3%83%B3%E3%82%A2%E3%83%AB%E3%83%9E';
pokemon[745] = 'ソウブレイズ,ほのお,ゴースト,75,125,80,60,100,85,62.0,もらいび,くだけるよろい,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BD%E3%82%A6%E3%83%96%E3%83%AC%E3%82%A4%E3%82%BA';
pokemon[746] = 'ズピカ,でんき,,61,31,41,59,35,45,0.4,マイペース,せいでんき,しめりけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BA%E3%83%94%E3%82%AB';
pokemon[747] = 'ハラバリー,でんき,,109,64,91,103,83,45,113.0,でんきにかえる,せいでんき,しめりけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%A9%E3%83%90%E3%83%AA%E3%83%BC';
pokemon[748] = 'カイデン,でんき,ひこう,40,40,35,55,40,70,3.6,ふうりょくでんき,ちくでん,かちき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A4%E3%83%87%E3%83%B3';
pokemon[749] = 'タイカイデン,でんき,ひこう,70,70,60,105,60,125,38.6,ふうりょくでんき,ちくでん,かちき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%82%A4%E3%83%87%E3%83%B3';
pokemon[750] = 'オラチフ,あく,,60,78,60,40,51,51,16.0,いかく,にげあし,はりこみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%A9%E3%83%81%E3%83%95';
pokemon[751] = 'マフィティフ,あく,,80,120,90,60,70,85,61.0,いかく,ばんけん,はりこみ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%83%95%E3%82%A3%E3%83%86%E3%82%A3%E3%83%95';
pokemon[752] = 'シルシュルー,どく,ノーマル,40,65,35,40,35,75,0.7,かるわざ,わるいてぐせ,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%AB%E3%82%B7%E3%83%A5%E3%83%AB%E3%83%BC';
pokemon[753] = 'タギングル,どく,ノーマル,63,95,65,80,72,110,27.2,かるわざ,どくしゅ,いたずらごころ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%82%AE%E3%83%B3%E3%82%B0%E3%83%AB';
pokemon[754] = 'アノクサ,くさ,ゴースト,40,65,30,45,35,60,0.6,かぜのり,すりぬけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%8E%E3%82%AF%E3%82%B5';
pokemon[755] = 'アノホラグサ,くさ,ゴースト,55,115,70,80,70,90,6.0,かぜのり,すりぬけ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%8E%E3%83%9B%E3%83%A9%E3%82%B0%E3%82%B5';
pokemon[756] = 'ノノクラゲ,じめん,くさ,40,40,35,50,100,70,33.0,きんしのちから,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8E%E3%83%8E%E3%82%AF%E3%83%A9%E3%82%B2';
pokemon[757] = 'リククラゲ,じめん,くさ,80,70,65,80,120,100,58.0,きんしのちから,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%82%AF%E3%82%AF%E3%83%A9%E3%82%B2';
pokemon[758] = 'ガケガニ,いわ,,70,100,115,35,55,75,79.0,いかりのこうら,シェルアーマー,さいせいりょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%82%B1%E3%82%AC%E3%83%8B';
pokemon[759] = 'カプサイジ,くさ,,50,62,40,62,40,50,3.0,ようりょくそ,ふみん,ぶきよう,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%97%E3%82%B5%E3%82%A4%E3%82%B8';
pokemon[760] = 'スコヴィラン,くさ,ほのお,65,108,65,108,65,75,15.0,ようりょくそ,ふみん,ムラっけ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%82%B3%E3%83%B4%E3%82%A3%E3%83%A9%E3%83%B3';
pokemon[761] = 'シガロコ,むし,,41,50,60,31,58,30,1.0,ふくがん,だっぴ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%82%AC%E3%83%AD%E3%82%B3';
pokemon[762] = 'ベラカス,むし,エスパー,75,50,85,115,100,45,3.5,シンクロ,テレパシー,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%99%E3%83%A9%E3%82%AB%E3%82%B9';
pokemon[763] = 'ヒラヒナ,エスパー,,30,35,30,55,30,75,1.5,きけんよち,おみとおし,かそく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%92%E3%83%A9%E3%83%92%E3%83%8A';
pokemon[764] = 'クエスパトラ,エスパー,,95,60,60,101,60,105,90.0,びんじょう,おみとおし,かそく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AF%E3%82%A8%E3%82%B9%E3%83%91%E3%83%88%E3%83%A9';
pokemon[765] = 'カヌチャン,フェアリー,はがね,50,45,45,35,64,58,8.9,かたやぶり,マイペース,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%8C%E3%83%81%E3%83%A3%E3%83%B3';
pokemon[766] = 'ナカヌチャン,フェアリー,はがね,65,55,55,45,82,78,59.1,かたやぶり,マイペース,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%8C%E3%83%81%E3%83%A3%E3%83%B3';
pokemon[767] = 'デカヌチャン,フェアリー,はがね,85,75,77,70,105,94,112.8,かたやぶり,マイペース,わるいてぐせ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%8C%E3%83%81%E3%83%A3%E3%83%B3';
pokemon[768] = 'ウミディグダ,みず,,10,55,25,35,25,95,1.8,ぬめぬめ,びびり,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%82%B0%E3%83%80';
pokemon[769] = 'ウミトリオ,みず,,35,100,50,50,70,120,5.4,ぬめぬめ,びびり,すながくれ,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%9F%E3%83%88%E3%83%AA%E3%82%AA';
pokemon[770] = 'オトシドリ,ひこう,あく,70,103,85,60,85,82,42.9,はとむね,するどいめ,いわはこび,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%88%E3%82%B7%E3%83%89%E3%83%AA';
pokemon[771] = 'ナミイルカ,みず,,70,45,40,45,40,75,60.2,みずのベール,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8A%E3%83%9F%E3%82%A4%E3%83%AB%E3%82%AB';
pokemon[772] = 'イルカマン(ナイーブ),みず,,100,70,72,53,62,100,60.2,マイティチェンジ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%AB%E3%82%AB%E3%83%9E%E3%83%B3';
pokemon[773] = 'イルカマン(マイティ),みず,,100,70,72,53,62,100,60.2,マイティチェンジ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%AB%E3%82%AB%E3%83%9E%E3%83%B3';
pokemon[774] = 'ブロロン,はがね,どく,45,70,63,30,45,47,35.0,ぼうじん,スロースタート,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AD%E3%83%AD%E3%83%B3';
pokemon[775] = 'ブロロローム,はがね,どく,80,119,90,54,67,90,120.0,ぼうじん,フィルター,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AD%E3%83%AD%E3%83%AD%E3%83%BC%E3%83%A0';
pokemon[776] = 'モトトカゲ,ドラゴン,ノーマル,70,95,65,85,65,121,63.0,だっぴ,さいせいりょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%88%E3%83%88%E3%82%AB%E3%82%B2';
pokemon[777] = 'ミミズズ,はがね,,70,85,145,60,55,65,310.0,どしょく,すながくれ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%9F%E3%82%BA%E3%82%BA';
pokemon[778] = 'キラーメ,いわ,どく,48,35,42,105,60,60,8.0,どくげしょう,ふしょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A9%E3%83%BC%E3%83%A1';
pokemon[779] = 'キラフロル,いわ,どく,83,55,90,130,81,86,45.0,どくげしょう,ふしょく,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%A9%E3%83%95%E3%83%AD%E3%83%AB';
pokemon[780] = 'ボチ,ゴースト,,50,61,60,30,55,34,35.0,ものひろい,もふもふ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9C%E3%83%81';
pokemon[781] = 'ハカドッグ,ゴースト,,72,101,100,50,97,68,15.0,すなかき,もふもふ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%82%AB%E3%83%89%E3%83%83%E3%82%B0';
pokemon[782] = 'カラミンゴ,ひこう,かくとう,82,115,74,75,64,90,37.0,きもったま,ちどりあし,きょうえん,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B4';
pokemon[783] = 'アルクジラ,こおり,,108,68,45,30,40,43,45.0,あついしぼう,ゆきがくれ,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%AB%E3%82%AF%E3%82%B8%E3%83%A9';
pokemon[784] = 'ハルクジラ,こおり,,170,113,65,45,55,73,700.0,あついしぼう,ゆきかき,ちからずく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%AB%E3%82%AF%E3%82%B8%E3%83%A9';
pokemon[785] = 'ミガルーサ,みず,エスパー,90,102,73,78,65,70,90.0,かたやぶり,きれあじ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%82%AC%E3%83%AB%E3%83%BC%E3%82%B5';
pokemon[786] = 'ヘイラッシャ,みず,,150,100,115,65,65,35,220.0,てんねん,どんかん,みずのベール,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%98%E3%82%A4%E3%83%A9%E3%83%83%E3%82%B7%E3%83%A3';
pokemon[787] = 'シャリタツ(そった),ドラゴン,みず,68,50,60,120,95,82,8.0,しれいとう,よびみず,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%A3%E3%83%AA%E3%82%BF%E3%83%84';
pokemon[788] = 'シャリタツ(たれた),ドラゴン,みず,68,50,60,120,95,82,8.0,しれいとう,よびみず,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%A3%E3%83%AA%E3%82%BF%E3%83%84';
pokemon[789] = 'シャリタツ(のびた),ドラゴン,みず,68,50,60,120,95,82,8.0,しれいとう,よびみず,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B7%E3%83%A3%E3%83%AA%E3%82%BF%E3%83%84';
pokemon[790] = 'コノヨザル,かくとう,ゴースト,110,115,80,50,90,90,56.0,やるき,せいしんりょく,まけんき,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%8E%E3%83%A8%E3%82%B6%E3%83%AB';
pokemon[791] = 'ドオー,どく,じめん,130,75,60,45,100,20,223.0,どくのトゲ,ちょすい,てんねん,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%82%AA%E3%83%BC';
pokemon[792] = 'リキキリン,ノーマル,エスパー,120,90,70,110,70,60,160.0,はんすう,テイルアーマー,そうしょく,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%AA%E3%82%AD%E3%82%AD%E3%83%AA%E3%83%B3';
pokemon[793] = 'ノココッチ,ノーマル,,125,100,80,85,75,55,39.2,てんのめぐみ,にげあし,びびり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8E%E3%82%B3%E3%82%B3%E3%83%83%E3%83%81';
pokemon[794] = 'ドドゲザン,あく,はがね,100,135,120,60,85,50,120.0,まけんき,そうだいしょう,プレッシャー,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%89%E3%83%89%E3%82%B2%E3%82%B6%E3%83%B3';
pokemon[795] = 'イダイナキバ,じめん,かくとう,115,131,131,53,53,87,320.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%80%E3%82%A4%E3%83%8A%E3%82%AD%E3%83%90';
pokemon[796] = 'サケブシッポ,フェアリー,エスパー,115,65,99,65,115,111,8.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%82%B1%E3%83%96%E3%82%B7%E3%83%83%E3%83%9D';
pokemon[797] = 'アラブルタケ,くさ,あく,111,127,99,79,99,55,21.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A2%E3%83%A9%E3%83%96%E3%83%AB%E3%82%BF%E3%82%B1';
pokemon[798] = 'ハバタクカミ,ゴースト,フェアリー,55,55,55,135,135,135,4.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%8F%E3%83%90%E3%82%BF%E3%82%AF%E3%82%AB%E3%83%9F';
pokemon[799] = 'チヲハウハネ,むし,かくとう,85,135,79,85,105,81,92.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%B2%E3%83%8F%E3%82%A6%E3%83%8F%E3%83%8D';
pokemon[800] = 'スナノケガワ,でんき,じめん,85,81,97,121,85,101,60.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B9%E3%83%8A%E3%83%8E%E3%82%B1%E3%82%AC%E3%83%AF';
pokemon[801] = 'テツノワダチ,じめん,はがね,90,112,120,72,70,106,240.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%83%AF%E3%83%80%E3%83%81';
pokemon[802] = 'テツノツツミ,こおり,みず,56,80,114,124,60,136,11.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%83%84%E3%83%84%E3%83%9F';
pokemon[803] = 'テツノカイナ,かくとう,でんき,154,140,108,50,68,50,380.7,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%AB%E3%82%A4%E3%83%8A';
pokemon[804] = 'テツノコウベ,あく,ひこう,94,80,86,122,80,108,111.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%B3%E3%82%A6%E3%83%99';
pokemon[805] = 'テツノドクガ,ほのお,どく,80,70,60,140,110,110,36.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%83%89%E3%82%AF%E3%82%AC';
pokemon[806] = 'テツノイバラ,いわ,でんき,100,134,110,70,84,72,303.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%A4%E3%83%90%E3%83%A9';
pokemon[807] = 'セビエ,ドラゴン,こおり,65,75,45,35,45,55,17.0,ねつこうかん,アイスボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BB%E3%83%93%E3%82%A8';
pokemon[808] = 'セゴール,ドラゴン,こおり,90,95,66,45,65,62,30.0,ねつこうかん,アイスボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BB%E3%82%B4%E3%83%BC%E3%83%AB';
pokemon[809] = 'セグレイブ,ドラゴン,こおり,115,145,92,75,86,87,210.0,ねつこうかん,アイスボディ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BB%E3%82%B0%E3%83%AC%E3%82%A4%E3%83%96';
pokemon[810] = 'コレクレー(はこフォルム),ゴースト,,45,30,70,75,70,10,5.0,びびり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%AC%E3%82%AF%E3%83%AC%E3%83%BC';
pokemon[811] = 'コレクレー(とほフォルム),ゴースト,,45,30,25,75,45,80,0.1,にげあし,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%AC%E3%82%AF%E3%83%AC%E3%83%BC';
pokemon[812] = 'サーフゴー,はがね,ゴースト,87,60,95,133,91,84,30.0,おうごんのからだ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B5%E3%83%BC%E3%83%95%E3%82%B4%E3%83%BC';
pokemon[813] = 'チオンジェン,あく,くさ,85,85,100,95,135,70,74.2,わざわいのおふだ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%82%AA%E3%83%B3%E3%82%B8%E3%82%A7%E3%83%B3';
pokemon[814] = 'パオジアン,あく,こおり,80,120,80,90,65,135,152.2,わざわいのつるぎ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%91%E3%82%AA%E3%82%B8%E3%82%A2%E3%83%B3';
pokemon[815] = 'ディンルー,あく,じめん,155,110,125,55,80,45,699.7,わざわいのうつわ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%87%E3%82%A3%E3%83%B3%E3%83%AB%E3%83%BC';
pokemon[816] = 'イーユイ,あく,ほのお,55,80,80,135,120,100,4.9,わざわいのたま,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%83%BC%E3%83%A6%E3%82%A4';
pokemon[817] = 'トドロクツキ,ドラゴン,あく,105,139,71,55,101,119,380.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%88%E3%83%89%E3%83%AD%E3%82%AF%E3%83%84%E3%82%AD';
pokemon[818] = 'テツノブジン,フェアリー,かくとう,74,130,90,120,60,116,35.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%83%96%E3%82%B8%E3%83%B3';
pokemon[819] = 'コライドン,かくとう,ドラゴン,100,135,115,85,100,135,303.0,ひひいろのこどう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%B3%E3%83%A9%E3%82%A4%E3%83%89%E3%83%B3';
pokemon[820] = 'ミライドン,でんき,ドラゴン,100,85,100,135,115,135,240.0,ハドロンエンジン,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9F%E3%83%A9%E3%82%A4%E3%83%89%E3%83%B3';
pokemon[821] = 'ウネルミナモ,みず,ドラゴン,99,83,91,125,83,109,280.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%83%8D%E3%83%AB%E3%83%9F%E3%83%8A%E3%83%A2';
pokemon[822] = 'テツノイサハ,くさ,エスパー,90,130,88,70,108,104,125.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%A4%E3%82%B5%E3%83%8F';
pokemon[823] = 'カミッチュ,くさ,ドラゴン,80,80,110,95,80,40,4.4,かんろなミツ,くいしんぼう,ねんちゃく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%9F%E3%83%83%E3%83%81%E3%83%A5';
pokemon[824] = 'チャデス(マガイモノのすがた),くさ,ゴースト,40,45,45,74,54,50,1.1,おもてなし,たいねつ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A3%E3%83%87%E3%82%B9';
pokemon[825] = 'チャデス(タカイモノのすがた),くさ,ゴースト,40,45,45,74,54,50,1.1,おもてなし,たいねつ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%81%E3%83%A3%E3%83%87%E3%82%B9';
pokemon[826] = 'ヤバソチャ(ボンサクのすがた),くさ,ゴースト,71,60,106,121,80,70,2.2,おもてなし,たいねつ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%90%E3%82%BD%E3%83%81%E3%83%A3';
pokemon[827] = 'ヤバソチャ(ケッサクのすがた),くさ,ゴースト,71,60,106,121,80,70,2.2,おもてなし,たいねつ,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A4%E3%83%90%E3%82%BD%E3%83%81%E3%83%A3';
pokemon[828] = 'イイネイヌ,どく,かくとう,88,128,115,58,86,80,92.2,どくのくさり,ばんけん,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A4%E3%82%A4%E3%83%8D%E3%82%A4%E3%83%8C';
pokemon[829] = 'マシマシラ,どく,エスパー,88,75,66,130,90,106,12.2,どくのくさり,おみとおし,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%9E%E3%82%B7%E3%83%9E%E3%82%B7%E3%83%A9';
pokemon[830] = 'キチキギス,どく,フェアリー,88,91,82,70,125,99,30.1,どくのくさり,テクニシャン,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AD%E3%83%81%E3%82%AD%E3%82%AE%E3%82%B9';
pokemon[831] = 'オーガポン,くさ,,80,120,84,60,96,110,39.8,まけんき,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%82%AC%E3%83%9D%E3%83%B3';
pokemon[832] = 'オーガポン(かまどのめん),くさ,ほのお,80,120,84,60,96,110,39.8,かたやぶり,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%82%AC%E3%83%9D%E3%83%B3';
pokemon[833] = 'オーガポン(いどのめん),くさ,みず,80,120,84,60,96,110,39.8,ちょすい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%82%AC%E3%83%9D%E3%83%B3';
pokemon[834] = 'オーガポン(いしずえのめん),くさ,いわ,80,120,84,60,96,110,39.8,がんじょう,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AA%E3%83%BC%E3%82%AC%E3%83%9D%E3%83%B3';
pokemon[835] = 'ブリジュラス,はがね,ドラゴン,90,105,130,125,65,85,60.0,じきゅうりょく,がんじょう,すじがねいり,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%96%E3%83%AA%E3%82%B8%E3%83%A5%E3%83%A9%E3%82%B9';
pokemon[836] = 'カミツオロチ,くさ,ドラゴン,106,80,110,120,80,44,93.0,かんろなミツ,さいせいりょく,ねんちゃく,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AB%E3%83%9F%E3%83%84%E3%82%AA%E3%83%AD%E3%83%81';
pokemon[837] = 'ウガツホムラ,ほのお,ドラゴン,105,115,121,65,93,91,590.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%A6%E3%82%AC%E3%83%84%E3%83%9B%E3%83%A0%E3%83%A9';
pokemon[838] = 'タケルライコ,でんき,ドラゴン,125,73,91,137,89,75,480.0,こだいかっせい,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%BF%E3%82%B1%E3%83%AB%E3%83%A9%E3%82%A4%E3%82%B3';
pokemon[839] = 'テツノイワオ,いわ,エスパー,90,120,80,68,108,124,162.5,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%A4%E3%83%AF%E3%82%AA';
pokemon[840] = 'テツノカシラ,はがね,エスパー,90,72,100,122,108,98,156.0,クォークチャージ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%84%E3%83%8E%E3%82%AB%E3%82%B7%E3%83%A9';
pokemon[841] = 'ガチグマ(アカツキ),じめん,ノーマル,113,70,120,135,65,52,333.0,しんがん,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%82%AC%E3%83%81%E3%82%B0%E3%83%9E';
pokemon[842] = 'テラパゴス(ノーマルフォルム),ノーマル,,90,65,85,65,85,60,6.5,テラスチェンジ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%A9%E3%83%91%E3%82%B4%E3%82%B9';
pokemon[843] = 'テラパゴス(テラスタルフォルム),ノーマル,,90,65,85,65,85,60,6.5,テラスチェンジ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%A9%E3%83%91%E3%82%B4%E3%82%B9';
pokemon[844] = 'テラパゴス(ステラフォルム),ノーマル,,90,65,85,65,85,60,6.5,テラスチェンジ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%86%E3%83%A9%E3%83%91%E3%82%B4%E3%82%B9';
pokemon[845] = 'モモワロウ,どく,ゴースト,88,88,160,88,88,88,0.3,どくくぐつ,,,https://wiki.xn--rckteqa2e.com/wiki/%E3%83%A2%E3%83%A2%E3%83%AF%E3%83%AD%E3%82%A6';

var ary;
var re;
var l=pokemon.length;
var x1;
var x2;
var x3;

function Lupdate(){
	v_level = Number(document.getElementById('level').value);
		
	v_s_h = Number(document.getElementById('s_h').value);
	v_k_h = Number(document.getElementById('k_h').value);
	v_d_h = Number(document.getElementById('d_h').value);
	z_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
		
	v_s_a = Number(document.getElementById('s_a').value);
	v_k_a = Number(document.getElementById('k_a').value);
	v_d_a = Number(document.getElementById('d_a').value);
	v_a_ch = Number(document.getElementById('a_ch').value);
	z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		
	v_s_b = Number(document.getElementById('s_b').value);
	v_k_b = Number(document.getElementById('k_b').value);
	v_d_b = Number(document.getElementById('d_b').value);
	v_b_ch = Number(document.getElementById('b_ch').value);
	z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		
	v_s_c = Number(document.getElementById('s_c').value);
	v_k_c = Number(document.getElementById('k_c').value);
	v_d_c = Number(document.getElementById('d_c').value);
	v_c_ch = Number(document.getElementById('c_ch').value);
	z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		
	v_s_d = Number(document.getElementById('s_d').value);
	v_k_d = Number(document.getElementById('k_d').value);
	v_d_d = Number(document.getElementById('d_d').value);
	v_d_ch = Number(document.getElementById('d_ch').value);
	z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		
	v_s_s = Number(document.getElementById('s_s').value);
	v_k_s = Number(document.getElementById('k_s').value);
	v_d_s = Number(document.getElementById('d_s').value);
	v_s_ch = Number(document.getElementById('s_ch').value);
	z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
}

function sLupdate(){
	v_level = Number(document.getElementById('slevel').value);
		
	v_s_h = Number(document.getElementById('ss_h').value);
	v_k_h = Number(document.getElementById('sk_h').value);
	v_d_h = Number(document.getElementById('sd_h').value);
	sz_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
		
	v_s_a = Number(document.getElementById('ss_a').value);
	v_k_a = Number(document.getElementById('sk_a').value);
	v_d_a = Number(document.getElementById('sd_a').value);
	v_a_ch = Number(document.getElementById('sa_ch').value);
	sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		
	v_s_b = Number(document.getElementById('ss_b').value);
	v_k_b = Number(document.getElementById('sk_b').value);
	v_d_b = Number(document.getElementById('sd_b').value);
	v_b_ch = Number(document.getElementById('sb_ch').value);
	sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		
	v_s_c = Number(document.getElementById('ss_c').value);
	v_k_c = Number(document.getElementById('sk_c').value);
	v_d_c = Number(document.getElementById('sd_c').value);
	v_c_ch = Number(document.getElementById('sc_ch').value);
	sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		
	v_s_d = Number(document.getElementById('ss_d').value);
	v_k_d = Number(document.getElementById('sk_d').value);
	v_d_d = Number(document.getElementById('sd_d').value);
	v_d_ch = Number(document.getElementById('sd_ch').value);
	sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		
	v_s_s = Number(document.getElementById('ss_s').value);
	v_k_s = Number(document.getElementById('sk_s').value);
	v_d_s = Number(document.getElementById('sd_s').value);
	v_s_ch = Number(document.getElementById('ss_ch').value);
	sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
}

function Supdate(x){
	v_level = Number(document.getElementById('level').value);
	v_s_h = Number(document.getElementById('s_h').value);
	v_s_a = Number(document.getElementById('s_a').value);
	v_s_b = Number(document.getElementById('s_b').value);
	v_s_c = Number(document.getElementById('s_c').value);
	v_s_d = Number(document.getElementById('s_d').value);
	v_s_s = Number(document.getElementById('s_s').value);
	s_sum.innerHTML = v_s_h + v_s_a + v_s_b + v_s_c + v_s_d + v_s_s;
	
	if(x=="h"){
		x1 = Number(document.getElementById('k_h').value);
		x2 = Number(document.getElementById('d_h').value);
		z_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + x1 + Math.floor(x2 / 4) ) * v_level / 100);
	}else if(x=="a"){
		x1 = Number(document.getElementById('k_a').value);
		x2 = Number(document.getElementById('d_a').value);
		x3 = Number(document.getElementById('a_ch').value);
		z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="b"){
		x1 = Number(document.getElementById('k_b').value);
		x2 = Number(document.getElementById('d_b').value);
		x3 = Number(document.getElementById('b_ch').value);
		z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="c"){
		x1 = Number(document.getElementById('k_c').value);
		x2 = Number(document.getElementById('d_c').value);
		x3 = Number(document.getElementById('c_ch').value);
		z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="d"){
		x1 = Number(document.getElementById('k_d').value);
		x2 = Number(document.getElementById('d_d').value);
		x3 = Number(document.getElementById('d_ch').value);
		z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="s"){
		x1 = Number(document.getElementById('k_s').value);
		x2 = Number(document.getElementById('d_s').value);
		x3 = Number(document.getElementById('s_ch').value);
		z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}
}

function sSupdate(x){
	v_level = Number(document.getElementById('slevel').value);
	v_s_h = Number(document.getElementById('ss_h').value);
	v_s_a = Number(document.getElementById('ss_a').value);
	v_s_b = Number(document.getElementById('ss_b').value);
	v_s_c = Number(document.getElementById('ss_c').value);
	v_s_d = Number(document.getElementById('ss_d').value);
	v_s_s = Number(document.getElementById('ss_s').value);
	ss_sum.innerHTML = v_s_h + v_s_a + v_s_b + v_s_c + v_s_d + v_s_s;
	
	if(x=="h"){
		x1 = Number(document.getElementById('sk_h').value);
		x2 = Number(document.getElementById('sd_h').value);
		sz_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + x1 + Math.floor(x2 / 4) ) * v_level / 100);
	}else if(x=="a"){
		x1 = Number(document.getElementById('sk_a').value);
		x2 = Number(document.getElementById('sd_a').value);
		x3 = Number(document.getElementById('sa_ch').value);
		sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="b"){
		x1 = Number(document.getElementById('sk_b').value);
		x2 = Number(document.getElementById('sd_b').value);
		x3 = Number(document.getElementById('sb_ch').value);
		sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="c"){
		x1 = Number(document.getElementById('sk_c').value);
		x2 = Number(document.getElementById('sd_c').value);
		x3 = Number(document.getElementById('sc_ch').value);
		sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="d"){
		x1 = Number(document.getElementById('sk_d').value);
		x2 = Number(document.getElementById('sd_d').value);
		x3 = Number(document.getElementById('sd_ch').value);
		sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}else if(x=="s"){
		x1 = Number(document.getElementById('sk_s').value);
		x2 = Number(document.getElementById('sd_s').value);
		x3 = Number(document.getElementById('ss_ch').value);
		sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + x1 + Math.floor(x2 / 4)) * v_level / 100)) * x3);
	}
}

function Kupdate(x){
	v_level = Number(document.getElementById('level').value);
	if(x=="h"){
		v_s_h = Number(document.getElementById('s_h').value);
		v_k_h = Number(document.getElementById('k_h').value);
		v_d_h = Number(document.getElementById('d_h').value);
		z_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
	}else if(x=="a"){
		v_s_a = Number(document.getElementById('s_a').value);
		v_k_a = Number(document.getElementById('k_a').value);
		v_d_a = Number(document.getElementById('d_a').value);
		v_a_ch = Number(document.getElementById('a_ch').value);
		z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
	}else if(x=="b"){
		v_s_b = Number(document.getElementById('s_b').value);
		v_k_b = Number(document.getElementById('k_b').value);
		v_d_b = Number(document.getElementById('d_b').value);
		v_b_ch = Number(document.getElementById('b_ch').value);
		z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
	}else if(x=="c"){
		v_s_c = Number(document.getElementById('s_c').value);
		v_k_c = Number(document.getElementById('k_c').value);
		v_d_c = Number(document.getElementById('d_c').value);
		v_c_ch = Number(document.getElementById('c_ch').value);
		z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
	}else if(x=="d"){
		v_s_d = Number(document.getElementById('s_d').value);
		v_k_d = Number(document.getElementById('k_d').value);
		v_d_d = Number(document.getElementById('d_d').value);
		v_d_ch = Number(document.getElementById('d_ch').value);
		z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
	}else if(x=="s"){
		v_s_s = Number(document.getElementById('s_s').value);
		v_k_s = Number(document.getElementById('k_s').value);
		v_d_s = Number(document.getElementById('d_s').value);
		v_s_ch = Number(document.getElementById('s_ch').value);
		z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
	}
}

function sKupdate(x){
	v_level = Number(document.getElementById('slevel').value);
	if(x=="h"){
		v_s_h = Number(document.getElementById('ss_h').value);
		v_k_h = Number(document.getElementById('sk_h').value);
		v_d_h = Number(document.getElementById('sd_h').value);
		sz_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
	}else if(x=="a"){
		v_s_a = Number(document.getElementById('ss_a').value);
		v_k_a = Number(document.getElementById('sk_a').value);
		v_d_a = Number(document.getElementById('sd_a').value);
		v_a_ch = Number(document.getElementById('sa_ch').value);
		sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
	}else if(x=="b"){
		v_s_b = Number(document.getElementById('ss_b').value);
		v_k_b = Number(document.getElementById('sk_b').value);
		v_d_b = Number(document.getElementById('sd_b').value);
		v_b_ch = Number(document.getElementById('sb_ch').value);
		sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
	}else if(x=="c"){
		v_s_c = Number(document.getElementById('ss_c').value);
		v_k_c = Number(document.getElementById('sk_c').value);
		v_d_c = Number(document.getElementById('sd_c').value);
		v_c_ch = Number(document.getElementById('sc_ch').value);
		sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
	}else if(x=="d"){
		v_s_d = Number(document.getElementById('ss_d').value);
		v_k_d = Number(document.getElementById('sk_d').value);
		v_d_d = Number(document.getElementById('sd_d').value);
		v_d_ch = Number(document.getElementById('sd_ch').value);
		sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
	}else if(x=="s"){
		v_s_s = Number(document.getElementById('ss_s').value);
		v_k_s = Number(document.getElementById('sk_s').value);
		v_d_s = Number(document.getElementById('sd_s').value);
		v_s_ch = Number(document.getElementById('ss_ch').value);
		sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
	}
}

function Dupdate(x){
	v_level = Number(document.getElementById('level').value);
	v_d_h = Number(document.getElementById('d_h').value);
	v_d_a = Number(document.getElementById('d_a').value);
	v_d_b = Number(document.getElementById('d_b').value);
	v_d_c = Number(document.getElementById('d_c').value);
	v_d_d = Number(document.getElementById('d_d').value);
	v_d_s = Number(document.getElementById('d_s').value);
	d_sum = v_d_h + v_d_a + v_d_b + v_d_c + v_d_d + v_d_s;
	
	if(x=="h"){
		if(d_sum > 508){
			v_d_h = 508 - d_sum + v_d_h;
			d_h.value = v_d_h;
		}
		v_s_h = Number(document.getElementById('s_h').value);
		v_k_h = Number(document.getElementById('k_h').value);
		z_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
	}else if(x=="a"){
		if(d_sum > 508){
			v_d_a = 508 - d_sum + v_d_a;
			d_a.value = v_d_a;
		}
		v_s_a = Number(document.getElementById('s_a').value);
		v_k_a = Number(document.getElementById('k_a').value);
		v_a_ch = Number(document.getElementById('a_ch').value);
		z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
	}else if(x=="b"){
		if(d_sum > 508){
			v_d_b = 508 - d_sum + v_d_b;
			d_b.value = v_d_b;
		}
		v_s_b = Number(document.getElementById('s_b').value);
		v_k_b = Number(document.getElementById('k_b').value);
		v_b_ch = Number(document.getElementById('b_ch').value);
		z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
	}else if(x=="c"){
		if(d_sum > 508){
			v_d_c = 508 - d_sum + v_d_c;
			d_c.value = v_d_c;
		}
		v_s_c = Number(document.getElementById('s_c').value);
		v_k_c = Number(document.getElementById('k_c').value);
		v_c_ch = Number(document.getElementById('c_ch').value);
		z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
	}else if(x=="d"){
		if(d_sum > 508){
			v_d_d = 508 - d_sum + v_d_d;
			d_d.value = v_d_d;
		}
		v_s_d = Number(document.getElementById('s_d').value);
		v_k_d = Number(document.getElementById('k_d').value);
		v_d_ch = Number(document.getElementById('d_ch').value);
		z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
	}else if(x=="s"){
		if(d_sum > 508){
			v_d_s = 508 - d_sum + v_d_s;
			d_s.value = v_d_s;
		}
		v_s_s = Number(document.getElementById('s_s').value);
		v_k_s = Number(document.getElementById('k_s').value);
		v_s_ch = Number(document.getElementById('s_ch').value);
		z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
	}

	d_sum2.innerHTML = v_d_h + v_d_a + v_d_b + v_d_c + v_d_d + v_d_s;
}

function sDupdate(x){
	v_level = Number(document.getElementById('slevel').value);
	v_d_h = Number(document.getElementById('sd_h').value);
	v_d_a = Number(document.getElementById('sd_a').value);
	v_d_b = Number(document.getElementById('sd_b').value);
	v_d_c = Number(document.getElementById('sd_c').value);
	v_d_d = Number(document.getElementById('sd_d').value);
	v_d_s = Number(document.getElementById('sd_s').value);
	d_sum = v_d_h + v_d_a + v_d_b + v_d_c + v_d_d + v_d_s;
	
	if(x=="h"){
		if(d_sum > 508){
			v_d_h = 508 - d_sum + v_d_h;
			sd_h.value = v_d_h;
		}
		v_s_h = Number(document.getElementById('ss_h').value);
		v_k_h = Number(document.getElementById('sk_h').value);
		sz_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
	}else if(x=="a"){
		if(d_sum > 508){
			v_d_a = 508 - d_sum + v_d_a;
			sd_a.value = v_d_a;
		}
		v_s_a = Number(document.getElementById('ss_a').value);
		v_k_a = Number(document.getElementById('sk_a').value);
		v_a_ch = Number(document.getElementById('sa_ch').value);
		sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
	}else if(x=="b"){
		if(d_sum > 508){
			v_d_b = 508 - d_sum + v_d_b;
			sd_b.value = v_d_b;
		}
		v_s_b = Number(document.getElementById('ss_b').value);
		v_k_b = Number(document.getElementById('sk_b').value);
		v_b_ch = Number(document.getElementById('sb_ch').value);
		sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
	}else if(x=="c"){
		if(d_sum > 508){
			v_d_c = 508 - d_sum + v_d_c;
			sd_c.value = v_d_c;
		}
		v_s_c = Number(document.getElementById('ss_c').value);
		v_k_c = Number(document.getElementById('sk_c').value);
		v_c_ch = Number(document.getElementById('sc_ch').value);
		sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
	}else if(x=="d"){
		if(d_sum > 508){
			v_d_d = 508 - d_sum + v_d_d;
			sd_d.value = v_d_d;
		}
		v_s_d = Number(document.getElementById('ss_d').value);
		v_k_d = Number(document.getElementById('sk_d').value);
		v_d_ch = Number(document.getElementById('sd_ch').value);
		sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
	}else if(x=="s"){
		if(d_sum > 508){
			v_d_s = 508 - d_sum + v_d_s;
			sd_s.value = v_d_s;
		}
		v_s_s = Number(document.getElementById('ss_s').value);
		v_k_s = Number(document.getElementById('sk_s').value);
		v_s_ch = Number(document.getElementById('ss_ch').value);
		sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
	}

	sd_sum2.innerHTML = v_d_h + v_d_a + v_d_b + v_d_c + v_d_d + v_d_s;
}

function CHupdate(x){
	v_level = Number(document.getElementById('level').value);
	v_a_ch = Number(document.getElementById('a_ch').value);
	v_b_ch = Number(document.getElementById('b_ch').value);
	v_c_ch = Number(document.getElementById('c_ch').value);
	v_d_ch = Number(document.getElementById('d_ch').value);
	v_s_ch = Number(document.getElementById('s_ch').value);
	
	if(x=="a"){
		v_s_a = Number(document.getElementById('s_a').value);
		v_k_a = Number(document.getElementById('k_a').value);
		v_d_a = Number(document.getElementById('d_a').value);
		z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		if(v_a_ch==1.1){
			if(v_b_ch==1.1){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_a_ch==0.9){
			if(v_b_ch==0.9){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
		}else if(x=="b"){
		v_s_b = Number(document.getElementById('s_b').value);
		v_k_b = Number(document.getElementById('k_b').value);
		v_d_b = Number(document.getElementById('d_b').value);
		z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		if(v_b_ch==1.1){
			if(v_a_ch==1.1){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_b_ch==0.9){
			if(v_a_ch==0.9){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="c"){
		v_s_c = Number(document.getElementById('s_c').value);
		v_k_c = Number(document.getElementById('k_c').value);
		v_d_c = Number(document.getElementById('d_c').value);
		z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		if(v_c_ch==1.1){
			if(v_b_ch==1.1){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_c_ch==0.9){
			if(v_b_ch==0.9){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="d"){
		v_s_d = Number(document.getElementById('s_d').value);
		v_k_d = Number(document.getElementById('k_d').value);
		v_d_d = Number(document.getElementById('d_d').value);
		z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		if(v_d_ch==1.1){
			if(v_b_ch==1.1){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_d_ch==0.9){
			if(v_b_ch==0.9){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				s_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('s_s').value);
				v_k_s = Number(document.getElementById('k_s').value);
				v_d_s = Number(document.getElementById('d_s').value);
				z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="s"){
		v_s_s = Number(document.getElementById('s_s').value);
		v_k_s = Number(document.getElementById('k_s').value);
		v_d_s = Number(document.getElementById('d_s').value);
		z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
		if(v_s_ch==1.1){
			if(v_b_ch==1.1){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}
		}else if(v_s_ch==0.9){
			if(v_b_ch==0.9){
				b_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('s_b').value);
				v_k_b = Number(document.getElementById('k_b').value);
				v_d_b = Number(document.getElementById('d_b').value);
				z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				c_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('s_c').value);
				v_k_c = Number(document.getElementById('k_c').value);
				v_d_c = Number(document.getElementById('d_c').value);
				z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				d_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('s_d').value);
				v_k_d = Number(document.getElementById('k_d').value);
				v_d_d = Number(document.getElementById('d_d').value);
				z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				a_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('s_a').value);
				v_k_a = Number(document.getElementById('k_a').value);
				v_d_a = Number(document.getElementById('d_a').value);
				z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}
		}
	}
}

function sCHupdate(x){
	v_level = Number(document.getElementById('slevel').value);
	v_a_ch = Number(document.getElementById('sa_ch').value);
	v_b_ch = Number(document.getElementById('sb_ch').value);
	v_c_ch = Number(document.getElementById('sc_ch').value);
	v_d_ch = Number(document.getElementById('sd_ch').value);
	v_s_ch = Number(document.getElementById('ss_ch').value);
	
	if(x=="a"){
		v_s_a = Number(document.getElementById('ss_a').value);
		v_k_a = Number(document.getElementById('sk_a').value);
		v_d_a = Number(document.getElementById('sd_a').value);
		sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		if(v_a_ch==1.1){
			if(v_b_ch==1.1){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_a_ch==0.9){
			if(v_b_ch==0.9){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="b"){
		v_s_b = Number(document.getElementById('ss_b').value);
		v_k_b = Number(document.getElementById('sk_b').value);
		v_d_b = Number(document.getElementById('sd_b').value);
		sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		if(v_b_ch==1.1){
			if(v_a_ch==1.1){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_b_ch==0.9){
			if(v_a_ch==0.9){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="c"){
		v_s_c = Number(document.getElementById('ss_c').value);
		v_k_c = Number(document.getElementById('sk_c').value);
		v_d_c = Number(document.getElementById('sd_c').value);
		sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		if(v_c_ch==1.1){
			if(v_b_ch==1.1){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_c_ch==0.9){
			if(v_b_ch==0.9){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="d"){
		v_s_d = Number(document.getElementById('ss_d').value);
		v_k_d = Number(document.getElementById('sk_d').value);
		v_d_d = Number(document.getElementById('sd_d').value);
		sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		if(v_d_ch==1.1){
			if(v_b_ch==1.1){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==1.1){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}else if(v_d_ch==0.9){
			if(v_b_ch==0.9){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}else if(v_s_ch==0.9){
				ss_ch.value=(1.0).toPrecision(2);
				v_s_s = Number(document.getElementById('ss_s').value);
				v_k_s = Number(document.getElementById('sk_s').value);
				v_d_s = Number(document.getElementById('sd_s').value);
				sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * 1);
			}
		}
	}else if(x=="s"){
		v_s_s = Number(document.getElementById('ss_s').value);
		v_k_s = Number(document.getElementById('sk_s').value);
		v_d_s = Number(document.getElementById('sd_s').value);
		sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
		if(v_s_ch==1.1){
			if(v_b_ch==1.1){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==1.1){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==1.1){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==1.1){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}
		}else if(v_s_ch==0.9){
			if(v_b_ch==0.9){
				sb_ch.value=(1.0).toPrecision(2);
				v_s_b = Number(document.getElementById('ss_b').value);
				v_k_b = Number(document.getElementById('sk_b').value);
				v_d_b = Number(document.getElementById('sd_b').value);
				sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * 1);
			}else if(v_c_ch==0.9){
				sc_ch.value=(1.0).toPrecision(2);
				v_s_c = Number(document.getElementById('ss_c').value);
				v_k_c = Number(document.getElementById('sk_c').value);
				v_d_c = Number(document.getElementById('sd_c').value);
				sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * 1);
			}else if(v_d_ch==0.9){
				sd_ch.value=(1.0).toPrecision(2);
				v_s_d = Number(document.getElementById('ss_d').value);
				v_k_d = Number(document.getElementById('sk_d').value);
				v_d_d = Number(document.getElementById('sd_d').value);
				sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * 1);
			}else if(v_a_ch==0.9){
				sa_ch.value=(1.0).toPrecision(2);
				v_s_a = Number(document.getElementById('ss_a').value);
				v_k_a = Number(document.getElementById('sk_a').value);
				v_d_a = Number(document.getElementById('sd_a').value);
				sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * 1);
			}
		}
	}
}

function AllPokemon(){
	re="";
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		re=re+'<option value="'+ary[0]+'"></option>';
		
	}
	codeType.innerHTML = re;

}

function sAllPokemon(){
	re="";
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		re=re+'<option value="'+ary[0]+'"></option>';
		
	}
	scodeType.innerHTML = re;

}

function kensaku(x){

	re="";
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(ary[0].indexOf(x) > -1){
			re=re+'<option value="'+ary[0]+'"></option>';
		}
		
	}
	codeType.innerHTML = re;

}

function skensaku(x){

	re="";
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(ary[0].indexOf(x) > -1){
			re=re+'<option value="'+ary[0]+'"></option>';
		}
		
	}
	scodeType.innerHTML = re;

}

function syuzoku(x){
	teratera()
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(ary[0]==x){
			s_h.value = ary[1+2];
			s_a.value = ary[2+2];
			s_b.value = ary[3+2];
			s_c.value = ary[4+2];
			s_d.value = ary[5+2];
			s_s.value = ary[6+2];
			s_sum.innerHTML = Number(ary[1+2]) + Number(ary[2+2]) + Number(ary[3+2]) + Number(ary[4+2]) + Number(ary[5+2]) + Number(ary[6+2]);
			
			k_h.value = 31;
			k_a.value = 31;
			k_b.value = 31;
			k_c.value = 31;
			k_d.value = 31;
			k_s.value = 31;
			
			d_h.value = 0;
			d_a.value = 0;
			d_b.value = 0;
			d_c.value = 0;
			d_d.value = 0;
			d_s.value = 0;
			d_sum2.innerHTML = 0;
			
			a_ch.value =(1.0).toPrecision(2);
			b_ch.value =(1.0).toPrecision(2);
			c_ch.value =(1.0).toPrecision(2);
			d_ch.value =(1.0).toPrecision(2);
			s_ch.value =(1.0).toPrecision(2);
			
			v_level = Number(level.value);
			
			z_h.value = 10 + v_level + Math.floor(( Number(ary[1+2]) * 2 + 31 + Math.floor(0 / 4) ) * v_level / 100);
			z_a.value = Math.floor((5 + Math.floor((Number(ary[2+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			z_b.value = Math.floor((5 + Math.floor((Number(ary[3+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			z_c.value = Math.floor((5 + Math.floor((Number(ary[4+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			z_d.value = Math.floor((5 + Math.floor((Number(ary[5+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			z_s.value = Math.floor((5 + Math.floor((Number(ary[6+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			
			newArr='<option value="'+ary[10]+'">'+ary[10]+'</option>';
			if(ary[11]!=""){
				newArr=newArr+'<option value="'+ary[11]+'">'+ary[11]+'</option>';
			}
			if(ary[12]!=""){
				newArr=newArr+'<option value="'+ary[12]+'">'+ary[12]+'</option>';
			}
			tokusei.innerHTML=newArr;
			
			pokelink.innerHTML = '<font size="-2"><a href="'+ary[13]+'" target="_blank" rel="noopener noreferrer">'+ary[13]+'</a></font>';
			newArr=ary[1];
			if(ary[2]!=""){
				newArr=newArr+","+ary[2];
			}
			poketype.innerHTML=newArr
		}
		
	}
	setTokusei()
	dame()
}

function ssyuzoku(x){
	steratera()
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(ary[0]==x){
			ss_h.value = ary[1+2];
			ss_a.value = ary[2+2];
			ss_b.value = ary[3+2];
			ss_c.value = ary[4+2];
			ss_d.value = ary[5+2];
			ss_s.value = ary[6+2];
			ss_sum.innerHTML = Number(ary[1+2]) + Number(ary[2+2]) + Number(ary[3+2]) + Number(ary[4+2]) + Number(ary[5+2]) + Number(ary[6+2]);
			
			sk_h.value = 31;
			sk_a.value = 31;
			sk_b.value = 31;
			sk_c.value = 31;
			sk_d.value = 31;
			sk_s.value = 31;
			
			sd_h.value = 0;
			sd_a.value = 0;
			sd_b.value = 0;
			sd_c.value = 0;
			sd_d.value = 0;
			sd_s.value = 0;
			sd_sum2.innerHTML = 0;
			
			sa_ch.value =(1.0).toPrecision(2);
			sb_ch.value =(1.0).toPrecision(2);
			sc_ch.value =(1.0).toPrecision(2);
			sd_ch.value =(1.0).toPrecision(2);
			ss_ch.value =(1.0).toPrecision(2);
			
			v_level = Number(slevel.value);
			
			sz_h.value = 10 + v_level + Math.floor(( Number(ary[1+2]) * 2 + 31 + Math.floor(0 / 4) ) * v_level / 100);
			sz_a.value = Math.floor((5 + Math.floor((Number(ary[2+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			sz_b.value = Math.floor((5 + Math.floor((Number(ary[3+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			sz_c.value = Math.floor((5 + Math.floor((Number(ary[4+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			sz_d.value = Math.floor((5 + Math.floor((Number(ary[5+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			sz_s.value = Math.floor((5 + Math.floor((Number(ary[6+2]) * 2 + 31 + Math.floor(0 / 4)) * v_level / 100)) * 1);
			
			newArr='<option value="'+ary[10]+'">'+ary[10]+'</option>';
			if(ary[11]!=""){
				newArr=newArr+'<option value="'+ary[11]+'">'+ary[11]+'</option>';
			}
			if(ary[12]!=""){
				newArr=newArr+'<option value="'+ary[12]+'">'+ary[12]+'</option>';
			}
			stokusei.innerHTML=newArr;
			
			spokelink.innerHTML = '<font size="-2"><a href="'+ary[13]+'" target="_blank" rel="noopener noreferrer">'+ary[13]+'</a></font>';
			newArr=ary[1];
			if(ary[2]!=""){
				newArr=newArr+","+ary[2];
			}
			spoketype.innerHTML=newArr
		}
		
	}
	ssetTokusei()
	dame()
}

function resetButton() {
	
	v_level = Number(document.getElementById('level').value);
		
	v_s_h = Number(document.getElementById('s_h').value);
	v_k_h = Number(document.getElementById('k_h').value);
	v_d_h = 0;
	z_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
		
	v_s_a = Number(document.getElementById('s_a').value);
	v_k_a = Number(document.getElementById('k_a').value);
	v_d_a = 0;
	v_a_ch = 1.0;
	z_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		
	v_s_b = Number(document.getElementById('s_b').value);
	v_k_b = Number(document.getElementById('k_b').value);
	v_d_b = 0;
	v_b_ch = 1.0;
	z_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		
	v_s_c = Number(document.getElementById('s_c').value);
	v_k_c = Number(document.getElementById('k_c').value);
	v_d_c = 0;
	v_c_ch = 1.0;
	z_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		
	v_s_d = Number(document.getElementById('s_d').value);
	v_k_d = Number(document.getElementById('k_d').value);
	v_d_d = 0;
	v_d_ch = 1.0;
	z_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		
	v_s_s = Number(document.getElementById('s_s').value);
	v_k_s = Number(document.getElementById('k_s').value);
	v_d_s = 0;
	v_s_ch = 1.0;
	z_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
		
	d_h.value=0;
	d_a.value=0;
	d_b.value=0;
	d_c.value=0;
	d_d.value=0;
	d_s.value=0;
		
	a_ch.value =(1.0).toPrecision(2);
	b_ch.value =(1.0).toPrecision(2);
	c_ch.value =(1.0).toPrecision(2);
	d_ch.value =(1.0).toPrecision(2);
	s_ch.value =(1.0).toPrecision(2);
		
	d_sum2.innerHTML = 0;
	dame()
}

function sresetButton() {
	
	v_level = Number(document.getElementById('slevel').value);
		
	v_s_h = Number(document.getElementById('ss_h').value);
	v_k_h = Number(document.getElementById('sk_h').value);
	v_d_h = 0;
	sz_h.value = 10 + v_level + Math.floor(( v_s_h * 2 + v_k_h + Math.floor(v_d_h / 4) ) * v_level / 100);
		
	v_s_a = Number(document.getElementById('ss_a').value);
	v_k_a = Number(document.getElementById('sk_a').value);
	v_d_a = 0;
	v_a_ch = 1.0;
	sz_a.value = Math.floor((5 + Math.floor((v_s_a * 2 + v_k_a + Math.floor(v_d_a / 4)) * v_level / 100)) * v_a_ch);
		
	v_s_b = Number(document.getElementById('ss_b').value);
	v_k_b = Number(document.getElementById('sk_b').value);
	v_d_b = 0;
	v_b_ch = 1.0;
	sz_b.value = Math.floor((5 + Math.floor((v_s_b * 2 + v_k_b + Math.floor(v_d_b / 4)) * v_level / 100)) * v_b_ch);
		
	v_s_c = Number(document.getElementById('ss_c').value);
	v_k_c = Number(document.getElementById('sk_c').value);
	v_d_c = 0;
	v_c_ch = 1.0;
	sz_c.value = Math.floor((5 + Math.floor((v_s_c * 2 + v_k_c + Math.floor(v_d_c / 4)) * v_level / 100)) * v_c_ch);
		
	v_s_d = Number(document.getElementById('ss_d').value);
	v_k_d = Number(document.getElementById('sk_d').value);
	v_d_d = 0;
	v_d_ch = 1.0;
	sz_d.value = Math.floor((5 + Math.floor((v_s_d * 2 + v_k_d + Math.floor(v_d_d / 4)) * v_level / 100)) * v_d_ch);
		
	v_s_s = Number(document.getElementById('ss_s').value);
	v_k_s = Number(document.getElementById('sk_s').value);
	v_d_s = 0;
	v_s_ch = 1.0;
	sz_s.value = Math.floor((5 + Math.floor((v_s_s * 2 + v_k_s + Math.floor(v_d_s / 4)) * v_level / 100)) * v_s_ch);
		
	sd_h.value=0;
	sd_a.value=0;
	sd_b.value=0;
	sd_c.value=0;
	sd_d.value=0;
	sd_s.value=0;
		
	sa_ch.value =(1.0).toPrecision(2);
	sb_ch.value =(1.0).toPrecision(2);
	sc_ch.value =(1.0).toPrecision(2);
	sd_ch.value =(1.0).toPrecision(2);
	ss_ch.value =(1.0).toPrecision(2);
		
	sd_sum2.innerHTML = 0;
	dame()
}

function AllTokusei(){
	elem=[]
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(elem.indexOf(ary[10]) == -1){
			elem.push(ary[10]);
		}
		if(ary[11]!="" && elem.indexOf(ary[11]) == -1){
			elem.push(ary[11]);
		}
		if(ary[12]!="" && elem.indexOf(ary[12]) == -1){
			elem.push(ary[12]);
		}
	}
	elem.sort();
	n=elem.length
	newArr=""
	for(i=0;i<n;i++){
		newArr=newArr+'<option value="'+elem[i]+'">'+elem[i]+'</option>';
	}
	tokusei.innerHTML=newArr;
}

function sAllTokusei(){
	elem=[]
	for(i=0;i<l;i++){
		ary = pokemon[i].split(',');
		if(elem.indexOf(ary[10]) == -1){
			elem.push(ary[10]);
		}
		if(ary[11]!="" && elem.indexOf(ary[11]) == -1){
			elem.push(ary[11]);
		}
		if(ary[12]!="" && elem.indexOf(ary[12]) == -1){
			elem.push(ary[12]);
		}
	}
	elem.sort();
	n=elem.length
	newArr=""
	for(i=0;i<n;i++){
		newArr=newArr+'<option value="'+elem[i]+'">'+elem[i]+'</option>';
	}
	stokusei.innerHTML=newArr;
}

function setTokusei(){
	v_name=tokusei.value
	if(v_name=="ノーてんき" || v_name=="エアロック"){
		if(sonotalist.value==""){
			sonotalist.value=v_name;
		}else{
			elem=sonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				sonotalist.value=sonotalist.value+","+v_name;
			}
		}
		if(ssonotalist.value==""){
			ssonotalist.value=v_name;
		}else{
			elem=ssonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				ssonotalist.value=ssonotalist.value+","+v_name;
			}
		}
	}else if(v_name=="ひでり" || v_name=="ひひいろのこどう"){
		tenki.value="はれ";
		stenki.value="はれ";
	}else if(v_name=="ゆきふらし"){
		tenki.value="ゆき";
		stenki.value="ゆき";
	}else if(v_name=="すなおこし"){
		tenki.value="すなあらし";
		stenki.value="すなあらし";
	}else if(v_name=="あめふらし"){
		tenki.value="あめ";
		stenki.value="あめ";
	}else if(v_name=="エレキメーカー" || v_name=="ハドロンエンジン"){
		firudo.value="エレキフィールド";
		sfirudo.value="エレキフィールド";
	}else if(v_name=="サイコメーカー"){
		firudo.value="サイコフィールド";
		sfirudo.value="サイコフィールド";
	}else if(v_name=="グラスメーカー"){
		firudo.value="グラスフィールド";
		sfirudo.value="グラスフィールド";
	}else if(v_name=="ミストメーカー"){
		firudo.value="ミストフィールド";
		sfirudo.value="ミストフィールド";
	}else if(v_name=="わざわいのたま" || v_name=="わざわいのつるぎ" || v_name=="わざわいのおふだ" || v_name=="わざわいのうつわ" || v_name=="はがねのせいしん"){
		if(sonotalist.value==""){
			sonotalist.value=v_name;
		}else{
			elem=sonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				sonotalist.value=sonotalist.value+","+v_name;
			}
		}
	}
}

function ssetTokusei(){
	v_name=stokusei.value
	if(v_name=="ノーてんき" || v_name=="エアロック"){
		if(sonotalist.value==""){
			sonotalist.value=v_name;
		}else{
			elem=sonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				sonotalist.value=sonotalist.value+","+v_name;
			}
		}
		if(ssonotalist.value==""){
			ssonotalist.value=v_name;
		}else{
			elem=ssonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				ssonotalist.value=ssonotalist.value+","+v_name;
			}
		}
	}else if(v_name=="ひでり" || v_name=="ひひいろのこどう"){
		tenki.value="はれ";
		stenki.value="はれ";
	}else if(v_name=="ゆきふらし"){
		tenki.value="ゆき";
		stenki.value="ゆき";
	}else if(v_name=="すなおこし"){
		tenki.value="すなあらし";
		stenki.value="すなあらし";
	}else if(v_name=="あめふらし"){
		tenki.value="あめ";
		stenki.value="あめ";
	}else if(v_name=="エレキメーカー" || v_name=="ハドロンエンジン"){
		firudo.value="エレキフィールド";
		sfirudo.value="エレキフィールド";
	}else if(v_name=="サイコメーカー"){
		firudo.value="サイコフィールド";
		sfirudo.value="サイコフィールド";
	}else if(v_name=="グラスメーカー"){
		firudo.value="グラスフィールド";
		sfirudo.value="グラスフィールド";
	}else if(v_name=="ミストメーカー"){
		firudo.value="ミストフィールド";
		sfirudo.value="ミストフィールド";
	}else if(v_name=="わざわいのたま" || v_name=="わざわいのつるぎ" || v_name=="わざわいのおふだ" || v_name=="わざわいのうつわ" || v_name=="はがねのせいしん"){
		if(sonotalist.value==""){
			ssonotalist.value=v_name;
		}else{
			elem=ssonotalist.value.split(",");
			if(elem.indexOf(v_name)==-1){
				ssonotalist.value=ssonotalist.value+","+v_name;
			}
		}
	}
}

function tokusub(){
	v_name=tokusei.value;
	if(v_name=="とうそうしん"){
		tokuseisub.innerHTML='<select id="tokuseisubc"><option value="同性">同性</option><option value="異性">異性</option><option value="性別なし">性別なし</option></select>';
		tokuseisubc= document.getElementById('tokuseisubc');
	}else if(v_name=="もうか" || v_name=="しんりょく" || v_name=="げきりゅう" || v_name=="アナライズ" || v_name=="スロースタート" || v_name=="むしのしらせ" || v_name=="もらいび" || v_name=="プラス" || v_name=="マイナス"){
		tokuseisub.innerHTML='<input type="checkbox" id="tokuseisubc" name="tokuseisubc"/><label for="tokuseisubc">'+v_name+'適用</label>';
		tokuseisubc= document.getElementById('tokuseisubc');
	}else if(v_name=="こだいかっせい" || v_name=="クォークチャージ"){
		re='適用：<select id="tokuseisubc">';
		re=re+'<option value="なし">なし</option>';
		re=re+'<option value="こうげき">こうげき</option>';
		re=re+'<option value="ぼうぎょ">ぼうぎょ</option>';
		re=re+'<option value="とくこう">とくこう</option>';
		re=re+'<option value="とくぼう">とくぼう</option>';
		re=re+'<option value="すばやさ">すばやさ</option>';
		re=re+'</select>';
		tokuseisub.innerHTML=re;
		tokuseisubc= document.getElementById('tokuseisubc');
	}else{
		tokuseisub.innerHTML="";
	}
}
function stokusub(){
	v_name=stokusei.value;
	if(v_name=="とうそうしん"){
		stokuseisub.innerHTML='<select id="stokuseisubc"><option value="同性">同性</option><option value="異性">異性</option><option value="性別なし">性別なし</option></select>';
		stokuseisubc= document.getElementById('stokuseisubc');
	}else if(v_name=="もうか" || v_name=="しんりょく" || v_name=="げきりゅう" || v_name=="アナライズ" || v_name=="スロースタート" || v_name=="むしのしらせ" || v_name=="もらいび" || v_name=="プラス" || v_name=="マイナス"){
		stokuseisub.innerHTML='<input type="checkbox" id="stokuseisubc" name="stokuseisubc"/><label for="stokuseisubc">'+v_name+'適用</label>';
		stokuseisubc= document.getElementById('stokuseisubc');
	}else if(v_name=="こだいかっせい" || v_name=="クォークチャージ"){
		re='適用：<select id="stokuseisubc">';
		re=re+'<option value="なし">なし</option>';
		re=re+'<option value="こうげき">こうげき</option>';
		re=re+'<option value="ぼうぎょ">ぼうぎょ</option>';
		re=re+'<option value="とくこう">とくこう</option>';
		re=re+'<option value="とくぼう">とくぼう</option>';
		re=re+'<option value="すばやさ">すばやさ</option>';
		re=re+'</select>';
		stokuseisub.innerHTML=re;
		stokuseisubc= document.getElementById('stokuseisubc');
	}else{
		stokuseisub.innerHTML="";
	}
}
