let poke=[];
poke[0]='フシギダネ,45,49,49,65,65,45';
poke[1]='フシギソウ,60,62,63,80,80,60';
poke[2]='フシギバナ,80,82,83,100,100,80';
poke[3]='ヒトカゲ,39,52,43,60,50,65';
poke[4]='リザード,58,64,58,80,65,80';
poke[5]='リザードン,78,84,78,109,85,100';
poke[6]='ゼニガメ,44,48,65,50,64,43';
poke[7]='カメール,59,63,80,65,80,58';
poke[8]='カメックス,79,83,100,85,105,78';
poke[9]='アーボ,35,60,44,40,54,55';
poke[10]='アーボック,60,95,69,65,79,80';
poke[11]='ピカチュウ,35,55,40,50,50,90';
poke[12]='ライチュウ,60,90,55,90,80,110';
poke[13]='アローラライチュウ,60,85,50,95,85,110';
poke[14]='サンド,50,75,85,20,30,40';
poke[15]='アローラサンド,50,75,90,10,35,40';
poke[16]='サンドパン,75,100,110,45,55,65';
poke[17]='アローラサンドパン,75,100,120,25,65,65';
poke[18]='ピッピ,70,45,48,60,65,35';
poke[19]='ピクシー,95,70,73,95,90,60';
poke[20]='ロコン,38,41,40,50,65,65';
poke[21]='アローラロコン,38,41,40,50,65,65';
poke[22]='キュウコン,73,76,75,81,100,100';
poke[23]='アローラキュウコン,73,67,75,81,100,109';
poke[24]='プリン,115,45,20,45,25,20';
poke[25]='プクリン,140,70,45,85,50,45';
poke[26]='ナゾノクサ,45,50,55,75,65,30';
poke[27]='クサイハナ,60,65,70,85,75,40';
poke[28]='ラフレシア,75,80,85,110,90,50';
poke[29]='コンパン,60,55,50,40,55,45';
poke[30]='モルフォン,70,65,60,90,75,90';
poke[31]='ディグダ,10,55,25,35,45,95';
poke[32]='アローラディグダ,10,55,30,35,45,90';
poke[33]='ダグトリオ,35,100,50,50,70,120';
poke[34]='アローラダグトリオ,35,100,60,50,70,110';
poke[35]='ニャース,40,45,35,40,40,90';
poke[36]='アローラニャース,40,35,35,50,40,90';
poke[37]='ガラルニャース,50,65,55,40,40,40';
poke[38]='ペルシアン,65,70,60,65,65,115';
poke[39]='アローラペルシアン,65,60,60,75,65,115';
poke[40]='コダック,50,52,48,65,50,55';
poke[41]='ゴルダック,80,82,78,95,80,85';
poke[42]='マンキー,40,80,35,35,45,70';
poke[43]='オコリザル,65,105,60,60,70,95';
poke[44]='ガーディ,55,70,45,70,50,60';
poke[45]='ヒスイガーディ,60,75,45,65,50,55';
poke[46]='ウインディ,90,110,80,100,80,95';
poke[47]='ヒスイウインディ,95,115,80,95,80,90';
poke[48]='ニョロモ,40,50,40,40,40,90';
poke[49]='ニョロゾ,65,65,65,50,50,90';
poke[50]='ニョロボン,90,95,95,70,90,70';
poke[51]='マダツボミ,50,75,35,70,30,40';
poke[52]='ウツドン,65,90,50,85,45,55';
poke[53]='ウツボット,80,105,65,100,70,70';
poke[54]='メノクラゲ,40,40,35,50,100,70';
poke[55]='ドククラゲ,80,70,65,80,120,100';
poke[56]='イシツブテ,40,80,100,30,30,20';
poke[57]='アローライシツブテ,40,80,100,30,30,20';
poke[58]='ゴローン,55,95,115,45,45,35';
poke[59]='アローラゴローン,55,95,115,45,45,35';
poke[60]='ゴローニャ,80,120,130,55,65,45';
poke[61]='アローラゴローニャ,80,120,130,55,65,45';
poke[62]='ヤドン,90,65,65,40,40,15';
poke[63]='ガラルヤドン,90,65,65,40,40,15';
poke[64]='ヤドラン,95,75,110,100,80,30';
poke[65]='ガラルヤドラン,95,100,95,100,70,30';
poke[66]='コイル,25,35,70,95,55,45';
poke[67]='レアコイル,50,60,95,120,70,70';
poke[68]='ドードー,35,85,45,35,35,75';
poke[69]='ドードリオ,60,110,70,60,60,110';
poke[70]='パウワウ,65,45,55,45,70,45';
poke[71]='ジュゴン,90,70,80,70,95,70';
poke[72]='ベトベター,80,80,50,40,50,25';
poke[73]='アローラベトベター,80,80,50,40,50,25';
poke[74]='ベトベトン,105,105,75,65,100,50';
poke[75]='アローラベトベトン,105,105,75,65,100,50';
poke[76]='シェルダー,30,65,100,45,25,40';
poke[77]='パルシェン,50,95,180,85,45,70';
poke[78]='ゴース,30,35,30,100,35,80';
poke[79]='ゴースト,45,50,45,115,55,95';
poke[80]='ゲンガー,60,65,60,130,75,110';
poke[81]='スリープ,60,48,45,43,90,42';
poke[82]='スリーパー,85,73,70,73,115,67';
poke[83]='ビリリダマ,40,30,50,55,55,100';
poke[84]='ヒスイビリリダマ,40,30,50,55,55,100';
poke[85]='マルマイン,60,50,70,80,80,150';
poke[86]='ヒスイマルマイン,60,50,70,80,80,150';
poke[87]='タマタマ,60,40,80,60,45,40';
poke[88]='ナッシー,95,95,85,125,75,55';
poke[89]='アローラナッシー,95,105,85,125,75,45';
poke[90]='サワムラー,50,120,53,35,110,87';
poke[91]='エビワラー,50,105,79,35,110,76';
poke[92]='ドガース,40,65,95,60,45,35';
poke[93]='マタドガス,65,90,120,85,70,60';
poke[94]='ガラルマタドガス,65,90,120,85,70,60';
poke[95]='サイホーン,80,85,95,30,30,25';
poke[96]='サイドン,105,130,120,45,45,40';
poke[97]='ラッキー,250,5,5,35,105,50';
poke[98]='タッツー,30,40,70,70,25,60';
poke[99]='シードラ,55,65,95,95,45,85';
poke[100]='ストライク,70,110,80,55,80,105';
poke[101]='エレブー,65,83,57,95,85,105';
poke[102]='ブーバー,65,95,57,100,85,93';
poke[103]='ケンタロス,75,100,95,40,70,110';
poke[104]='パルデアケンタロス(かくとう),75,110,105,30,70,100';
poke[105]='パルデアケンタロス(ほのお),75,110,105,30,70,100';
poke[106]='パルデアケンタロス(みず),75,110,105,30,70,100';
poke[107]='コイキング,20,10,55,15,20,80';
poke[108]='ギャラドス,95,125,79,60,100,81';
poke[109]='ラプラス,130,85,80,85,95,60';
poke[110]='メタモン,48,48,48,48,48,48';
poke[111]='イーブイ,55,55,50,45,65,55';
poke[112]='シャワーズ,130,65,60,110,95,65';
poke[113]='サンダース,65,65,60,110,95,130';
poke[114]='ブースター,65,130,60,95,110,65';
poke[115]='ポリゴン,65,60,70,85,75,40';
poke[116]='カビゴン,160,110,65,65,110,30';
poke[117]='フリーザー,90,85,100,95,125,85';
poke[118]='ガラルフリーザー,90,85,85,125,100,95';
poke[119]='サンダー,90,90,85,125,90,100';
poke[120]='ガラルサンダー,90,125,90,85,90,100';
poke[121]='ファイヤー,90,100,90,125,85,90';
poke[122]='ガラルファイヤー,90,85,90,100,125,90';
poke[123]='ミニリュウ,41,64,45,50,50,50';
poke[124]='ハクリュー,61,84,65,70,70,70';
poke[125]='カイリュー,91,134,95,100,100,80';
poke[126]='ミュウツー,106,110,90,154,90,130';
poke[127]='ミュウ,100,100,100,100,100,100';
poke[128]='チコリータ,45,49,65,49,65,45';
poke[129]='ベイリーフ,60,62,80,63,80,60';
poke[130]='メガニウム,80,82,100,83,100,80';
poke[131]='ヒノアラシ,39,52,43,60,50,65';
poke[132]='マグマラシ,58,64,58,80,65,80';
poke[133]='バクフーン,78,84,78,109,85,100';
poke[134]='ヒスイバクフーン,73,84,78,119,85,95';
poke[135]='ワニノコ,50,65,64,44,48,43';
poke[136]='アリゲイツ,65,80,80,59,63,58';
poke[137]='オーダイル,85,105,100,79,83,78';
poke[138]='オタチ,35,46,34,35,45,20';
poke[139]='オオタチ,85,76,64,45,55,90';
poke[140]='ホーホー,60,30,30,36,56,50';
poke[141]='ヨルノズク,100,50,50,86,96,70';
poke[142]='イトマル,40,60,40,40,40,30';
poke[143]='アリアドス,70,90,70,60,70,40';
poke[144]='チョンチー,75,38,38,56,56,67';
poke[145]='ランターン,125,58,58,76,76,67';
poke[146]='ピチュー,20,40,15,35,35,60';
poke[147]='ピィ,50,25,28,45,55,15';
poke[148]='ププリン,90,30,15,40,20,15';
poke[149]='メリープ,55,40,40,65,45,35';
poke[150]='モココ,70,55,55,80,60,45';
poke[151]='デンリュウ,90,75,85,115,90,55';
poke[152]='キレイハナ,75,80,95,90,100,50';
poke[153]='マリル,70,20,50,20,50,40';
poke[154]='マリルリ,100,50,80,60,80,50';
poke[155]='ウソッキー,70,100,115,30,65,30';
poke[156]='ニョロトノ,90,75,75,90,100,70';
poke[157]='ハネッコ,35,35,40,35,55,50';
poke[158]='ポポッコ,55,45,50,45,65,80';
poke[159]='ワタッコ,75,55,70,55,95,110';
poke[160]='エイパム,55,70,55,40,55,85';
poke[161]='ヒマナッツ,30,30,30,30,30,30';
poke[162]='キマワリ,75,75,55,105,85,30';
poke[163]='ヤンヤンマ,65,65,45,75,45,95';
poke[164]='ウパー,55,45,45,25,25,15';
poke[165]='パルデアウパー,55,45,45,25,25,15';
poke[166]='ヌオー,95,85,85,65,65,35';
poke[167]='エーフィ,65,65,60,130,95,110';
poke[168]='ブラッキー,95,65,110,60,130,65';
poke[169]='ヤミカラス,60,85,42,85,42,91';
poke[170]='ヤドキング,95,75,80,100,110,30';
poke[171]='ガラルヤドキング,95,65,80,110,110,30';
poke[172]='ムウマ,60,60,60,85,85,85';
poke[173]='キリンリキ,70,80,65,90,65,85';
poke[174]='クヌギダマ,50,65,90,35,35,15';
poke[175]='フォレトス,75,90,140,60,60,40';
poke[176]='ノコッチ,100,70,70,65,65,45';
poke[177]='グライガー,65,75,105,35,65,85';
poke[178]='ブルー,60,80,50,40,40,30';
poke[179]='グランブル,90,120,75,60,60,45';
poke[180]='ハリーセン,65,95,85,55,55,85';
poke[181]='ヒスイハリーセン,65,95,85,55,55,85';
poke[182]='ハッサム,70,130,100,55,80,65';
poke[183]='ヘラクロス,80,125,75,40,95,85';
poke[184]='ニューラ,55,95,55,35,75,115';
poke[185]='ヒスイニューラ,55,95,55,35,75,115';
poke[186]='ヒメグマ,60,80,50,50,50,40';
poke[187]='リングマ,90,130,75,75,75,55';
poke[188]='マグマッグ,40,40,40,70,40,20';
poke[189]='マグカルゴ,60,50,120,90,80,30';
poke[190]='ウリムー,50,50,40,30,30,50';
poke[191]='イノムー,100,100,80,60,60,50';
poke[192]='デリバード,45,55,45,65,45,75';
poke[193]='エアームド,65,80,140,40,70,70';
poke[194]='デルビル,45,60,30,80,50,65';
poke[195]='ヘルガー,75,90,50,110,80,95';
poke[196]='キングドラ,75,95,95,95,95,85';
poke[197]='ゴマゾウ,90,60,60,40,40,40';
poke[198]='ドンファン,90,120,120,60,60,50';
poke[199]='ポリゴン２,85,80,90,105,95,60';
poke[200]='オドシシ,73,95,62,85,65,85';
poke[201]='ドーブル,55,20,35,20,45,75';
poke[202]='バルキー,35,35,35,35,35,35';
poke[203]='カポエラー,50,95,95,35,110,70';
poke[204]='エレキッド,45,63,37,65,55,95';
poke[205]='ブビィ,45,75,37,70,55,83';
poke[206]='ハピナス,255,10,10,75,135,55';
poke[207]='ライコウ,90,85,75,115,100,115';
poke[208]='エンテイ,115,115,85,90,75,100';
poke[209]='スイクン,100,75,115,90,115,85';
poke[210]='ヨーギラス,50,64,50,45,50,41';
poke[211]='サナギラス,70,84,70,65,70,51';
poke[212]='バンギラス,100,134,110,95,100,61';
poke[213]='ルギア,106,90,130,90,154,110';
poke[214]='ホウオウ,106,130,90,110,154,90';
poke[215]='キモリ,40,45,35,65,55,70';
poke[216]='ジュプトル,50,65,45,85,65,95';
poke[217]='ジュカイン,70,85,65,105,85,120';
poke[218]='アチャモ,45,60,40,70,50,45';
poke[219]='ワカシャモ,60,85,60,85,60,55';
poke[220]='バシャーモ,80,120,70,110,70,80';
poke[221]='ミズゴロウ,50,70,50,50,50,40';
poke[222]='ヌマクロー,70,85,70,60,70,50';
poke[223]='ラグラージ,100,110,90,85,90,60';
poke[224]='ポチエナ,35,55,35,30,30,35';
poke[225]='グラエナ,70,90,70,60,60,70';
poke[226]='ハスボー,40,30,30,40,50,30';
poke[227]='ハスブレロ,60,50,50,60,70,50';
poke[228]='ルンパッパ,80,70,70,90,100,70';
poke[229]='タネボー,40,40,50,30,30,30';
poke[230]='コノハナ,70,70,40,60,40,60';
poke[231]='ダーテング,90,100,60,90,60,80';
poke[232]='キャモメ,40,30,30,55,30,85';
poke[233]='ペリッパー,60,50,100,95,70,65';
poke[234]='ラルトス,28,25,25,45,35,40';
poke[235]='キルリア,38,35,35,65,55,50';
poke[236]='サーナイト,68,65,65,125,115,80';
poke[237]='アメタマ,40,30,32,50,52,65';
poke[238]='アメモース,70,60,62,100,82,80';
poke[239]='キノココ,60,40,60,40,60,35';
poke[240]='キノガッサ,60,130,80,60,60,70';
poke[241]='ナマケロ,60,60,60,35,35,30';
poke[242]='ヤルキモノ,80,80,80,55,55,90';
poke[243]='ケッキング,150,160,100,95,65,100';
poke[244]='マクノシタ,72,60,30,20,30,25';
poke[245]='ハリテヤマ,144,120,60,40,60,50';
poke[246]='ルリリ,50,20,40,20,40,20';
poke[247]='ノズパス,30,45,135,45,90,30';
poke[248]='ヤミラミ,50,75,75,65,65,50';
poke[249]='アサナン,30,40,55,40,55,60';
poke[250]='チャーレム,60,60,75,60,75,80';
poke[251]='プラスル,60,50,40,85,75,95';
poke[252]='マイナン,60,40,50,75,85,95';
poke[253]='バルビート,65,73,75,47,85,85';
poke[254]='イルミーゼ,65,47,75,73,85,85';
poke[255]='ゴクリン,70,43,53,43,53,40';
poke[256]='マルノーム,100,73,83,73,83,55';
poke[257]='ドンメル,60,60,40,65,45,35';
poke[258]='バクーダ,70,100,70,105,75,40';
poke[259]='コータス,70,85,140,85,70,20';
poke[260]='バネブー,60,25,35,70,80,60';
poke[261]='ブーピッグ,80,45,65,90,110,80';
poke[262]='ナックラー,45,100,45,45,45,10';
poke[263]='ビブラーバ,50,70,50,50,50,70';
poke[264]='フライゴン,80,100,80,80,80,100';
poke[265]='サボネア,50,85,40,85,40,35';
poke[266]='ノクタス,70,115,60,115,60,55';
poke[267]='チルット,45,40,60,40,75,50';
poke[268]='チルタリス,75,70,90,70,105,80';
poke[269]='ザングース,73,115,60,60,60,90';
poke[270]='ハブネーク,73,100,60,100,60,65';
poke[271]='ドジョッチ,50,48,43,46,41,60';
poke[272]='ナマズン,110,78,73,76,71,60';
poke[273]='ヘイガニ,43,80,65,50,35,35';
poke[274]='シザリガー,63,120,85,90,55,55';
poke[275]='ヒンバス,20,15,20,10,55,80';
poke[276]='ミロカロス,95,60,79,100,125,81';
poke[277]='カゲボウズ,44,75,35,63,33,45';
poke[278]='ジュペッタ,64,115,65,83,63,65';
poke[279]='ヨマワル,20,40,90,30,90,25';
poke[280]='サマヨール,40,70,130,60,130,25';
poke[281]='トロピウス,99,68,83,72,87,51';
poke[282]='チリーン,75,50,80,95,90,65';
poke[283]='ユキワラシ,50,50,50,50,50,50';
poke[284]='オニゴーリ,80,80,80,80,80,80';
poke[285]='ラブカス,43,30,55,40,65,97';
poke[286]='タツベイ,45,75,60,40,30,50';
poke[287]='コモルー,65,95,100,60,50,50';
poke[288]='ボーマンダ,95,135,80,110,80,100';
poke[289]='ダンバル,40,55,80,35,60,30';
poke[290]='メタング,60,75,100,55,80,50';
poke[291]='メタグロス,80,135,130,95,90,70';
poke[292]='レジロック,80,100,200,50,100,50';
poke[293]='レジアイス,80,50,100,100,200,50';
poke[294]='レジスチル,80,75,150,75,150,50';
poke[295]='ラティアス,80,80,90,110,130,110';
poke[296]='ラティオス,80,90,80,130,110,110';
poke[297]='カイオーガ,100,100,90,150,140,90';
poke[298]='グラードン,100,150,140,100,90,90';
poke[299]='レックウザ,105,150,90,150,90,95';
poke[300]='ジラーチ,100,100,100,100,100,100';
poke[301]='デオキシス(ノーマルフォルム),50,150,50,150,50,150';
poke[302]='デオキシス(アタックフォルム),50,180,20,180,20,150';
poke[303]='デオキシス(ディフェンスフォルム),50,70,160,70,160,90';
poke[304]='デオキシス(スピードフォルム),50,95,90,95,90,180';
poke[305]='ナエトル,55,68,64,45,55,31';
poke[306]='ハヤシガメ,75,89,85,55,65,36';
poke[307]='ドダイトス,95,109,105,75,85,56';
poke[308]='ヒコザル,44,58,44,58,44,61';
poke[309]='モウカザル,64,78,52,78,52,81';
poke[310]='ゴウカザル,76,104,71,104,71,108';
poke[311]='ポッチャマ,53,51,53,61,56,40';
poke[312]='ポッタイシ,64,66,68,81,76,50';
poke[313]='エンペルト,84,86,88,111,101,60';
poke[314]='ムックル,40,55,30,30,30,60';
poke[315]='ムクバード,55,75,50,40,40,80';
poke[316]='ムクホーク,85,120,70,50,60,100';
poke[317]='コロボーシ,37,25,41,25,41,25';
poke[318]='コロトック,77,85,51,55,51,65';
poke[319]='コリンク,45,65,34,40,34,45';
poke[320]='ルクシオ,60,85,49,60,49,60';
poke[321]='レントラー,80,120,79,95,79,70';
poke[322]='ズガイドス,67,125,40,30,30,58';
poke[323]='ラムパルド,97,165,60,65,50,58';
poke[324]='タテトプス,30,42,118,42,88,30';
poke[325]='トリデプス,60,52,168,47,138,30';
poke[326]='ミツハニー,30,30,42,30,42,70';
poke[327]='ビークイン,70,80,102,80,102,40';
poke[328]='パチリス,60,45,70,45,90,95';
poke[329]='ブイゼル,55,65,35,60,30,85';
poke[330]='フローゼル,85,105,55,85,50,115';
poke[331]='カラナクシ(にしのうみ),76,48,48,57,62,34';
poke[332]='カラナクシ(ひがしのうみ),76,48,48,57,62,34';
poke[333]='トリトドン(にしのうみ),111,83,68,92,82,39';
poke[334]='トリトドン(ひがしのうみ),111,83,68,92,82,39';
poke[335]='エテボース,75,100,66,60,66,115';
poke[336]='フワンテ,90,50,34,60,44,70';
poke[337]='フワライド,150,80,44,90,54,80';
poke[338]='ムウマージ,60,60,60,105,105,105';
poke[339]='ドンカラス,100,125,52,105,52,71';
poke[340]='リーシャン,45,30,50,65,50,45';
poke[341]='スカンプー,63,63,47,41,41,74';
poke[342]='スカタンク,103,93,67,71,61,84';
poke[343]='ドーミラー,57,24,86,24,86,23';
poke[344]='ドータクン,67,89,116,79,116,33';
poke[345]='ウソハチ,50,80,95,10,45,10';
poke[346]='ピンプク,100,5,5,15,65,30';
poke[347]='ミカルゲ,50,92,108,92,108,35';
poke[348]='フカマル,58,70,45,40,45,42';
poke[349]='ガバイト,68,90,65,50,55,82';
poke[350]='ガブリアス,108,130,95,80,85,102';
poke[351]='ゴンベ,135,85,40,40,85,5';
poke[352]='リオル,40,70,40,35,40,60';
poke[353]='ルカリオ,70,110,70,115,70,90';
poke[354]='ヒポポタス,68,72,78,38,42,32';
poke[355]='カバルドン(オス),108,112,118,68,72,47';
poke[356]='カバルドン(メス),108,112,118,68,72,47';
poke[357]='グレッグル,48,61,40,61,40,50';
poke[358]='ドクロッグ,83,106,65,86,65,85';
poke[359]='ケイコウオ,49,49,56,49,61,66';
poke[360]='ネオラント,69,69,76,69,86,91';
poke[361]='ユキカブリ,60,62,50,62,60,40';
poke[362]='ユキノオー,90,92,75,92,85,60';
poke[363]='マニューラ,70,120,65,45,85,125';
poke[364]='ジバコイル,70,70,115,130,90,60';
poke[365]='ドサイドン,115,140,130,55,55,40';
poke[366]='エレキブル,75,123,67,95,85,95';
poke[367]='ブーバーン,75,95,67,125,95,83';
poke[368]='メガヤンマ,86,76,86,116,56,95';
poke[369]='リーフィア,65,110,130,60,65,95';
poke[370]='グレイシア,65,60,110,130,95,65';
poke[371]='グライオン,75,95,125,45,75,95';
poke[372]='マンムー,110,130,80,70,60,80';
poke[373]='ポリゴンＺ,85,80,70,135,75,90';
poke[374]='エルレイド,68,125,65,65,115,80';
poke[375]='ダイノーズ,60,55,145,75,150,40';
poke[376]='ヨノワール,45,100,135,65,135,45';
poke[377]='ユキメノコ,70,80,70,80,70,110';
poke[378]='ロトム,50,50,77,95,77,91';
poke[379]='ヒートロトム,50,65,107,105,107,86';
poke[380]='ウォッシュロトム,50,65,107,105,107,86';
poke[381]='フロストロトム,50,65,107,105,107,86';
poke[382]='スピンロトム,50,65,107,105,107,86';
poke[383]='カットロトム,50,65,107,105,107,86';
poke[384]='ユクシー,75,75,130,75,130,95';
poke[385]='エムリット,80,105,105,105,105,80';
poke[386]='アグノム,75,125,70,125,70,115';
poke[387]='ディアルガ,100,120,120,150,100,90';
poke[388]='ディアルガ(オリジンフォルム),100,100,120,150,120,90';
poke[389]='パルキア,90,120,100,150,120,100';
poke[390]='パルキア(オリジンフォルム),90,100,100,150,120,120';
poke[391]='ヒードラン,91,90,106,130,106,77';
poke[392]='レジギガス,110,160,110,80,110,100';
poke[393]='ギラティナ(アナザーフォルム),150,100,120,100,120,90';
poke[394]='ギラティナ(オリジンフォルム),150,120,100,120,100,90';
poke[395]='クレセリア,120,70,110,75,120,85';
poke[396]='フィオネ,80,80,80,80,80,80';
poke[397]='マナフィ,100,100,100,100,100,100';
poke[398]='ダークライ,70,90,90,135,90,125';
poke[399]='シェイミ(ランドフォルム),100,100,100,100,100,100';
poke[400]='シェイミ(スカイフォルム),100,103,75,120,75,127';
poke[401]='アルセウス,120,120,120,120,120,120';
poke[402]='ツタージャ,45,45,55,45,55,63';
poke[403]='ジャノビー,60,60,75,60,75,83';
poke[404]='ジャローダ,75,75,95,75,95,113';
poke[405]='ポカブ,65,63,45,45,45,45';
poke[406]='チャオブー,90,93,55,70,55,55';
poke[407]='エンブオー,110,123,65,100,65,65';
poke[408]='ミジュマル,55,55,45,63,45,45';
poke[409]='フタチマル,75,75,60,83,60,60';
poke[410]='ダイケンキ,95,100,85,108,70,70';
poke[411]='ヒスイダイケンキ,90,108,80,100,65,85';
poke[412]='シママ,45,60,32,50,32,76';
poke[413]='ゼブライカ,75,100,63,80,63,116';
poke[414]='モグリュー,60,85,40,30,45,68';
poke[415]='ドリュウズ,110,135,60,50,65,88';
poke[416]='ドッコラー,75,80,55,25,35,35';
poke[417]='ドテッコツ,85,105,85,40,50,40';
poke[418]='ローブシン,105,140,95,55,65,45';
poke[419]='クルミル,45,53,70,40,60,42';
poke[420]='クルマユ,55,63,90,50,80,42';
poke[421]='ハハコモリ,75,103,80,70,80,92';
poke[422]='モンメン,40,27,60,37,50,66';
poke[423]='エルフーン,60,67,85,77,75,116';
poke[424]='チュリネ,45,35,50,70,50,30';
poke[425]='ドレディア,70,60,75,110,75,90';
poke[426]='ヒスイドレディア,70,105,75,50,75,105';
poke[427]='バスラオ(あかすじのすがた),70,92,65,80,55,98';
poke[428]='バスラオ(あおすじのすがた),70,92,65,80,55,98';
poke[429]='バスラオ(しろすじ),70,92,65,80,55,98';
poke[430]='メグロコ,50,72,35,35,35,65';
poke[431]='ワルビル,60,82,45,45,45,74';
poke[432]='ワルビアル,95,117,80,65,70,92';
poke[433]='ズルッグ,50,75,70,35,70,48';
poke[434]='ズルズキン,65,90,115,45,115,58';
poke[435]='ゾロア,40,65,40,80,40,65';
poke[436]='ヒスイゾロア,35,60,40,85,40,70';
poke[437]='ゾロアーク,60,105,60,120,60,105';
poke[438]='ヒスイゾロアーク,55,100,60,125,60,110';
poke[439]='チラーミィ,55,50,40,40,40,75';
poke[440]='チラチーノ,75,95,60,65,60,115';
poke[441]='ゴチム,45,30,50,55,65,45';
poke[442]='ゴチミル,60,45,70,75,85,55';
poke[443]='ゴチルゼル,70,55,95,95,110,65';
poke[444]='ユニラン,45,30,40,105,50,20';
poke[445]='ダブラン,65,40,50,125,60,30';
poke[446]='ランクルス,110,65,75,125,85,30';
poke[447]='コアルヒー,62,44,50,44,50,55';
poke[448]='スワンナ,75,87,63,87,63,98';
poke[449]='シキジカ(はるのすがた),60,60,50,40,50,75';
poke[450]='シキジカ(なつのすがた),60,60,50,40,50,75';
poke[451]='シキジカ(あきのすがた),60,60,50,40,50,75';
poke[452]='シキジカ(ふゆのすがた),60,60,50,40,50,75';
poke[453]='メブキジカ(はるのすがた),80,100,70,60,70,95';
poke[454]='メブキジカ(なつのすがた),80,100,70,60,70,95';
poke[455]='メブキジカ(あきのすがた),80,100,70,60,70,95';
poke[456]='メブキジカ(ふゆのすがた),80,100,70,60,70,95';
poke[457]='タマゲタケ,69,55,45,55,55,15';
poke[458]='モロバレル,114,85,70,85,80,30';
poke[459]='ママンボウ,165,75,80,40,45,65';
poke[460]='バチュル,50,47,50,57,50,65';
poke[461]='デンチュラ,70,77,60,97,60,108';
poke[462]='シビシラス,35,55,40,45,40,60';
poke[463]='シビビール,65,85,70,75,70,40';
poke[464]='シビルドン,85,115,80,105,80,50';
poke[465]='ヒトモシ,50,30,55,65,55,20';
poke[466]='ランプラー,60,40,60,95,60,55';
poke[467]='シャンデラ,60,55,90,145,90,80';
poke[468]='キバゴ,46,87,60,30,40,57';
poke[469]='オノンド,66,117,70,40,50,67';
poke[470]='オノノクス,76,147,90,60,70,97';
poke[471]='クマシュン,55,70,40,60,40,40';
poke[472]='ツンベアー,95,130,80,70,80,50';
poke[473]='フリージオ,80,50,50,95,135,105';
poke[474]='コジョフー,45,85,50,55,50,65';
poke[475]='コジョンド,65,125,60,95,60,105';
poke[476]='ゴビット,59,74,50,35,50,35';
poke[477]='ゴルーグ,89,124,80,55,80,55';
poke[478]='コマタナ,45,85,70,40,40,60';
poke[479]='キリキザン,65,125,100,60,70,70';
poke[480]='ワシボン,70,83,50,37,50,60';
poke[481]='ウォーグル,100,123,75,57,75,80';
poke[482]='ヒスイウォーグル,110,83,70,112,70,65';
poke[483]='バルチャイ,70,55,75,45,65,60';
poke[484]='バルジーナ,110,65,105,55,95,80';
poke[485]='モノズ,52,65,50,45,50,38';
poke[486]='ジヘッド,72,85,70,65,70,58';
poke[487]='サザンドラ,92,105,90,125,90,98';
poke[488]='メラルバ,55,85,55,50,55,60';
poke[489]='ウルガモス,85,60,65,135,105,100';
poke[490]='コバルオン,91,90,129,90,72,108';
poke[491]='テラキオン,91,129,90,72,90,108';
poke[492]='ビリジオン,91,90,72,90,129,108';
poke[493]='トルネロス(けしんフォルム),79,115,70,125,80,111';
poke[494]='トルネロス(れいじゅうフォルム),79,100,80,110,90,121';
poke[495]='ボルトロス(けしんフォルム),79,115,70,125,80,111';
poke[496]='ボルトロス(れいじゅうフォルム),79,105,70,145,80,101';
poke[497]='レシラム,100,120,100,150,120,90';
poke[498]='ゼクロム,100,150,120,120,100,90';
poke[499]='ランドロス(けしんフォルム),89,125,90,115,80,101';
poke[500]='ランドロス(れいじゅうフォルム),89,145,90,105,80,91';
poke[501]='キュレム,125,130,90,130,90,95';
poke[502]='ホワイトキュレム,125,120,90,170,100,95';
poke[503]='ブラックキュレム,125,170,100,120,90,95';
poke[504]='ケルディオ,91,72,90,129,90,108';
poke[505]='ケルディオ(かくごのすがた),91,72,90,129,90,108';
poke[506]='メロエッタ(ボイスフォルム),100,77,77,128,128,90';
poke[507]='メロエッタ(ステップフォルム),100,77,77,128,128,90';
poke[508]='ハリマロン,56,61,65,48,45,38';
poke[509]='ハリボーグ,61,78,95,56,58,57';
poke[510]='ブリガロン,88,107,122,74,75,64';
poke[511]='フォッコ,40,45,40,62,60,60';
poke[512]='テールナー,59,59,58,90,70,73';
poke[513]='マフォクシー,75,69,72,114,100,104';
poke[514]='ケロマツ,41,56,40,62,44,71';
poke[515]='ゲコガシラ,54,63,52,83,56,97';
poke[516]='ゲッコウガ,72,95,67,103,71,122';
poke[517]='ヤヤコマ,45,50,43,40,38,62';
poke[518]='ヒノヤコマ,62,73,55,56,52,84';
poke[519]='ファイアロー,78,81,71,74,69,126';
poke[520]='コフキムシ,38,35,40,27,25,35';
poke[521]='コフーライ,45,22,60,27,30,29';
poke[522]='ビビヨン,80,52,50,90,50,89';
poke[523]='シシコ,62,50,58,73,54,72';
poke[524]='カエンジシ(オスのすがた),86,68,72,109,66,106';
poke[525]='カエンジシ(メスのすがた),86,68,72,109,66,106';
poke[526]='フラベベ,44,38,39,61,79,42';
poke[527]='フラエッテ,54,45,47,75,98,52';
poke[528]='フラージェス,78,65,68,112,154,75';
poke[529]='メェークル,66,65,48,62,57,52';
poke[530]='ゴーゴート,123,100,62,97,81,68';
poke[531]='ニャスパー,62,48,54,63,60,68';
poke[532]='ニャオニクス(オス),74,48,76,83,81,104';
poke[533]='ニャオニクス(メス),74,48,76,83,81,104';
poke[534]='マーイーカ,53,54,53,37,46,45';
poke[535]='カラマネロ,86,92,88,68,75,73';
poke[536]='クズモー,50,60,60,60,60,30';
poke[537]='ドラミドロ,65,75,90,97,123,44';
poke[538]='ウデッポウ,50,53,62,58,63,44';
poke[539]='ブロスター,71,73,88,120,89,59';
poke[540]='ニンフィア,95,65,65,110,130,60';
poke[541]='ルチャブル,78,92,75,74,63,118';
poke[542]='デデンネ,67,58,57,81,67,101';
poke[543]='メレシー,50,50,150,50,150,50';
poke[544]='ヌメラ,45,50,35,55,75,40';
poke[545]='ヌメイル,68,75,53,83,113,60';
poke[546]='ヒスイヌメイル,58,75,83,83,113,40';
poke[547]='ヌメルゴン,90,100,70,110,150,80';
poke[548]='ヒスイヌメルゴン,80,100,100,110,150,60';
poke[549]='クレッフィ,57,80,91,80,87,75';
poke[550]='ボクレー,43,70,48,50,60,38';
poke[551]='オーロット,85,110,76,65,82,56';
poke[552]='カチコール,55,69,85,32,35,28';
poke[553]='クレベース,95,117,184,44,46,28';
poke[554]='ヒスイクレベース,95,127,184,34,36,38';
poke[555]='オンバット,40,30,35,45,40,55';
poke[556]='オンバーン,85,70,80,97,80,123';
poke[557]='ディアンシー,50,100,150,100,150,50';
poke[558]='フーパ(いましめられし),80,110,60,150,130,70';
poke[559]='フーパ(ときはなたれし),80,160,60,170,130,80';
poke[560]='ボルケニオン,80,110,120,130,90,70';
poke[561]='モクロー,68,55,55,50,50,42';
poke[562]='フクスロー,78,75,75,70,70,52';
poke[563]='ジュナイパー,78,107,75,100,100,70';
poke[564]='ヒスイジュナイパー,88,112,80,95,95,60';
poke[565]='ニャビー,45,65,40,60,40,70';
poke[566]='ニャヒート,65,85,50,80,50,90';
poke[567]='ガオガエン,95,115,90,80,90,60';
poke[568]='アシマリ,50,54,54,66,56,40';
poke[569]='オシャマリ,60,69,69,91,81,50';
poke[570]='アシレーヌ,80,74,74,126,116,60';
poke[571]='ツツケラ,35,75,30,30,30,65';
poke[572]='ケララッパ,55,85,50,40,50,75';
poke[573]='ドデカバシ,80,120,75,75,75,60';
poke[574]='ヤングース,48,70,30,30,30,45';
poke[575]='デカグース,88,110,60,55,60,45';
poke[576]='アゴジムシ,47,62,45,55,45,46';
poke[577]='デンヂムシ,57,82,95,55,75,36';
poke[578]='クワガノン,77,70,90,145,75,43';
poke[579]='マケンカニ,47,82,57,42,47,63';
poke[580]='ケケンカニ,97,132,77,62,67,43';
poke[581]='オドリドリ(めらめらスタイル),75,70,70,98,70,93';
poke[582]='オドリドリ(ぱちぱちスタイル),75,70,70,98,70,93';
poke[583]='オドリドリ(ふらふらスタイル),75,70,70,98,70,93';
poke[584]='オドリドリ(まいまいスタイル),75,70,70,98,70,93';
poke[585]='アブリー,40,45,40,55,40,84';
poke[586]='アブリボン,60,55,60,95,70,124';
poke[587]='イワンコ(通常),45,65,40,30,40,60';
poke[588]='イワンコ(マイペース),45,65,40,30,40,60';
poke[589]='ルガルガン(まひる),75,115,65,55,65,112';
poke[590]='ルガルガン(まよなか),85,115,75,55,75,82';
poke[591]='ルガルガン(たそがれ),75,117,65,55,65,110';
poke[592]='ヒドイデ,50,53,62,43,52,45';
poke[593]='ドヒドイデ,50,63,152,53,142,35';
poke[594]='ドロバンコ,70,100,70,45,55,45';
poke[595]='バンバドロ,100,125,100,55,85,35';
poke[596]='シズクモ,38,40,52,40,72,27';
poke[597]='オニシズクモ,68,70,92,50,132,42';
poke[598]='カリキリ,40,55,35,50,35,35';
poke[599]='ラランテス,70,105,90,80,90,45';
poke[600]='ヤトウモリ,48,44,40,71,40,77';
poke[601]='エンニュート,68,64,60,111,60,117';
poke[602]='アマカジ,42,30,38,30,38,32';
poke[603]='アママイコ,52,40,48,40,48,62';
poke[604]='アマージョ,72,120,98,50,98,72';
poke[605]='キュワワー,51,52,90,82,110,100';
poke[606]='ヤレユータン,90,60,80,90,110,60';
poke[607]='ナゲツケサル,100,120,90,40,60,80';
poke[608]='スナバァ,55,55,80,70,45,15';
poke[609]='シロデスナ,85,75,110,100,75,35';
poke[610]='メテノ(りゅうせいのすがた),60,60,100,60,100,60';
poke[611]='メテノ(コア),60,60,100,60,100,60';
poke[612]='ネッコアラ,65,115,65,75,95,65';
poke[613]='ミミッキュ,55,90,80,50,105,96';
poke[614]='ハギギシリ,68,105,70,70,70,92';
poke[615]='ジャラコ,45,55,65,45,45,45';
poke[616]='ジャランゴ,55,75,90,65,70,65';
poke[617]='ジャラランガ,75,110,125,100,105,85';
poke[618]='コスモッグ,43,29,31,29,31,37';
poke[619]='コスモウム,43,29,131,29,131,37';
poke[620]='ソルガレオ,137,137,107,113,89,97';
poke[621]='ルナアーラ,137,113,89,137,107,97';
poke[622]='ネクロズマ,97,107,101,127,89,79';
poke[623]='ネクロズマ(たそがれのたてがみ),97,157,127,113,109,77';
poke[624]='ネクロズマ(あかつきのつばさ),97,113,109,157,127,77';
poke[625]='マギアナ(通常),80,95,115,130,115,65';
poke[626]='マギアナ(500年前のすがた),80,95,115,130,115,65';
poke[627]='サルノリ,50,65,50,40,40,65';
poke[628]='バチンキー,70,85,70,55,60,80';
poke[629]='ゴリランダー,100,125,90,60,70,85';
poke[630]='ヒバニー,50,71,40,40,40,69';
poke[631]='ラビフット,65,86,60,55,60,94';
poke[632]='エースバーン,80,116,75,65,75,119';
poke[633]='メッソン,50,40,40,70,40,70';
poke[634]='ジメレオン,65,60,55,95,55,90';
poke[635]='インテレオン,70,85,65,125,65,120';
poke[636]='ホシガリス,70,55,55,35,35,25';
poke[637]='ヨクバリス,120,95,95,55,75,20';
poke[638]='ココガラ,38,47,35,33,35,57';
poke[639]='アオガラス,68,67,55,43,55,77';
poke[640]='アーマーガア,98,87,105,53,85,67';
poke[641]='カムカメ,50,64,50,38,38,44';
poke[642]='カジリガメ,90,115,90,48,68,74';
poke[643]='タンドン,30,40,50,40,50,30';
poke[644]='トロッゴン,80,60,90,60,70,50';
poke[645]='セキタンザン,110,80,120,80,90,30';
poke[646]='カジッチュ,40,40,80,40,40,20';
poke[647]='アップリュー,70,110,80,95,60,70';
poke[648]='タルップル,110,85,80,100,80,30';
poke[649]='スナヘビ,52,57,75,35,50,46';
poke[650]='サダイジャ,72,107,125,65,70,71';
poke[651]='ウッウ,70,85,55,85,95,85';
poke[652]='サシカマス,41,63,40,40,30,66';
poke[653]='カマスジョー,61,123,60,60,50,136';
poke[654]='エレズン,40,38,35,54,35,40';
poke[655]='ストリンダー(ハイのすがた),75,98,70,114,70,75';
poke[656]='ストリンダー(ローのすがた),75,98,70,114,70,75';
poke[657]='ヤバチャ(がんさくフォルム),40,45,45,74,54,50';
poke[658]='ヤバチャ(しんさくフォルム),40,45,45,74,54,50';
poke[659]='ポットデス(がんさくフォルム),60,65,65,134,114,70';
poke[660]='ポットデス(しんさくフォルム),60,65,65,134,114,70';
poke[661]='ミブリム,42,30,45,56,53,39';
poke[662]='テブリム,57,40,65,86,73,49';
poke[663]='ブリムオン,57,90,95,136,103,29';
poke[664]='ベロバー,45,45,30,55,40,50';
poke[665]='ギモー,65,60,45,75,55,70';
poke[666]='オーロンゲ,95,120,65,95,75,60';
poke[667]='ニャイキング,70,110,100,50,60,50';
poke[668]='マホミル,45,40,40,50,61,34';
poke[669]='マホイップ,65,60,75,110,121,64';
poke[670]='タイレーツ,65,100,100,70,60,75';
poke[671]='バチンウニ,48,101,95,91,85,15';
poke[672]='ユキハミ,30,25,35,45,30,20';
poke[673]='モスノウ,70,65,60,125,90,65';
poke[674]='イシヘンジン,100,125,135,20,20,70';
poke[675]='コオリッポ(アイスフェイス),75,80,110,65,90,50';
poke[676]='コオリッポ(ナイスフェイス),75,80,110,65,90,50';
poke[677]='イエッサン(オス),60,65,55,105,95,95';
poke[678]='イエッサン(メス),70,55,65,95,105,85';
poke[679]='モルペコ(まんぷくもよう),58,95,58,70,58,97';
poke[680]='モルペコ(はらぺこもよう),58,95,58,70,58,97';
poke[681]='ゾウドウ,72,80,49,40,49,40';
poke[682]='ダイオウドウ,122,130,69,80,69,30';
poke[683]='ジュラルドン,70,95,115,120,50,85';
poke[684]='ドラメシヤ,28,60,30,40,30,82';
poke[685]='ドロンチ,68,80,50,60,50,102';
poke[686]='ドラパルト,88,120,75,100,75,142';
poke[687]='ザシアン(れきせんのゆうしゃ),92,120,115,80,115,138';
poke[688]='ザシアン(けんのおう),92,120,115,80,115,138';
poke[689]='ザマゼンタ(れきせんのゆうしゃ),92,120,115,80,115,138';
poke[690]='ザマゼンタ(たてのおう),92,120,115,80,115,138';
poke[691]='ムゲンダイナ,140,85,95,145,95,130';
poke[692]='ダクマ,60,90,60,53,50,72';
poke[693]='ウーラオス(れんげき),100,130,100,63,60,97';
poke[694]='ウーラオス(いちげき),100,130,100,63,60,97';
poke[695]='ザルード(通常),105,120,105,70,95,105';
poke[696]='ザルード(オコヤのもり),105,120,105,70,95,105';
poke[697]='レジエレキ,80,100,50,100,50,200';
poke[698]='レジドラゴ,200,100,50,100,50,80';
poke[699]='ブリザポス,100,145,130,65,110,30';
poke[700]='レイスポス,100,65,60,145,80,130';
poke[701]='バドレックス,100,80,80,80,80,80';
poke[702]='バドレックス(こくば),100,85,80,165,100,150';
poke[703]='バドレックス(はくば),100,165,150,85,130,50';
poke[704]='アヤシシ,103,105,72,105,75,65';
poke[705]='バサギリ,70,135,95,45,70,85';
poke[706]='ガチグマ,130,140,105,45,80,50';
poke[707]='イダイトウ(オス),120,112,65,80,75,78';
poke[708]='イダイトウ(メス),120,92,65,100,75,78';
poke[709]='オオニューラ,80,130,60,40,80,120';
poke[710]='ハリーマン,85,115,95,65,65,85';
poke[711]='ラブトロス(けしんフォルム),74,115,70,135,80,106';
poke[712]='ラブトロス(れいじゅうフォルム),74,115,110,135,100,46';
poke[713]='ニャオハ,40,61,54,45,45,65';
poke[714]='ニャローテ,61,80,63,60,63,83';
poke[715]='マスカーニャ,76,110,70,81,70,123';
poke[716]='ホゲータ,67,45,59,63,40,36';
poke[717]='アチゲータ,81,55,78,90,58,49';
poke[718]='ラウドボーン,104,75,100,110,75,66';
poke[719]='クワッス,55,65,45,50,45,50';
poke[720]='ウェルカモ,70,85,65,65,60,65';
poke[721]='ウェーニバル,85,120,80,85,75,85';
poke[722]='グルトン,54,45,40,35,45,35';
poke[723]='パフュートン(オスのすがた),110,100,75,59,80,65';
poke[724]='パフュートン(メスのすがた),110,100,75,59,80,65';
poke[725]='タマンチュラ,35,41,45,29,40,20';
poke[726]='ワナイダー,60,79,92,52,86,35';
poke[727]='マメバッタ,33,46,40,21,25,45';
poke[728]='エクスレッグ,71,102,78,52,55,92';
poke[729]='パモ,45,50,20,40,25,60';
poke[730]='パモット,60,75,40,50,40,85';
poke[731]='パーモット,70,115,70,70,60,105';
poke[732]='ワッカネズミ,50,50,45,40,45,75';
poke[733]='イッカネズミ,74,75,70,65,75,111';
poke[734]='パピモッチ,37,55,70,30,55,65';
poke[735]='バウッツェル,57,80,115,50,80,95';
poke[736]='ミニーブ,41,35,45,58,51,30';
poke[737]='オリーニョ,52,53,60,78,78,33';
poke[738]='オリーヴァ,78,69,90,125,109,39';
poke[739]='イキリンコ,82,96,51,45,51,92';
poke[740]='コジオ,55,55,75,35,35,25';
poke[741]='ジオヅム,60,60,100,35,65,35';
poke[742]='キョジオーン,100,100,130,45,90,35';
poke[743]='カルボウ,40,50,40,50,40,35';
poke[744]='グレンアルマ,85,60,100,125,80,75';
poke[745]='ソウブレイズ,75,125,80,60,100,85';
poke[746]='ズピカ,61,31,41,59,35,45';
poke[747]='ハラバリー,109,64,91,103,83,45';
poke[748]='カイデン,40,40,35,55,40,70';
poke[749]='タイカイデン,70,70,60,105,60,125';
poke[750]='オラチフ,60,78,60,40,51,51';
poke[751]='マフィティフ,80,120,90,60,70,85';
poke[752]='シルシュルー,40,65,35,40,35,75';
poke[753]='タギングル,63,95,65,80,72,110';
poke[754]='アノクサ,40,65,30,45,35,60';
poke[755]='アノホラグサ,55,115,70,80,70,90';
poke[756]='ノノクラゲ,40,40,35,50,100,70';
poke[757]='リククラゲ,80,70,65,80,120,100';
poke[758]='ガケガニ,70,100,115,35,55,75';
poke[759]='カプサイジ,50,62,40,62,40,50';
poke[760]='スコヴィラン,65,108,65,108,65,75';
poke[761]='シガロコ,41,50,60,31,58,30';
poke[762]='ベラカス,75,50,85,115,100,45';
poke[763]='ヒラヒナ,30,35,30,55,30,75';
poke[764]='クエスパトラ,95,60,60,101,60,105';
poke[765]='カヌチャン,50,45,45,35,64,58';
poke[766]='ナカヌチャン,65,55,55,45,82,78';
poke[767]='デカヌチャン,85,75,77,70,105,94';
poke[768]='ウミディグダ,10,55,25,35,25,95';
poke[769]='ウミトリオ,35,100,50,50,70,120';
poke[770]='オトシドリ,70,103,85,60,85,82';
poke[771]='ナミイルカ,70,45,40,45,40,75';
poke[772]='イルカマン(ナイーブ),100,70,72,53,62,100';
poke[773]='イルカマン(マイティ),100,70,72,53,62,100';
poke[774]='ブロロン,45,70,63,30,45,47';
poke[775]='ブロロローム,80,119,90,54,67,90';
poke[776]='モトトカゲ,70,95,65,85,65,121';
poke[777]='ミミズズ,70,85,145,60,55,65';
poke[778]='キラーメ,48,35,42,105,60,60';
poke[779]='キラフロル,83,55,90,130,81,86';
poke[780]='ボチ,50,61,60,30,55,34';
poke[781]='ハカドッグ,72,101,100,50,97,68';
poke[782]='カラミンゴ,82,115,74,75,64,90';
poke[783]='アルクジラ,108,68,45,30,40,43';
poke[784]='ハルクジラ,170,113,65,45,55,73';
poke[785]='ミガルーサ,90,102,73,78,65,70';
poke[786]='ヘイラッシャ,150,100,115,65,65,35';
poke[787]='シャリタツ(そった),68,50,60,120,95,82';
poke[788]='シャリタツ(たれた),68,50,60,120,95,82';
poke[789]='シャリタツ(のびた),68,50,60,120,95,82';
poke[790]='コノヨザル,110,115,80,50,90,90';
poke[791]='ドオー,130,75,60,45,100,20';
poke[792]='リキキリン,120,90,70,110,70,60';
poke[793]='ノココッチ,125,100,80,85,75,55';
poke[794]='ドドゲザン,100,135,120,60,85,50';
poke[795]='イダイナキバ,115,131,131,53,53,87';
poke[796]='サケブシッポ,115,65,99,65,115,111';
poke[797]='アラブルタケ,111,127,99,79,99,55';
poke[798]='ハバタクカミ,55,55,55,135,135,135';
poke[799]='チヲハウハネ,85,135,79,85,105,81';
poke[800]='スナノケガワ,85,81,97,121,85,101';
poke[801]='テツノワダチ,90,112,120,72,70,106';
poke[802]='テツノツツミ,56,80,114,124,60,136';
poke[803]='テツノカイナ,154,140,108,50,68,50';
poke[804]='テツノコウベ,94,80,86,122,80,108';
poke[805]='テツノドクガ,80,70,60,140,110,110';
poke[806]='テツノイバラ,100,134,110,70,84,72';
poke[807]='セビエ,65,75,45,35,45,55';
poke[808]='セゴール,90,95,66,45,65,62';
poke[809]='セグレイブ,115,145,92,75,86,87';
poke[810]='コレクレー(はこフォルム),45,30,70,75,70,10';
poke[811]='コレクレー(とほフォルム),45,30,25,75,45,80';
poke[812]='サーフゴー,87,60,95,133,91,84';
poke[813]='チオンジェン,85,85,100,95,135,70';
poke[814]='パオジアン,80,120,80,90,65,135';
poke[815]='ディンルー,155,110,125,55,80,45';
poke[816]='イーユイ,55,80,80,135,120,100';
poke[817]='トドロクツキ,105,139,71,55,101,119';
poke[818]='テツノブジン,74,130,90,120,60,116';
poke[819]='コライドン,100,135,115,85,100,135';
poke[820]='ミライドン,100,85,100,135,115,135';
poke[821]='ウネルミナモ,99,83,91,125,83,109';
poke[822]='テツノイサハ,90,130,88,70,108,104';
poke[823]='カミッチュ,80,80,110,95,80,40';
poke[824]='チャデス(マガイモノのすがた),40,45,45,74,54,50';
poke[825]='チャデス(タカイモノのすがた),40,45,45,74,54,50';
poke[826]='ヤバソチャ(ボンサクのすがた),71,60,106,121,80,70';
poke[827]='ヤバソチャ(ケッサクのすがた),71,60,106,121,80,70';
poke[828]='イイネイヌ,88,128,115,58,86,80';
poke[829]='マシマシラ,88,75,66,130,90,106';
poke[830]='キチキギス,88,91,82,70,125,99';
poke[831]='オーガポン,80,120,84,60,96,110';
poke[832]='オーガポン(かまどのめん),80,120,84,60,96,110';
poke[833]='オーガポン(いどのめん),80,120,84,60,96,110';
poke[834]='オーガポン(いしずえのめん),80,120,84,60,96,110';
poke[835]='ブリジュラス,90,105,130,125,65,85';
poke[836]='カミツオロチ,106,80,110,120,80,44';
poke[837]='ウガツホムラ,105,115,121,65,93,91';
poke[838]='タケルライコ,125,73,91,137,89,75';
poke[839]='テツノイワオ,90,120,80,68,108,124';
poke[840]='テツノカシラ,90,72,100,122,108,98';
poke[841]='ガチグマ(アカツキ),113,70,120,135,65,52';
poke[842]='テラパゴス(ノーマルフォルム),90,65,85,65,85,60';
poke[843]='テラパゴス(テラスタルフォルム),90,65,85,65,85,60';
poke[844]='テラパゴス(ステラフォルム),90,65,85,65,85,60';
poke[845]='モモワロウ,88,88,160,88,88,88';

let name=document.getElementById('name');
let codeType=document.getElementById('codeType');

let h_s = document.getElementById('h_s');
let a_s = document.getElementById('a_s');
let b_s = document.getElementById('b_s');
let c_s = document.getElementById('c_s');
let d_s = document.getElementById('d_s');
let s_s = document.getElementById('s_s');

let h_k = document.getElementById('h_k');
let a_k = document.getElementById('a_k');
let b_k = document.getElementById('b_k');
let c_k = document.getElementById('c_k');
let d_k = document.getElementById('d_k');
let s_k = document.getElementById('s_k');

let h_d = document.getElementById('h_d');
let a_d = document.getElementById('a_d');
let b_d = document.getElementById('b_d');
let c_d = document.getElementById('c_d');
let d_d = document.getElementById('d_d');
let s_d = document.getElementById('s_d');

let h_z = document.getElementById('h_z');
let a_z = document.getElementById('a_z');
let b_z = document.getElementById('b_z');
let c_z = document.getElementById('c_z');
let d_z = document.getElementById('d_z');
let s_z = document.getElementById('s_z');

let h_ch = document.getElementById('h_ch');
let a_ch = document.getElementById('a_ch');
let b_ch = document.getElementById('b_ch');
let c_ch = document.getElementById('c_ch');
let d_ch = document.getElementById('d_ch');
let s_ch = document.getElementById('s_ch');

let b_o=document.getElementById("b_o");
let d_o=document.getElementById("d_o");

let a_vs_c = document.getElementById('a_vs_c');
let a_vs_c_value = document.getElementById('a_vs_c_value');

let poketai = document.getElementById('poketai');
let reset = document.getElementById('reset');

let sum1 = document.getElementById('sum1');
let sum2 = document.getElementById('sum2');

let result = document.getElementById('result');
let del=document.getElementById("del");

let i;
let j;
let k;
let l=poke.length;
let re;
let ary;

let h_s_value;
let a_s_value;
let b_s_value;
let c_s_value;
let d_s_value;
let s_s_value;

let h_k_value;
let a_k_value;
let b_k_value;
let c_k_value;
let d_k_value;
let s_k_value;

let h_d_value;
let a_d_value;
let b_d_value;
let c_d_value;
let d_d_value;
let s_d_value;

let h_ch_value;
let a_ch_value;
let b_ch_value;
let c_ch_value;
let d_ch_value;
let s_ch_value;

let h_z_value;
let a_z_value;
let b_z_value;
let c_z_value;
let d_z_value;
let s_z_value;

let sum_d;

AllPokemon();

window.addEventListener("input",function(){Zupdate()});
function Zupdate(){
	if(h_s.innerHTML!="-"){
		h_s_value=Number(h_s.innerHTML);
		a_s_value=Number(a_s.innerHTML);
		b_s_value=Number(b_s.innerHTML);
		c_s_value=Number(c_s.innerHTML);
		d_s_value=Number(d_s.innerHTML);
		s_s_value=Number(s_s.innerHTML);
		
		h_k_value=Number(h_k.value);
		a_k_value=Number(a_k.value);
		b_k_value=Number(b_k.value);
		c_k_value=Number(c_k.value);
		d_k_value=Number(d_k.value);
		s_k_value=Number(s_k.value);
		
		h_d_value=Number(h_d.value);
		a_d_value=Number(a_d.value);
		b_d_value=Number(b_d.value);
		c_d_value=Number(c_d.value);
		d_d_value=Number(d_d.value);
		s_d_value=Number(s_d.value);
		
		a_ch_value=Number(a_ch.value);
		b_ch_value=Number(b_ch.value);
		c_ch_value=Number(c_ch.value);
		d_ch_value=Number(d_ch.value);
		s_ch_value=Number(s_ch.value);
		
		h_z.innerHTML= 10 + Number(level.value) + Math.floor((h_s_value * 2 + h_k_value + Math.floor(h_d_value / 4)) * level.value / 100);
		a_z.innerHTML=Math.floor((5 + Math.floor((a_s_value * 2 + a_k_value + Math.floor(a_d_value / 4)) * level.value / 100)) * a_ch_value);
		b_z.innerHTML=Math.floor((5 + Math.floor((b_s_value * 2 + b_k_value + Math.floor(b_d_value / 4)) * level.value / 100)) * b_ch_value);
		c_z.innerHTML=Math.floor((5 + Math.floor((c_s_value * 2 + c_k_value + Math.floor(c_d_value / 4)) * level.value / 100)) * c_ch_value);
		d_z.innerHTML=Math.floor((5 + Math.floor((d_s_value * 2 + d_k_value + Math.floor(d_d_value / 4)) * level.value / 100)) * d_ch_value);
		s_z.innerHTML=Math.floor((5 + Math.floor((s_s_value * 2 + s_k_value + Math.floor(s_d_value / 4)) * level.value / 100)) * s_ch_value);
	}else{
		h_z.innerHTML="-";
		a_z.innerHTML="-";
		b_z.innerHTML="-";
		c_z.innerHTML="-";
		d_z.innerHTML="-";
		s_z.innerHTML="-";
	}
}

name.oninput = function() {
	for(i=0;i<l;i++){
		ary = poke[i].split(',');
		if(ary[0]==name.value){
			h_s.innerHTML=ary[1];
			a_s.innerHTML=ary[2];
			b_s.innerHTML=ary[3];
			c_s.innerHTML=ary[4];
			d_s.innerHTML=ary[5];
			s_s.innerHTML=ary[6];
			sum1.innerHTML=Number(ary[1])+Number(ary[2])+Number(ary[3])+Number(ary[4])+Number(ary[5])+Number(ary[6]);
			break;
		}else{
			h_s.innerHTML="-";
			a_s.innerHTML="-";
			b_s.innerHTML="-";
			c_s.innerHTML="-";
			d_s.innerHTML="-";
			s_s.innerHTML="-";
			sum1.innerHTML="-";
		}
	}
};

h_d.oninput = function(){Dlimit("h")};
a_d.oninput = function(){Dlimit("a")};
b_d.oninput = function(){Dlimit("b")};
c_d.oninput = function(){Dlimit("c")};
d_d.oninput = function(){Dlimit("d")};
s_d.oninput = function(){Dlimit("s")};
function Dlimit(x) {
	h_d_value=Number(h_d.value);
	a_d_value=Number(a_d.value);
	b_d_value=Number(b_d.value);
	c_d_value=Number(c_d.value);
	d_d_value=Number(d_d.value);
	s_d_value=Number(s_d.value);
	sum_d=h_d_value+a_d_value+b_d_value+c_d_value+d_d_value+s_d_value;
	if(sum_d>508){
		if(x=="a"){
			a_d.value=508-(h_d_value+b_d_value+c_d_value+d_d_value+s_d_value);
		}else if(x=="b"){
			b_d.value=508-(h_d_value+a_d_value+c_d_value+d_d_value+s_d_value);
		}else if(x=="h"){
			h_d.value=508-(b_d_value+a_d_value+c_d_value+d_d_value+s_d_value);
		}else if(x=="c"){
			c_d.value=508-(b_d_value+a_d_value+h_d_value+d_d_value+s_d_value);
		}else if(x=="d"){
			d_d.value=508-(b_d_value+a_d_value+c_d_value+h_d_value+s_d_value);
		}else if(x=="s"){
			s_d.value=508-(b_d_value+a_d_value+c_d_value+d_d_value+h_d_value);
		}
	}
	sum2.innerHTML=Number(h_d.value)+Number(a_d.value)+Number(b_d.value)+Number(c_d.value)+Number(d_d.value)+Number(s_d.value);
}

a_ch.oninput = function(){CHlimit("a")};
b_ch.oninput = function(){CHlimit("b")};
c_ch.oninput = function(){CHlimit("c")};
d_ch.oninput = function(){CHlimit("d")};
s_ch.oninput = function(){CHlimit("s")};
function CHlimit(x){
	a_ch_value=Number(a_ch.value);
	b_ch_value=Number(b_ch.value);
	c_ch_value=Number(c_ch.value);
	d_ch_value=Number(d_ch.value);
	s_ch_value=Number(s_ch.value);
	if(x=="a" && a_ch_value!=1){
		if(a_ch_value==b_ch_value){
			b_ch.value="1";
		}else if(a_ch_value==c_ch_value){
			c_ch.value="1";
		}else if(a_ch_value==d_ch_value){
			d_ch.value="1";
		}else if(a_ch_value==s_ch_value){
			s_ch.value="1";
		}
	}else if(x=="b" && b_ch_value!=1){
		if(b_ch_value==a_ch_value){
			a_ch.value="1";
		}else if(b_ch_value==c_ch_value){
			c_ch.value="1";
		}else if(b_ch_value==d_ch_value){
			d_ch.value="1";
		}else if(b_ch_value==s_ch_value){
			s_ch.value="1";
		}
	}else if(x=="c" && c_ch_value!=1){
		if(c_ch_value==b_ch_value){
			b_ch.value="1";
		}else if(c_ch_value==a_ch_value){
			a_ch.value="1";
		}else if(c_ch_value==d_ch_value){
			d_ch.value="1";
		}else if(c_ch_value==s_ch_value){
			s_ch.value="1";
		}
	}else if(x=="d" && d_ch_value!=1){
		if(d_ch_value==b_ch_value){
			b_ch.value="1";
		}else if(d_ch_value==c_ch_value){
			c_ch.value="1";
		}else if(d_ch_value==a_ch_value){
			a_ch.value="1";
		}else if(d_ch_value==s_ch_value){
			s_ch.value="1";
		}
	}else if(x=="s" && s_ch_value!=1){
		if(s_ch_value==b_ch_value){
			b_ch.value="1";
		}else if(s_ch_value==c_ch_value){
			c_ch.value="1";
		}else if(s_ch_value==d_ch_value){
			d_ch.value="1";
		}else if(s_ch_value==a_ch_value){
			a_ch.value="1";
		}
	}
}

a_vs_c_value.textContent = a_vs_c.value + "%";
a_vs_c.addEventListener("input", function(event){
	a_vs_c_value.textContent = event.target.value + "%";
});

poketai.addEventListener("click", function(event){
	if(h_s.innerHTML!="-"){
		h_s_value = Number(h_s.innerHTML);
		h_k_value = Number(h_k.value);
		h_d_value = Number(h_d.value);
		
		b_s_value = Number(b_s.innerHTML);
		b_k_value = Number(b_k.value);
		b_d_value = Number(b_d.value);
		b_ch_value = Number(b_ch.value);
		
		d_s_value = Number(d_s.innerHTML);
		d_k_value = Number(d_k.value);
		d_d_value = Number(d_d.value);
		d_ch_value = Number(d_ch.value);
		
		l_value = Number(level.value);
		a_ch_value = Number(a_ch.value);
		c_ch_value = Number(c_ch.value);
		s_ch_value = Number(s_ch.value);
		a_d_value=Number(a_d.value);
		c_d_value=Number(c_d.value);
		s_d.value=Number(s_d.value);
		
		let vs = Number(a_vs_c.value);
		let k1;
		let k2;
		if(vs == 100){
			k1 = 1;
			k2 = 0;
		}else{
			k1 = vs / (100 - vs);
			k2 = 1;
		}
		
		let c1=Number(b_o.value);
		let c2=Number(d_o.value);
		
		let nokori = 508 - Number(sum2.innerHTML);
		let nokori2;
		let nokori3;
		let h_nokori = 252 - h_d_value;
		let b_nokori = 252 - b_d_value;
		let d_nokori = 252 - d_d_value;
		
		let i_h_max;
		let i_b_max
		let i_d_max
		if(h_nokori < nokori){
			i_h_max = h_nokori;
		}else{
			i_h_max = nokori;
		}
		
		let i_h;
		let i_b;
		let i_d;
		
		let h1;
		let h2;
		let b1;
		let b2;
		let d1;
		let d2;
		
		let list1=[];
		let list2=[];
		let list3=[];
		let list4=[];
		let list5=[];
		let list6=[];
		let list7=[];
		
		let b_ch_list=[];
		if(b_ch_value==0.9 || b_ch_value==1.1){
			b_ch_list.push(b_ch_value);
		}else{
			if(a_ch_value==1.1 || c_ch_value==1.1 || d_ch_value==1.1 || s_ch_value==1.1){
				b_ch_list.push(1);
			}else{
				b_ch_list.push(1);
				b_ch_list.push(1.1);
			}
		}
		let d_ch_list=[];
		if(d_ch_value==0.9 || d_ch_value==1.1){
			d_ch_list.push(d_ch_value);
		}else{
			if(a_ch_value==1.1 || c_ch_value==1.1 || b_ch_value==1.1 || s_ch_value==1.1){
				d_ch_list.push(1);
			}else{
				d_ch_list.push(1);
				d_ch_list.push(1.1);
			}
		}
		let b_ch_l=b_ch_list.length;
		let d_ch_l=d_ch_list.length;
		for(j=0;j<b_ch_l;j++){
			b_ch_value=Number(b_ch_list[j]);
			for(k=0;k<d_ch_l;k++){
				d_ch_value=Number(d_ch_list[k]);
				if(b_ch_value==1 || b_ch_value!=d_ch_value){
					for(i_h=0;i_h<=i_h_max;i_h++){
						h1=10+l_value+ Math.floor((h_s_value*2+h_k_value+ Math.floor((h_d_value+i_h-1)/4))*l_value/100);
						h2=10+l_value+ Math.floor((h_s_value*2+h_k_value+ Math.floor((h_d_value+i_h)/4))*l_value/100);
						if(i_h==0 || h1!=h2){
							nokori2=nokori-i_h;
							if(b_nokori < nokori2){
								i_b_max = b_nokori;
							}else{
								i_b_max = nokori2;
							}
							for(i_b = 0; i_b <= i_b_max; i_b++){
								b1 = Math.floor(Math.floor((5 + Math.floor((b_s_value * 2 + b_k_value + Math.floor((b_d_value + i_b - 1) / 4)) * l_value / 100)) * b_ch_value) * c1);
								b2 = Math.floor(Math.floor((5 + Math.floor((b_s_value * 2 + b_k_value + Math.floor((b_d_value + i_b) / 4)) * l_value / 100)) * b_ch_value) * c1);
								if(i_b == 0 || b1 != b2){
									nokori3 = nokori2 - i_b;
									if(d_nokori < nokori3){
										i_d_max = d_nokori;
									}else{
										i_d_max = nokori3;
									}
									for(i_d = 0; i_d <= i_d_max; i_d++){
										d1 = Math.floor(Math.floor((5 + Math.floor((d_s_value * 2 + d_k_value + Math.floor((d_d_value + i_d - 1) / 4)) * l_value / 100)) * d_ch_value) * c2);
										d2 = Math.floor(Math.floor((5 + Math.floor((d_s_value * 2 + d_k_value + Math.floor((d_d_value + i_d) / 4)) * l_value / 100)) * d_ch_value) * c2);
										if(i_d == 0 || d1 != d2){
											list1.push((h2 * b2 * d2 / (k1*b2 + k2*d2)).toFixed(2));
											list2.push(h_d_value+i_h);
											list3.push(b_d_value+i_b);
											list4.push(d_d_value+i_d);
											list5.push(nokori3-i_d);
											list6.push(b_ch_value);
											list7.push(d_ch_value);
										}
									}
								}
							}
						}
					}
				}
			}
		}
		let list8=Array.from(new Set(list1));
		let big=function(x,y){
			return y-x;
		};
		list8=list8.sort(big);
		if(list8.length<4){
			i=list8.length-1;
		}else{
			i=4;
		}
		let re1=[];
		let	re2=[];
		let	re3=[];
		let	re4=[];
		let	re5=[];
		let	re6=[];
		let	re7=[];
		let re8=[];
		let idx;
		for(j=0;j<=i;j++){
			idx=list1.indexOf(list8[j])
			re1.push(list1[idx]);
			re2.push(list2[idx]);
			re3.push(list3[idx]);
			re4.push(list4[idx]);
			re5.push(list5[idx]);
			re6.push(list6[idx]);
			re7.push(list7[idx]);
			re8.push(j+1);
			for(k=0;k>=0;k++){
				idx=list1.indexOf(list8[j],idx+1);
				if(idx==-1){
					break;
				}
				re1.push(list1[idx]);
				re2.push(list2[idx]);
				re3.push(list3[idx]);
				re4.push(list4[idx]);
				re5.push(list5[idx]);
				re6.push(list6[idx]);
				re7.push(list7[idx]);
				re8.push(j+1);
			}
		}
		h_z.innerHTML = 10 + l_value + Math.floor((h_s_value * 2 + h_k_value + Math.floor((re2[0]) / 4)) * l_value / 100);
		b_z.innerHTML = Math.floor((5 + Math.floor((b_s_value * 2 + b_k_value + Math.floor((re3[0]) / 4)) * l_value / 100)) * re6[0]);
		d_z.innerHTML = Math.floor((5 + Math.floor((d_s_value * 2 + d_k_value + Math.floor((re4[0]) / 4)) * l_value / 100)) * re7[0]);
		h_d.value = re2[0];
		b_d.value = re3[0];
		d_d.value = re4[0];
		b_ch.value = re6[0];
		d_ch.value = re7[0];
		sum2.innerHTML=508-re5[0];
		
		re = '<tr align="center"><td width="30px">順位</td><td width="65px">S</td><td width="65px">H実数値</br>H努力値</td><td width="65px">B実数値</br>B努力値</td><td width="65px">D実数値</br>D努力値</td><td width="65px">性格補正</td><td width="65px">残努力値</td></tr>';
		i=re1.length;
		for(j=0;j<i;j++){
			h1 = 10 + l_value + Math.floor((h_s_value * 2 + h_k_value + Math.floor((re2[j]) / 4)) * l_value / 100);
			b1 = Math.floor((5 + Math.floor((b_s_value * 2 + b_k_value + Math.floor((re3[j]) / 4)) * l_value / 100)) * re6[j]);
			d1 = Math.floor((5 + Math.floor((d_s_value * 2 + d_k_value + Math.floor((re4[j]) / 4)) * l_value / 100)) * re7[j]);
			re=re+'<tr align="center"><td>'+re8[j]+'</td><td>'+re1[j]+'</td>';
			re=re+'<td>'+h1+'</br>'+re2[j]+'</td>';
			re=re+'<td>'+b1+'</br>'+re3[j]+'</td>';
			re=re+'<td>'+d1+'</br>'+re4[j]+'</td>';
			if(re6[j]==1.1){
				re=re+'<td>ぼうぎょ</td>';
			}else if(re7[j]==1.1){
				re=re+'<td>とくぼう</td>';
			}else if(a_ch_value==1.1){
				re=re+'<td>こうげき</td>';
			}else if(c_ch_value==1.1){
				re=re+'<td>とくこう</td>';
			}else if(s_ch_value==1.1){
				re=re+'<td>すばやさ</td>';
			}else{
				re=re+'<td>-</td>';
			}
			re=re+'<td>'+re5[j]+'</td></tr>';
		}
		result.innerHTML=re;
		document.querySelector(".result").style.display = "block";
	}
});

reset.addEventListener("click", function(event){
	h_d.value=0;
	a_d.value=0;
	b_d.value=0;
	c_d.value=0;
	d_d.value=0;
	s_d.value=0;
	sum2.innerHTML=0;
	a_ch.value="1";
	b_ch.value="1";
	c_ch.value="1";
	d_ch.value="1";
	s_ch.value="1";
	Zupdate();
});

del.addEventListener("click", function(event){
	document.querySelector(".result").style.display = "none";
});

function AllPokemon(){
	re="";
	for(i=0;i<l;i++){
		ary = poke[i].split(',');
		re=re+'<option value="'+ary[0]+'">'+ary[0]+'</option>';
	}
	codeType.innerHTML = re;
}

